author: Markus Neis
date: 2017/08/28
description: Detects the execution of a Sysinternals Tool via the creation of the
  "accepteula" registry key
detection:
  condition: selection
  selection:
    EventType: CreateKey
    TargetObject|endswith: \EulaAccepted
falsepositives:
- Legitimate use of SysInternals tools
- Programs that use the same Registry Key
id: 25ffa65d-76d8-4da5-a832-3f2b0136e133
level: low
logsource:
  category: registry_add
  product: windows
modified: 2023/02/07
references:
- https://twitter.com/Moti_B/status/1008587936735035392
status: test
tags:
- attack.resource_development
- attack.t1588.002
title: PUA - Sysinternal Tool Execution - Registry
