author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/21
description: Detects when an attacker registers a new AMSI provider in order to achieve
  persistence
detection:
  condition: selection and not filter
  filter:
    Image|startswith:
    - C:\Windows\System32\
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
    EventType: CreateKey
    TargetObject|contains:
    - \SOFTWARE\Microsoft\AMSI\Providers\
    - \SOFTWARE\WOW6432Node\Microsoft\AMSI\Providers\
falsepositives:
- Legitimate security products adding their own AMSI providers. Filter these according
  to your environment
id: 33efc23c-6ea2-4503-8cfe-bdf82ce8f705
level: high
logsource:
  category: registry_add
  product: windows
modified: 2023/02/07
references:
- https://persistence-info.github.io/Data/amsi.html
- https://github.com/gtworek/PSBits/blob/8d767892f3b17eefa4d0668f5d2df78e844f01d8/FakeAMSI/FakeAMSI.c
status: test
tags:
- attack.persistence
title: Potential Persistence Via New AMSI Providers - Registry
