author: Tom Ueltschi (@c_APT_ure)
date: 2019/01/12
description: Detects creation of "UserInitMprLogonScript" registry value which can
  be used as a persistence method by malicious actors
detection:
  condition: selection
  selection:
    EventType: CreateKey
    TargetObject|contains: UserInitMprLogonScript
falsepositives:
- Investigate the contents of the "UserInitMprLogonScript" value to determine of the
  added script is legitimate
id: 9ace0707-b560-49b8-b6ca-5148b42f39fb
level: medium
logsource:
  category: registry_add
  product: windows
modified: 2023/06/09
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1037.001/T1037.001.md
status: test
tags:
- attack.t1037.001
- attack.persistence
- attack.lateral_movement
title: Potential Persistence Via Logon Scripts - Registry
