author: Kutepov Anton, oscd.community
date: 2019/10/23
description: Detects COM object hijacking via TreatAs subkey
detection:
  condition: selection and not 1 of filter_*
  filter_svchost:
    Image: C:\WINDOWS\system32\svchost.exe
  selection:
    EventType: CreateKey
    TargetObject|contains|all:
    - HKU\
    - Classes\CLSID\
    - \TreatAs
falsepositives:
- Maybe some system utilities in rare cases use linking keys for backward compatibility
id: 9b0f8a61-91b2-464f-aceb-0527e0a45020
level: medium
logsource:
  category: registry_add
  product: windows
modified: 2023/02/07
references:
- https://bohops.com/2018/08/18/abusing-the-com-registry-structure-part-2-loading-techniques-for-evasion-and-persistence/
status: test
tags:
- attack.persistence
- attack.t1546.015
title: Potential COM Object Hijacking Via TreatAs Subkey - Registry
