author: Austin Songer
date: 2021/08/24
description: Detects when an a role is modified or deleted in Google Workspace.
detection:
  condition: selection
  selection:
    eventName:
    - DELETE_ROLE
    - RENAME_ROLE
    - UPDATE_ROLE
    eventService: admin.googleapis.com
falsepositives:
- Unknown
id: 6aef64e3-60c6-4782-8db3-8448759c714e
level: medium
logsource:
  product: gcp
  service: google_workspace.admin
modified: 2023/10/11
references:
- https://cloud.google.com/logging/docs/audit/gsuite-audit-logging#3
- https://developers.google.com/admin-sdk/reports/v1/appendix/activity/admin-delegated-admin-settings
status: test
tags:
- attack.impact
title: Google Workspace Role Modified or Deleted
