author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/03
description: Detects sign-in with properties that are unfamiliar to the user. The
  detection considers past sign-in history to look for anomalous sign-ins.
detection:
  condition: selection
  selection:
    riskEventType: unfamiliarFeatures
falsepositives:
- User changing to a new device, location, browser, etc.
id: 128faeef-79dd-44ca-b43c-a9e236a60f49
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#unfamiliar-sign-in-properties
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.initial_access
title: Unfamiliar Sign-In Properties
