author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/07
description: Indicates access attempt to the PRT resource which can be used to move
  laterally into an organization or perform credential theft
detection:
  condition: selection
  selection:
    riskEventType: attemptedPrtAccess
falsepositives:
- This detection is low-volume and is seen infrequently in most organizations. When
  this detection appears it's high risk, and users should be remediated.
id: a84fc3b1-c9ce-4125-8e74-bdcdb24021f1
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#possible-attempt-to-access-primary-refresh-token-prt
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1528
- attack.credential_access
title: Primary Refresh Token Access Attempt
