author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/03
description: Indicates the SAML token issuer for the associated SAML token is potentially
  compromised. The claims included in the token are unusual or match known attacker
  patterns
detection:
  condition: selection
  selection:
    riskEventType: tokenIssuerAnomaly
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
id: e3393cba-31f0-4207-831e-aef90ab17a8c
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#token-issuer-anomaly
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1606
- attack.credential_access
title: SAML Token Issuer Anomaly
