author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/03
description: Identifies that users were active from an IP address that has been identified
  as an anonymous proxy IP address.
detection:
  condition: selection
  selection:
    riskEventType: riskyIPAddress
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
id: be4d9c86-d702-4030-b52e-c7859110e5e8
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#activity-from-anonymous-ip-address
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.defense_evasion
- attack.privilege_escalation
- attack.initial_access
title: Activity From Anonymous IP Address
