author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/07
description: Indicates sign-in from a malicious IP address based on high failure rates.
detection:
  condition: selection
  selection:
    riskEventType: maliciousIPAddress
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins from the user.
id: a3f55ebd-0c01-4ed6-adc0-8fb76d8cd3cd
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#malicious-ip-address
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1090
- attack.command_and_control
title: Malicious IP Address Sign-In Failure Rate
