author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/03
description: Detects suspicious rules that delete or move messages or folders are
  set on a user's inbox.
detection:
  condition: selection
  selection:
    riskEventType: mcasSuspiciousInboxManipulationRules
falsepositives:
- Actual mailbox rules that are moving items based on their workflow.
id: ceb55fd0-726e-4656-bf4e-b585b7f7d572
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#suspicious-inbox-manipulation-rules
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1140
- attack.defense_evasion
title: Suspicious Inbox Manipulation Rules
