author: Gloria Lee, '@gleeiamglo'
date: 2023/08/22
description: Indicates sign-ins from an anonymous IP address, for example, using an
  anonymous browser or VPN.
detection:
  condition: selection
  selection:
    riskEventType: anonymizedIPAddress
falsepositives:
- We recommend investigating the sessions flagged by this detection in the context
  of other sign-ins
id: 53acd925-2003-440d-a1f3-71a5253fe237
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/graph/api/resources/riskdetection?view=graph-rest-1.0
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#anonymous-ip-address
status: experimental
tags:
- attack.t1528
- attack.credential_access
title: Anonymous IP Address
