author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/03
description: Indicates that the user's valid credentials have been leaked.
detection:
  condition: selection
  selection:
    riskEventType: leakedCredentials
falsepositives:
- A rare hash collision.
id: 19128e5e-4743-48dc-bd97-52e5775af817
level: high
logsource:
  product: azure
  service: riskdetection
references:
- https://learn.microsoft.com/en-us/azure/active-directory/identity-protection/concept-identity-protection-risks#leaked-credentials
- https://learn.microsoft.com/en-us/azure/active-directory/architecture/security-operations-user-accounts#unusual-sign-ins
status: experimental
tags:
- attack.t1589
- attack.reconnaissance
title: Azure AD Account Credential Leaked
