author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: 2019/08/10
description: Detects remote PowerShell sessions
detection:
  condition: selection and not 1 of filter_*
  filter_pwsh_archive:
    ContextInfo|contains: \Windows\system32\WindowsPowerShell\v1.0\Modules\Microsoft.PowerShell.Archive\Microsoft.PowerShell.Archive.psm1
  selection:
    ContextInfo|contains|all:
    - ' = ServerRemoteHost '
    - wsmprovhost.exe
falsepositives:
- Legitimate use remote PowerShell sessions
id: 96b9f619-aa91-478f-bacb-c3e50f8df575
level: high
logsource:
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
  product: windows
modified: 2023/01/20
references:
- https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Remote PowerShell Session (PS Module)
