author: Nikita Nazarov, oscd.community
date: 2019/10/08
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  condition: selection_4103
  selection_4103:
    Payload|contains:
    - value
    - invoke
    - comspec
    - iex
    Payload|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
falsepositives:
- Unknown
id: 88a22f69-62f9-4b8a-aa00-6b0212f2f05a
level: high
logsource:
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
  product: windows
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
related:
- id: a5a30a6e-75ca-4233-8b8c-42e0f2037d3b
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Rundll32 - PowerShell Module
