author: frack113
date: 2022/02/21
description: 'The Reset-ComputerMachinePassword cmdlet changes the computer account
  password that the computers use to authenticate to the domain controllers in the
  domain.

  You can use it to reset the password of the local computer.

  '
detection:
  condition: selection
  selection:
    ContextInfo|contains: Reset-ComputerMachinePassword
falsepositives:
- Administrator PowerShell scripts
id: e3818659-5016-4811-a73c-dde4679169d2
level: medium
logsource:
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
  product: windows
references:
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.management/reset-computermachinepassword?view=powershell-5.1
- https://thedfirreport.com/2022/02/21/qbot-and-zerologon-lead-to-full-domain-compromise/
status: test
tags:
- attack.initial_access
- attack.t1078
title: Suspicious Computer Machine Password by PowerShell
