author: Daniel Bohannon (@Mandiant/@FireEye), oscd.community
date: 2019/11/08
description: Detects all variations of obfuscated powershell IEX invocation code generated
  by Invoke-Obfuscation framework from the code block cited in the reference section
  below
detection:
  condition: selection_payload
  selection_payload:
  - Payload|re: \$PSHome\[\s*\d{1,3}\s*\]\s*\+\s*\$PSHome\[
  - Payload|re: \$ShellId\[\s*\d{1,3}\s*\]\s*\+\s*\$ShellId\[
  - Payload|re: \$env:Public\[\s*\d{1,3}\s*\]\s*\+\s*\$env:Public\[
  - Payload|re: \$env:ComSpec\[(\s*\d{1,3}\s*,){2}
  - Payload|re: \*mdr\*\W\s*\)\.Name
  - Payload|re: \$VerbosePreference\.ToString\(
  - Payload|re: \[String\]\s*\$VerbosePreference
falsepositives:
- Unknown
id: 2f211361-7dce-442d-b78a-c04039677378
level: high
logsource:
  category: ps_module
  definition: 0ad03ef1-f21b-4a79-8ce8-e6900c54b65b
  product: windows
modified: 2022/12/31
references:
- https://github.com/danielbohannon/Invoke-Obfuscation/blob/f20e7f843edd0a3a7716736e9eddfa423395dd26/Out-ObfuscatedStringCommand.ps1#L873-L888
related:
- id: 1b9dc62e-6e9e-42a3-8990-94d7a10007f7
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Obfuscated IEX Invocation - PowerShell Module
