author: Syed Hasan (@syedhasan009)
date: 2021/05/29
description: Detects the mount of an ISO image on an endpoint
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    ObjectName:
    - \Device\CdRom0\autorun.ico
    - \Device\CdRom0\setup.exe
    - \Device\CdRom0\setup64.exe
  selection:
    EventID: 4663
    ObjectName|startswith: \Device\CdRom
    ObjectServer: Security
    ObjectType: File
falsepositives:
- Software installation ISO files
id: 0248a7bc-8a9a-4cd8-a57e-3ae8e073a073
level: medium
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Removable Storage"
    must be configured for Success/Failure
  product: windows
  service: security
modified: 2023/11/09
references:
- https://www.trendmicro.com/vinfo/hk-en/security/news/cybercrime-and-digital-threats/malicious-spam-campaign-uses-iso-image-files-to-deliver-lokibot-and-nanocore
- https://www.proofpoint.com/us/blog/threat-insight/threat-actor-profile-ta2719-uses-colorful-lures-deliver-rats-local-languages
- https://twitter.com/MsftSecIntel/status/1257324139515269121
- https://github.com/redcanaryco/atomic-red-team/blob/0f229c0e42bfe7ca736a14023836d65baa941ed2/atomics/T1553.005/T1553.005.md#atomic-test-1---mount-iso-image
status: test
tags:
- attack.initial_access
- attack.t1566.001
title: ISO Image Mounted
