author: Florian Roth (Nextron Systems)
date: 2017/03/04
description: Detects access to ADMIN$ network share
detection:
  condition: selection and not 1 of filter_*
  filter_main_computer_account:
    SubjectUserName|endswith: $
  selection:
    EventID: 5140
    ShareName: Admin$
falsepositives:
- Legitimate administrative activity
id: 098d7118-55bc-4912-a836-dc6483a8d150
level: low
logsource:
  definition: 'Requirements: The advanced audit policy setting "Object Access > Audit
    File Share" must be configured for Success/Failure'
  product: windows
  service: security
modified: 2024/01/16
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-5140
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Access To ADMIN$ Network Share
