author: Florian Roth (Nextron Systems)
date: 2022/05/09
description: Detects the extraction of password protected ZIP archives. See the filename
  variable for more details on which file has been opened.
detection:
  condition: selection
  selection:
    EventID: 5379
    TargetName|contains|all:
    - Microsoft_Windows_Shell_ZipFolder:filename
    - \Temporary Internet Files\Content.Outlook
falsepositives:
- Legitimate used of encrypted ZIP files
id: 571498c8-908e-40b4-910b-d2369159a3da
level: high
logsource:
  product: windows
  service: security
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
status: test
tags:
- attack.defense_evasion
- attack.initial_access
- attack.t1027
- attack.t1566.001
title: Password Protected ZIP File Opened (Email Attachment)
