author: Florian Roth (Nextron Systems)
date: 2017/03/14
description: Detects the addition of a new member to the local administrator group,
  which could be legitimate activity or a sign of privilege escalation activity
detection:
  condition: all of selection_* and not 1 of filter_*
  filter_main_computer_accounts:
    SubjectUserName|endswith: $
  selection_eid:
    EventID: 4732
  selection_group:
  - TargetUserName|startswith: Administr
  - TargetSid: S-1-5-32-544
falsepositives:
- Legitimate administrative activity
id: c265cf08-3f99-46c1-8d59-328247057d57
level: medium
logsource:
  product: windows
  service: security
modified: 2021/01/17
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4732
- https://learn.microsoft.com/en-us/windows-server/identity/ad-ds/manage/understand-security-identifiers
status: stable
tags:
- attack.privilege_escalation
- attack.t1078
- attack.persistence
- attack.t1098
title: User Added to Local Administrator Group
