author: Chakib Gzenayi (@Chak092), Hosni Mribah
date: 2020/05/06
description: Alerts on Metasploit host's authentications on the domain.
detection:
  condition: 1 of selection*
  selection1:
    AuthenticationPackageName: NTLM
    EventID:
    - 4625
    - 4624
    LogonType: 3
    WorkstationName|re: ^[A-Za-z0-9]{16}$
  selection2:
    EventID: 4776
    Workstation|re: ^[A-Za-z0-9]{16}$
falsepositives:
- Linux hostnames composed of 16 characters.
id: 72124974-a68b-4366-b990-d30e0b2a190d
level: high
logsource:
  product: windows
  service: security
modified: 2024/01/25
references:
- https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/lib/rex/proto/smb/client.rb
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Metasploit SMB Authentication
