author: Zach Mathis
date: 2023/05/19
description: Detects when the password policy is enumerated.
detection:
  condition: selection
  selection:
    AccessList|contains: '%%5392'
    EventID: 4661
    ObjectServer: Security Account Manager
id: 12ba6a38-adb3-4d6b-91ba-a7fb248e3199
level: medium
logsource:
  definition: dfd8c0f4-e6ad-4e07-b91b-f2fca0ddef64
  product: windows
  service: security
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4661
- https://github.com/jpalanco/alienvault-ossim/blob/f74359c0c027e42560924b5cff25cdf121e5505a/os-sim/agent/src/ParserUtil.py#L951
status: test
tags:
- attack.discovery
- attack.t1201
title: Password Policy Enumerated
