author: Alexandr Yampolskyi, SOC Prime
date: 2019/03/26
description: Detects locked workstation session events that occur automatically after
  a standard period of inactivity.
detection:
  condition: selection
  selection:
    EventID: 4800
falsepositives:
- Likely
id: 411742ad-89b0-49cb-a7b0-3971b5c1e0a4
level: informational
logsource:
  product: windows
  service: security
modified: 2023/12/11
references:
- https://www.cisecurity.org/controls/cis-controls-list/
- https://www.pcisecuritystandards.org/documents/PCI_DSS_v3-2-1.pdf
- https://nvlpubs.nist.gov/nistpubs/CSWP/NIST.CSWP.04162018.pdf
- https://www.ultimatewindowssecurity.com/securitylog/encyclopedia/event.aspx?eventID=4800
status: stable
tags:
- attack.impact
title: Locked Workstation
