author: Cian Heasley
date: 2020/06/10
description: Detects Windows Pcap driver installation based on a list of associated
  .sys files.
detection:
  condition: selection
  selection:
    EventID: 4697
    ServiceFileName|contains:
    - pcap
    - npcap
    - npf
    - nm3
    - ndiscap
    - nmnt
    - windivert
    - USBPcap
    - pktmon
falsepositives:
- Unknown
fields:
- EventID
- ServiceFileName
- Account_Name
- Computer_Name
- Originating_Computer
- ServiceName
id: 7b687634-ab20-11ea-bb37-0242ac130002
level: medium
logsource:
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
  product: windows
  service: security
modified: 2023/04/14
references:
- https://ragged-lab.blogspot.com/2020/06/capturing-pcap-driver-installations.html#more
status: test
tags:
- attack.discovery
- attack.credential_access
- attack.t1040
title: Windows Pcap Drivers
