author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/05
description: Detects update to a scheduled task event that contain suspicious keywords.
detection:
  condition: all of selection_*
  selection_commands:
    TaskContentNew|contains:
    - regsvr32
    - rundll32
    - cmd.exe</Command>
    - cmd</Command>
    - '<Arguments>/c '
    - '<Arguments>/k '
    - '<Arguments>/r '
    - powershell
    - pwsh
    - mshta
    - wscript
    - cscript
    - certutil
    - bitsadmin
    - bash.exe
    - 'bash '
    - scrcons
    - 'wmic '
    - wmic.exe
    - forfiles
    - scriptrunner
    - hh.exe
  selection_eid:
    EventID: 4702
  selection_paths:
    TaskContentNew|contains:
    - \AppData\Local\Temp\
    - \AppData\Roaming\
    - \Users\Public\
    - \WINDOWS\Temp\
    - C:\Temp\
    - \Desktop\
    - \Downloads\
    - \Temporary Internet
    - C:\ProgramData\
    - C:\Perflogs\
falsepositives:
- Unknown
id: 614cf376-6651-47c4-9dcc-6b9527f749f4
level: high
logsource:
  definition: The Advanced Audit Policy setting Object Access > Audit Other Object
    Access Events has to be configured to allow this detection. We also recommend
    extracting the Command field from the embedded XML in the event data.
  product: windows
  service: security
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4698
related:
- id: 1c0e41cd-21bb-4433-9acc-4a2cd6367b9b
  type: similar
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.persistence
- attack.t1053.005
title: Suspicious Scheduled Task Update
