author: Samir Bousseaden
date: 2019/04/03
description: Detects known sensitive file extensions accessed on a network share
detection:
  condition: selection
  selection:
    EventID: 5145
    RelativeTargetName|endswith:
    - .bak
    - .dmp
    - .edb
    - .kirbi
    - .msg
    - .nsf
    - .nst
    - .oab
    - .ost
    - .pst
    - .rdp
    - \groups.xml
falsepositives:
- Help Desk operator doing backup or re-imaging end user machine or backup software
- Users working with these data types or exchanging message files
id: 91c945bc-2ad1-4799-a591-4d00198a1215
level: medium
logsource:
  product: windows
  service: security
modified: 2022/10/09
references:
- Internal Research
related:
- id: 286b47ed-f6fe-40b3-b3a8-35129acd43bc
  type: similar
status: test
tags:
- attack.collection
- attack.t1039
title: Suspicious Access to Sensitive File Extensions
