author: Thomas Patzke
date: 2019/12/03
description: Addition of domains is seldom and should be verified for legitimacy.
detection:
  condition: selection
  selection:
    EventID: 4706
falsepositives:
- Legitimate extension of domain structure
id: 0255a820-e564-4e40-af2b-6ac61160335c
level: medium
logsource:
  product: windows
  service: security
modified: 2024/01/16
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-4706
status: stable
tags:
- attack.persistence
- attack.t1098
title: A New Trust Was Created To A Domain
