author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
detection:
  condition: selection_eid and 1 of selection_cli_*
  selection_cli_cmd:
    ServiceFileName|contains:
    - cmd
    - '%COMSPEC%'
    ServiceFileName|contains|all:
    - /c
    - echo
    - \pipe\
  selection_cli_rundll:
    ServiceFileName|contains|all:
    - rundll32
    - .dll,a
    - '/p:'
  selection_cli_share:
    ServiceFileName|startswith: \\\\127.0.0.1\\ADMIN$\
  selection_eid:
    EventID: 4697
falsepositives:
- Unlikely
id: ecbc5e16-58e0-4521-9c60-eb9a7ea4ad34
level: high
logsource:
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
  product: windows
  service: security
modified: 2023/11/15
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
related:
- id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
  type: derived
status: test
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
title: Meterpreter or Cobalt Strike Getsystem Service Installation - Security
