author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/07/14
description: Potential threat actor tampering with Sysmon manifest and eventually
  disabling it
detection:
  condition: 1 of selection*
  selection1:
    EventID: 4657
    NewValue: 0
    ObjectName|contains:
    - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
    - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
    ObjectValueName: Enabled
  selection2:
    AccessMask: 65536
    EventID: 4663
    ObjectName|contains:
    - WINEVT\Publishers\{5770385f-c22a-43e0-bf4c-06f5698ffbd9}
    - WINEVT\Channels\Microsoft-Windows-Sysmon/Operational
falsepositives:
- Unknown
id: 18beca67-ab3e-4ee3-ba7a-a46ca8d7d0cc
level: high
logsource:
  product: windows
  service: security
modified: 2022/10/05
references:
- https://twitter.com/Flangvik/status/1283054508084473861
- https://twitter.com/SecurityJosh/status/1283027365770276866
- https://securityjosh.github.io/2020/04/23/Mute-Sysmon.html
- https://gist.github.com/Cyb3rWard0g/cf08c38c61f7e46e8404b38201ca01c8
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Sysmon Channel Reference Deletion
