author: Samir Bousseaden
date: 2019/04/03
description: Detect priv users or groups recon based on 4661 eventid and known privileged
  users or groups SIDs
detection:
  condition: selection and selection_object and not filter
  filter:
    SubjectUserName|endswith: $
  selection:
    EventID: 4661
    ObjectType:
    - SAM_USER
    - SAM_GROUP
  selection_object:
  - ObjectName|endswith:
    - '-512'
    - '-502'
    - '-500'
    - '-505'
    - '-519'
    - '-520'
    - '-544'
    - '-551'
    - '-555'
  - ObjectName|contains: admin
falsepositives:
- If source account name is not an admin then its super suspicious
id: 35ba1d85-724d-42a3-889f-2e2362bcaf23
level: high
logsource:
  definition: 'Requirements: enable Object Access SAM on your Domain Controllers'
  product: windows
  service: security
modified: 2022/07/13
references:
- https://blog.menasec.net/2019/02/threat-hunting-5-detecting-enumeration.html
status: test
tags:
- attack.discovery
- attack.t1087.002
title: AD Privileged Users or Groups Reconnaissance
