author: Roberto Rodriguez @Cyb3rWard0g, Tim Shelton
date: 2019/08/15
description: Detects non-system users performing privileged operation os the SCM database
detection:
  condition: selection and not filter
  filter:
    ProcessName|endswith: :\Windows\System32\services.exe
    SubjectLogonId: '0x3e4'
  selection:
    EventID: 4674
    ObjectName: servicesactive
    ObjectType: SC_MANAGER OBJECT
    PrivilegeList: SeTakeOwnershipPrivilege
falsepositives:
- Unknown
id: dae8171c-5ec6-4396-b210-8466585b53e9
level: medium
logsource:
  product: windows
  service: security
modified: 2022/09/18
references:
- https://threathunterplaybook.com/hunts/windows/190826-RemoteSCMHandle/notebook.html
status: test
tags:
- attack.privilege_escalation
- attack.t1548
title: SCM Database Privileged Operation
