author: Roberto Rodriguez (source), Ilyas Ochkov (rule), oscd.community
date: 2019/10/24
description: Detects potential use of Rubeus via registered new trusted logon process
detection:
  condition: selection
  selection:
    EventID: 4611
    LogonProcessName: User32LogonProcesss
falsepositives:
- Unknown
id: 12e6d621-194f-4f59-90cc-1959e21e69f7
level: high
logsource:
  product: windows
  service: security
modified: 2022/10/09
references:
- https://posts.specterops.io/hunting-in-active-directory-unconstrained-delegation-forests-trusts-71f2b33688e1
status: test
tags:
- attack.lateral_movement
- attack.privilege_escalation
- attack.t1558.003
title: Register new Logon Process by Rubeus
