author: Florian Roth (Nextron Systems), Teymur Kheirkhabarov, Daniil Yugoslavskiy,
  oscd.community
date: 2017/03/05
description: Detects well-known credential dumping tools execution via service execution
  events
detection:
  condition: selection
  selection:
    EventID: 4697
    ServiceFileName|contains:
    - cachedump
    - dumpsvc
    - fgexec
    - gsecdump
    - mimidrv
    - pwdump
    - servpw
falsepositives:
- Legitimate Administrator using credential dumping tool for password recovery
id: f0d1feba-4344-4ca9-8121-a6c97bd6df52
level: high
logsource:
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
  product: windows
  service: security
modified: 2022/11/29
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
related:
- id: 4976aa50-8f41-45c6-8b15-ab3fc10e79ed
  type: derived
status: test
tags:
- attack.credential_access
- attack.execution
- attack.t1003.001
- attack.t1003.002
- attack.t1003.004
- attack.t1003.005
- attack.t1003.006
- attack.t1569.002
- attack.s0005
title: Credential Dumping Tools Service Execution - Security
