author: Ilyas Ochkov, oscd.community
date: 2019/10/25
description: 'Detects the creation of a user with the "$" character. This can be used
  by attackers to hide a user or trick detection systems that lack the parsing mechanisms.

  '
detection:
  condition: 1 of selection_* and not 1 of filter_main_*
  filter_main_homegroup:
    EventID: 4720
    TargetUserName: HomeGroupUser$
  selection_create:
    EventID: 4720
    SamAccountName|contains: $
  selection_rename:
    EventID: 4781
    NewTargetUserName|contains: $
falsepositives:
- Unknown
id: cfeed607-6aa4-4bbd-9627-b637deb723c8
level: medium
logsource:
  product: windows
  service: security
modified: 2024/01/16
references:
- https://twitter.com/SBousseaden/status/1387743867663958021
status: test
tags:
- attack.defense_evasion
- attack.t1036
title: New or Renamed User Account with '$' Character
