author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: Detects basic PowerShell Remoting (WinRM) by monitoring for network inbound
  connections to ports 5985 OR 5986
detection:
  condition: selection
  selection:
    DestPort:
    - 5985
    - 5986
    EventID: 5156
    LayerRTID: 44
falsepositives:
- Legitimate use of remote PowerShell execution
id: 13acf386-b8c6-4fe0-9a6e-c4756b974698
level: high
logsource:
  product: windows
  service: security
modified: 2022/10/09
references:
- https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
status: test
tags:
- attack.execution
- attack.t1059.001
title: Remote PowerShell Sessions Network Connections (WinRM)
