author: Ilyas Ochkov, oscd.community
date: 2019/10/24
description: 'Detects uncommon outbound network activity via Kerberos default port
  indicating possible lateral movement or first stage PrivEsc via delegation.

  '
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_lsass:
    Application|endswith: \Windows\System32\lsass.exe
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
  filter_optional_chrome:
    Application|endswith:
    - \Program Files (x86)\Google\Chrome\Application\chrome.exe
    - \Program Files\Google\Chrome\Application\chrome.exe
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
  filter_optional_firefox:
    Application|endswith:
    - \Program Files (x86)\Mozilla Firefox\firefox.exe
    - \Program Files\Mozilla Firefox\firefox.exe
    Application|startswith:
    - \device\harddiskvolume
    - 'C:'
  filter_optional_tomcat:
    Application|endswith: \tomcat\bin\tomcat8.exe
  selection:
    DestPort: 88
    EventID: 5156
falsepositives:
- Web Browsers and third party application might generate similar activity. An initial
  baseline is required.
id: eca91c7c-9214-47b9-b4c5-cb1d7e4f2350
level: medium
logsource:
  product: windows
  service: security
modified: 2024/03/15
references:
- https://github.com/GhostPack/Rubeus
related:
- id: e54979bd-c5f9-4d6c-967b-a04b19ac4c74
  type: similar
status: test
tags:
- attack.lateral_movement
- attack.t1558.003
title: Uncommon Outbound Kerberos Connection - Security
