author: Thodoris Polyzos (@SmoothDeploy)
date: 2024/01/29
description: 'Detects execution of EDRSilencer, a tool that abuses the Windows Filtering
  Platform (WFP) to block the outbound traffic of running EDR agents based on specific
  hardcoded filter names.

  '
detection:
  condition: selection
  selection:
    EventID:
    - 5441
    - 5447
    FilterName|contains: Custom Outbound Filter
falsepositives:
- Unknown
id: 98054878-5eab-434c-85d4-72d4e5a3361b
level: high
logsource:
  definition: 'Requirements: Audit Filtering Platform Policy Change needs to be enabled'
  product: windows
  service: security
modified: 2024/01/30
references:
- https://github.com/netero1010/EDRSilencer
status: experimental
tags:
- attack.defense_evasion
- attack.t1562
title: HackTool - EDRSilencer Execution - Filter Added
