author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects powershell script installed as a Service
detection:
  condition: selection
  selection:
    EventID: 4697
    ServiceFileName|contains:
    - powershell
    - pwsh
falsepositives:
- Unknown
id: 2a926e6a-4b81-4011-8a96-e36cc8c04302
level: high
logsource:
  definition: The 'System Security Extension' audit subcategory need to be enabled
    to log the EID 4697
  product: windows
  service: security
modified: 2022/11/29
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
- id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
  type: derived
status: test
tags:
- attack.execution
- attack.t1569.002
title: PowerShell Scripts Installed as Services - Security
