author: Samir Bousseaden, wagga
date: 2019/04/03
description: Detect AD credential dumping using impacket secretdump HKTL
detection:
  condition: selection
  selection:
    EventID: 5145
    RelativeTargetName|contains|all:
    - SYSTEM32\
    - .tmp
    ShareName: \\\\\*\\ADMIN$
falsepositives:
- Unknown
id: 252902e3-5830-4cf6-bf21-c22083dfd5cf
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2022/08/11
references:
- https://blog.menasec.net/2019/02/threat-huting-10-impacketsecretdump.html
status: test
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.004
- attack.t1003.003
title: Possible Impacket SecretDump Remote Activity
