author: Bhabesh Raj
date: 2020/12/14
description: Detects execution of Impacket's psexec.py.
detection:
  condition: selection1
  selection1:
    EventID: 5145
    RelativeTargetName|contains:
    - RemCom_stdin
    - RemCom_stdout
    - RemCom_stderr
    ShareName: \\\\\*\\IPC$
falsepositives:
- Unknown
id: 32d56ea1-417f-44ff-822b-882873f5f43b
level: high
logsource:
  definition: The advanced audit policy setting "Object Access > Audit Detailed File
    Share" must be configured for Success/Failure
  product: windows
  service: security
modified: 2022/09/22
references:
- https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Impacket PsExec Execution
