author: Florian Roth (Nextron Systems)
date: 2022/05/09
description: Detects the extraction of password protected ZIP archives with suspicious
  file names. See the filename variable for more details on which file has been opened.
detection:
  condition: selection and selection_filename
  selection:
    EventID: 5379
    TargetName|contains: Microsoft_Windows_Shell_ZipFolder:filename
  selection_filename:
    TargetName|contains:
    - invoice
    - new order
    - rechnung
    - factura
    - delivery
    - purchase
    - order
    - payment
falsepositives:
- Legitimate used of encrypted ZIP files
id: 54f0434b-726f-48a1-b2aa-067df14516e4
level: high
logsource:
  product: windows
  service: security
references:
- https://twitter.com/sbousseaden/status/1523383197513379841
status: test
tags:
- attack.command_and_control
- attack.defense_evasion
- attack.t1027
- attack.t1105
- attack.t1036
title: Password Protected ZIP File Opened (Suspicious Filenames)
