author: Keith Wright
date: 2019/11/20
description: Detects external disk drives or plugged-in USB devices.
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 6416
  selection_field:
  - ClassName: DiskDrive
  - DeviceDescription: USB Mass Storage Device
falsepositives:
- Likely
id: f69a87ea-955e-4fb4-adb2-bb9fd6685632
level: low
logsource:
  product: windows
  service: security
modified: 2024/02/09
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/auditing/event-6416
status: test
tags:
- attack.t1091
- attack.t1200
- attack.lateral_movement
- attack.initial_access
title: External Disk Drive Or USB Storage Device Was Recognized By The System
