author: '@neu5ron'
date: 2017/04/13
description: Detects scenarios where one can control another users or computers account
  without having to use their credentials.
detection:
  condition: (selection1 and not 1 of filter_*) or 1 of selection_5136_*
  filter_empty:
    AllowedToDelegateTo:
    - ''
    - '-'
  filter_null:
    AllowedToDelegateTo: null
  selection1:
    EventID: 4738
  selection_5136_1:
    AttributeLDAPDisplayName: msDS-AllowedToDelegateTo
    EventID: 5136
  selection_5136_2:
    AttributeLDAPDisplayName: servicePrincipalName
    EventID: 5136
    ObjectClass: user
  selection_5136_3:
    AttributeLDAPDisplayName: msDS-AllowedToActOnBehalfOfOtherIdentity
    EventID: 5136
falsepositives:
- Unknown
id: 300bac00-e041-4ee2-9c36-e262656a6ecc
level: high
logsource:
  definition: 'Requirements: Audit Policy : Account Management > Audit User Account
    Management, Group Policy : Computer Configuration\Windows Settings\Security Settings\Advanced
    Audit Policy Configuration\Audit Policies\Account Management\Audit User Account
    Management, DS Access > Audit Directory Service Changes, Group Policy : Computer
    Configuration\Windows Settings\Security Settings\Advanced Audit Policy Configuration\Audit
    Policies\DS Access\Audit Directory Service Changes'
  product: windows
  service: security
modified: 2024/02/26
references:
- https://msdn.microsoft.com/en-us/library/cc220234.aspx
- https://adsecurity.org/?p=3466
- https://blog.harmj0y.net/redteaming/another-word-on-delegation/
status: test
tags:
- attack.t1098
- attack.persistence
title: Active Directory User Backdoors
