author: Red Canary (idea), Nasreddine Bencherchali
date: 2023/01/25
description: Detects the presence of "bpf_probe_write_user" BPF helper-generated warning
  messages. Which could be a sign of suspicious eBPF activity on the system.
detection:
  condition: selection
  selection:
  - bpf_probe_write_user
falsepositives:
- Unknown
id: 0fadd880-6af3-4610-b1e5-008dc3a11b8a
level: high
logsource:
  product: linux
references:
- https://redcanary.com/blog/ebpf-malware/
- https://man7.org/linux/man-pages/man7/bpf-helpers.7.html
status: test
tags:
- attack.persistence
- attack.defense_evasion
title: Potential Suspicious BPF Activity - Linux
