author: Pawel Mazur
date: 2022/12/21
description: Detects the addition of a new user to a privileged group such as "root"
  or "sudo"
detection:
  condition: all of selection_*
  selection_new_user:
  - new user
  selection_uids_gids:
  - GID=0
  - UID=0
  - GID=10
  - GID=27
falsepositives:
- Administrative activity
id: 0ac15ec3-d24f-4246-aa2a-3077bb1cf90e
level: high
logsource:
  definition: /var/log/secure on REHL systems or /var/log/auth.log on debian like
    Systems needs to be collected in order for this detection to work
  product: linux
references:
- https://digital.nhs.uk/cyber-alerts/2018/cc-2825
- https://linux.die.net/man/8/useradd
- https://github.com/redcanaryco/atomic-red-team/blob/25acadc0b43a07125a8a5b599b28bbc1a91ffb06/atomics/T1136.001/T1136.001.md#atomic-test-5---create-a-new-user-in-linux-with-root-uid-and-gid
status: test
tags:
- attack.persistence
- attack.t1136.001
- attack.t1098
title: Privileged User Has Been Created
