author: Florian Roth (Nextron Systems)
date: 2022/03/16
description: Detects uncommon target processes for remote thread creation
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_csrss:
    SourceImage|endswith: :\Windows\System32\csrss.exe
  filter_optional_aurora_1:
    StartFunction: EtwpNotificationThread
  filter_optional_aurora_2:
    SourceImage|contains: unknown process
  filter_optional_vmtoolsd:
    SourceImage|endswith: :\Program Files\VMware\VMware Tools\vmtoolsd.exe
    StartFunction: GetCommandLineW
    TargetImage|endswith:
    - :\Windows\System32\notepad.exe
    - :\Windows\System32\spoolsv.exe
  filter_optional_xerox_pjems:
    SourceImage: C:\Program Files\Xerox\XeroxPrintExperience\CommonFiles\XeroxPrintJobEventManagerService.exe
    StartFunction: LoadLibraryW
    TargetImage: C:\Windows\System32\spoolsv.exe
  selection:
    TargetImage|endswith:
    - \calc.exe
    - \calculator.exe
    - \mspaint.exe
    - \notepad.exe
    - \ping.exe
    - \sethc.exe
    - \spoolsv.exe
    - \wordpad.exe
    - \write.exe
falsepositives:
- Unknown
id: a1a144b7-5c9b-4853-a559-2172be8d4a03
level: medium
logsource:
  category: create_remote_thread
  product: windows
modified: 2024/03/06
references:
- https://blog.redbluepurple.io/offensive-research/bypassing-injection-detection
related:
- id: f016c716-754a-467f-a39e-63c06f773987
  type: obsoletes
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.003
title: Remote Thread Creation In Uncommon Target Image
