author: Perez Diego (@darkquassar), oscd.community
date: 2019/10/27
description: Detects uncommon processes creating remote threads.
detection:
  condition: selection
  selection:
    SourceImage|endswith:
    - \bash.exe
    - \cscript.exe
    - \cvtres.exe
    - \defrag.exe
    - \dnx.exe
    - \esentutl.exe
    - \excel.exe
    - \expand.exe
    - \find.exe
    - \findstr.exe
    - \forfiles.exe
    - \gpupdate.exe
    - \hh.exe
    - \installutil.exe
    - \lync.exe
    - \makecab.exe
    - \mDNSResponder.exe
    - \monitoringhost.exe
    - \msbuild.exe
    - \mshta.exe
    - \mspaint.exe
    - \outlook.exe
    - \ping.exe
    - \provtool.exe
    - \python.exe
    - \regsvr32.exe
    - \robocopy.exe
    - \runonce.exe
    - \sapcimc.exe
    - \smartscreen.exe
    - \spoolsv.exe
    - \tstheme.exe
    - \userinit.exe
    - \vssadmin.exe
    - \vssvc.exe
    - \w3wp.exe
    - \winscp.exe
    - \winword.exe
    - \wmic.exe
    - \wscript.exe
falsepositives:
- This rule is best put in testing first in order to create a baseline that reflects
  the data in your environment.
id: 02d1d718-dd13-41af-989d-ea85c7fab93f
level: high
logsource:
  category: create_remote_thread
  product: windows
modified: 2024/01/17
references:
- Personal research, statistical analysis
- https://lolbas-project.github.io
related:
- id: 66d31e5f-52d6-40a4-9615-002d3789a119
  type: derived
status: experimental
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1055
title: Rare Remote Thread Creation By Uncommon Source Image
