author: Bryan Lim
date: 2024/01/12
description: 'Detects the deployment of workloads that are deployed by using the break-glass
  flag to override Binary Authorization controls.

  '
detection:
  condition: selection and keywords
  keywords:
  - image-policy.k8s.io/break-glass
  selection:
    data.protoPayload.logName:
    - cloudaudit.googleapis.com/activity
    - cloudaudit.googleapis.com%2Factivity
    data.protoPayload.methodName: io.k8s.core.v1.pods.create
    data.protoPayload.resource.type: k8s_cluster
falsepositives:
- Unknown
id: 76737c19-66ee-4c07-b65a-a03301d1573d
level: medium
logsource:
  product: gcp
  service: gcp.audit
references:
- https://cloud.google.com/binary-authorization
status: experimental
tags:
- attack.defense_evasion
- attack.t1548
title: GCP Break-glass Container Workload Deployed
