author: '@juju4'
date: 2022/12/27
description: Detects suspicious SQL query keywrods that are often used during recon,
  exfiltration or destructive activities. Such as dropping tables and selecting wildcard
  fields
detection:
  condition: keywords
  keywords:
  - drop
  - truncate
  - dump
  - select \*
falsepositives:
- Inventory and monitoring activity
- Vulnerability scanners
- Legitimate applications
id: d84c0ded-edd7-4123-80ed-348bb3ccc4d5
level: medium
logsource:
  category: database
  definition: 'Requirements: Must be able to log the SQL queries'
references:
- https://github.com/sqlmapproject/sqlmap
status: test
tags:
- attack.exfiltration
- attack.initial_access
- attack.privilege_escalation
- attack.t1190
- attack.t1505.001
title: Suspicious SQL Query
