author: sawwinnnaung
date: 2020/05/07
description: Number of VM creations or deployment activities occur in Azure via the
  azureactivity log.
detection:
  condition: keywords
  keywords:
  - Microsoft.Compute/virtualMachines/write
  - Microsoft.Resources/deployments/write
falsepositives:
- Valid change
id: d2d901db-7a75-45a1-bc39-0cbf00812192
level: medium
logsource:
  product: azure
  service: activitylogs
modified: 2023/10/11
references:
- https://github.com/Azure/Azure-Sentinel/blob/e534407884b1ec5371efc9f76ead282176c9e8bb/Detections/AzureActivity/Creating_Anomalous_Number_Of_Resources_detection.yaml
status: test
tags:
- attack.persistence
- attack.t1098
title: Number Of Resource Creation Or Deployment Activities
