author: Tim Brown
date: 2023/01/09
description: Detects BGP failures which may be indicative of brute force attacks to
  manipulate routing.
detection:
  condition: keywords_bgp_huawei
  keywords_bgp_huawei:
    '|all':
    - :179
    - BGP_AUTH_FAILED
falsepositives:
- Unlikely. Except due to misconfigurations
fields:
- host
- PeeId
id: a557ffe6-ac54-43d2-ae69-158027082350
level: low
logsource:
  definition: 'Requirements: huawei bgp logs need to be enabled and ingested'
  product: huawei
  service: bgp
modified: 2023/01/23
references:
- https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
status: test
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.credential_access
- attack.collection
- attack.t1078
- attack.t1110
- attack.t1557
title: Huawei BGP Authentication Failures
