author: Tim Shelton, Nasreddine Bencherchali (Nextron Systems)
date: 2022/04/26
description: Detects the reporting of NTLMv1 being used between a client and server.
  NTLMv1 is insecure as the underlying encryption algorithms can be brute-forced by
  modern hardware.
detection:
  condition: selection
  selection:
    EventID:
    - 6038
    - 6039
    Provider_Name: LsaSrv
falsepositives:
- Environments that use NTLMv1
id: e9d4ab66-a532-4ef7-a502-66a9e4a34f5d
level: medium
logsource:
  product: windows
  service: system
modified: 2023/06/06
references:
- https://github.com/nasbench/EVTX-ETW-Resources/blob/f1b010ce0ee1b71e3024180de1a3e67f99701fe4/ETWProvidersManifests/Windows10/22H2/W10_22H2_Pro_20230321_19045.2728/WEPExplorer/LsaSrv.xml
status: test
tags:
- attack.defense_evasion
- attack.lateral_movement
- attack.t1550.002
title: NTLMv1 Logon Between Client and Server
