author: Moti Harmats
date: 2023/02/11
description: 'Detects potential local file read vulnerability in JVM based apps.

  If the exceptions are caused due to user input and contain path traversal payloads
  then it''s a red flag.

  '
detection:
  condition: keywords_local_file_read
  keywords_local_file_read:
    '|all':
    - FileNotFoundException
    - /../../..
falsepositives:
- Application bugs
id: e032f5bc-4563-4096-ae3b-064bab588685
level: high
logsource:
  category: application
  definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR
    and above)'
  product: jvm
references:
- https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs
status: test
tags:
- attack.initial_access
- attack.t1190
title: Potential Local File Read Vulnerability In JVM Based Application
