author: Splunk Threat Research Team (original rule), Harjot Singh @cyb3rjy0t (sigma
  rule)
date: 2023/09/18
description: Detects the addition of a new Federated Domain.
detection:
  condition: all of selection_*
  selection_domain:
    Operation|contains: domain
  selection_operation:
    Operation|contains:
    - add
    - new
falsepositives:
- The creation of a new Federated domain is not necessarily malicious, however these
  events need to be followed closely, as it may indicate federated credential abuse
  or backdoor via federated identities at a similar or different cloud provider.
id: 58f88172-a73d-442b-94c9-95eaed3cbb36
level: medium
logsource:
  product: m365
  service: audit
references:
- https://research.splunk.com/cloud/e155876a-6048-11eb-ae93-0242ac130002/
- https://o365blog.com/post/aadbackdoor/
related:
- id: 42127bdd-9133-474f-a6f1-97b6c08a4339
  type: similar
status: experimental
tags:
- attack.persistence
- attack.t1136.003
title: New Federated Domain Added
