author: Splunk Threat Research Team (original rule), Harjot Singh @cyb3rjy0t (sigma
  rule)
date: 2023/09/18
description: Detects disabling of Multi Factor Authentication.
detection:
  condition: selection
  selection:
    Operation|contains: Disable Strong Authentication.
falsepositives:
- Unlikely
id: 60de9b57-dc4d-48b9-a6a0-b39e0469f876
level: high
logsource:
  product: m365
  service: audit
references:
- https://research.splunk.com/cloud/c783dd98-c703-4252-9e8a-f19d9f5c949e/
status: experimental
tags:
- attack.persistence
- attack.t1556
title: Disabling Multi Factor Authentication
