author: "\xD6mer G\xFCnal, oscd.community, Pawel Mazur"
date: 2020/10/08
description: Detects password policy discovery commands
detection:
  condition: 1 of selection_*
  selection_chage:
    a0: chage
    a1:
    - --list
    - -l
    type: EXECVE
  selection_files:
    name:
    - /etc/pam.d/common-password
    - /etc/security/pwquality.conf
    - /etc/pam.d/system-auth
    - /etc/login.defs
    type: PATH
  selection_passwd:
    a0: passwd
    a1:
    - -S
    - --status
    type: EXECVE
falsepositives:
- Legitimate administration activities
id: ca94a6db-8106-4737-9ed2-3e3bb826af0a
level: low
logsource:
  product: linux
  service: auditd
modified: 2022/12/18
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1201/T1201.md
- https://linux.die.net/man/1/chage
- https://man7.org/linux/man-pages/man1/passwd.1.html
- https://superuser.com/questions/150675/how-to-display-password-policy-information-for-a-user-ubuntu
status: stable
tags:
- attack.discovery
- attack.t1201
title: Password Policy Discovery
