author: Pawel Mazur
date: 2021/09/11
description: Detects extraction of files with usage of steghide binary, the adversaries
  may use this technique to prevent the detection of hidden information.
detection:
  condition: selection
  selection:
    a0: steghide
    a1: extract
    a2: -sf
    a3|endswith:
    - .jpg
    - .png
    type: EXECVE
falsepositives:
- Unknown
id: a5a827d9-1bbe-4952-9293-c59d897eb41b
level: low
logsource:
  product: linux
  service: auditd
modified: 2022/10/09
references:
- https://vitux.com/how-to-hide-confidential-files-in-images-on-debian-using-steganography/
status: test
tags:
- attack.defense_evasion
- attack.t1027.003
title: Steganography Extract Files with Steghide
