author: Pawel Mazur
date: 2021/09/09
description: Detects extracting of zip file from image file
detection:
  a1:
    a1|endswith:
    - .jpg
    - .png
  commands:
    a0: unzip
    type: EXECVE
  condition: commands and a1
falsepositives:
- Unknown
id: edd595d7-7895-4fa7-acb3-85a18a8772ca
level: low
logsource:
  product: linux
  service: auditd
modified: 2022/10/09
references:
- https://zerotoroot.me/steganography-hiding-a-zip-in-a-jpeg-file/
status: test
tags:
- attack.defense_evasion
- attack.t1027.003
title: Steganography Unzip Hidden Information From Picture File
