author: David Burkett, @signalblur
date: 2022/12/30
description: Detects calls to hidden files or files located in hidden directories
  in NIX systems.
detection:
  condition: selection and not filter
  filter:
    name|contains:
    - /.cache/
    - /.config/
    - /.pyenv/
    - /.rustup/toolchains
  selection:
    name|contains: /.
    type: PATH
falsepositives:
- Unknown
id: 9e1bef8d-0fff-46f6-8465-9aa54e128c1e
level: low
logsource:
  product: linux
  service: auditd
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md
related:
- id: d08722cd-3d09-449a-80b4-83ea2d9d4616
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1574.001
title: Use Of Hidden Paths Or Files
