author: Igor Fits, oscd.community
date: 2020/10/15
description: Detecting attempts to extract passwords with grep
detection:
  condition: selection and keywords
  keywords:
    '|all':
    - grep
    - password
  selection:
    type: EXECVE
falsepositives:
- Unknown
id: df3fcaea-2715-4214-99c5-0056ea59eb35
level: high
logsource:
  product: linux
  service: auditd
modified: 2023/04/30
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1552.001/T1552.001.md
status: test
tags:
- attack.credential_access
- attack.t1552.001
title: Credentials In Files - Linux
