author: Marie Euler, Pawel Mazur
date: 2020/05/18
description: Detects the creation of a new user account. Such accounts may be used
  for persistence that do not require persistent remote access tools to be deployed
  on the system.
detection:
  condition: 1 of selection_*
  selection_add_user_record_type:
    type: ADD_USER
  selection_syscall_record_type:
    exe|endswith: /useradd
    type: SYSCALL
falsepositives:
- Admin activity
id: 759d0d51-bc99-4b5e-9add-8f5b2c8e7512
level: medium
logsource:
  product: linux
  service: auditd
modified: 2022/12/20
references:
- https://access.redhat.com/documentation/en-us/red_hat_enterprise_linux/7/html/security_guide/sec-understanding_audit_log_files
- https://access.redhat.com/articles/4409591#audit-record-types-2
- https://www.youtube.com/watch?v=VmvY5SQm5-Y&ab_channel=M45C07
status: test
tags:
- attack.t1136.001
- attack.persistence
title: Creation Of An User Account
