author: Pawel Mazur
date: 2022/01/22
description: Detects disabling of system firewalls which could be used by adversaries
  to bypass controls that limit usage of the network.
detection:
  condition: selection
  selection:
    type: SERVICE_STOP
    unit:
    - firewalld
    - iptables
    - ufw
falsepositives:
- Admin activity
id: 53059bc0-1472-438b-956a-7508a94a91f0
level: high
logsource:
  product: linux
  service: auditd
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.004/T1562.004.md
- https://firewalld.org/documentation/man-pages/firewall-cmd.html
status: test
tags:
- attack.t1562.004
- attack.defense_evasion
title: Disable System Firewall
