author: Igor Fits, oscd.community
date: 2020/10/13
description: 'Adversaries may use binary padding to add junk data and change the on-disk
  representation of malware.

  This rule detect using dd and truncate to add a junk data to file.

  '
detection:
  condition: selection_execve and (keywords_truncate or (keywords_dd and not keywords_filter))
  keywords_dd:
    '|all':
    - dd
    - if=
  keywords_filter:
  - of=
  keywords_truncate:
    '|all':
    - truncate
    - -s
  selection_execve:
    type: EXECVE
falsepositives:
- Unknown
id: c52a914f-3d8b-4b2a-bb75-b3991e75f8ba
level: high
logsource:
  product: linux
  service: auditd
modified: 2023/05/03
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1027.001/T1027.001.md
status: test
tags:
- attack.defense_evasion
- attack.t1027.001
title: Binary Padding - Linux
