author: Florian Roth (Nextron Systems), @0xrawsec
date: 2018/06/03
description: Detects the creation of an ADS (Alternate Data Stream) that contains
  an executable by looking at a non-empty Imphash
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_null:
    Hash|contains: IMPHASH=00000000000000000000000000000000
  selection:
    Hash|contains: IMPHASH=
falsepositives:
- This rule isn't looking for any particular binary characteristics. As legitimate
  installers and programs were seen embedding hidden binaries in their ADS. Some false
  positives are expected from browser processes and similar.
id: b69888d4-380c-45ce-9cf9-d9ce46e67821
level: medium
logsource:
  category: create_stream_hash
  definition: 'Requirements: Sysmon or equivalent configured with Imphash logging'
  product: windows
modified: 2023/02/10
references:
- https://twitter.com/0xrawsec/status/1002478725605273600?s=21
status: test
tags:
- attack.defense_evasion
- attack.s0139
- attack.t1564.004
title: Hidden Executable In NTFS Alternate Data Stream
