author: Nasreddine Bencherchali (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022/09/07
description: Detects the download of suspicious file type from URLs with IP
detection:
  condition: selection
  selection:
    Contents|re: http[s]?://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
    TargetFilename|contains:
    - .ps1:Zone
    - .bat:Zone
    - .exe:Zone
    - .vbe:Zone
    - .vbs:Zone
    - .dll:Zone
    - .one:Zone
    - .cmd:Zone
    - .hta:Zone
    - .xll:Zone
    - .lnk:Zone
falsepositives:
- Unknown
id: 025bd229-fd1f-4fdb-97ab-20006e1a5368
level: high
logsource:
  category: create_stream_hash
  product: windows
modified: 2023/02/10
references:
- https://github.com/trustedsec/SysmonCommunityGuide/blob/adcdfee20999f422b974c8d4149bf4c361237db7/chapters/file-stream-creation-hash.md
- https://labs.withsecure.com/publications/detecting-onenote-abuse
status: test
tags:
- attack.defense_evasion
- attack.t1564.004
title: Unusual File Download from Direct IP Address
