author: Cybex
date: 2022/08/16
description: During exploitation of this vulnerability, two logs (Provider_Name:Microsoft-Windows-User
  Profiles Service) with EventID 1511 and 1515 (maybe lot of false positives with
  this event) are created. Moreover, it appears the directory \Users\TEMP is created
  may be created during the exploitation. Viewed on 2008 Server
detection:
  condition: selection
  selection:
    EventID: 1511
    Provider_Name: Microsoft-Windows-User Profiles Service
falsepositives:
- Corrupted user profiles - https://social.technet.microsoft.com/wiki/contents/articles/3571.windows-user-profiles-service-event-1511-windows-cannot-find-the-local-profile-and-is-logging-you-on-with-a-temporary-profile.aspx
id: 52a85084-6989-40c3-8f32-091e12e17692
level: low
logsource:
  product: windows
  service: application
modified: 2023/05/02
references:
- https://packetstormsecurity.com/files/166692/Windows-User-Profile-Service-Privlege-Escalation.html
status: test
tags:
- attack.execution
title: Suspicious Usage of CVE_2021_34484 or CVE 2022_21919
