author: Cedric MAURUGEON
date: 2021/09/29
description: Detects the deletion of a prefetch file which may indicate an attempt
  to destroy forensic evidence
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_svchost:
    Image|endswith: :\windows\system32\svchost.exe
    User|contains:
    - AUTHORI
    - AUTORI
  selection:
    TargetFilename|contains: :\Windows\Prefetch\
    TargetFilename|endswith: .pf
falsepositives:
- Unknown
id: 0a1f9d29-6465-4776-b091-7f43b26e4c89
level: high
logsource:
  category: file_delete
  product: windows
modified: 2024/01/25
references:
- Internal Research
- https://www.group-ib.com/blog/hunting-for-ttps-with-prefetch-files/
status: test
tags:
- attack.defense_evasion
- attack.t1070.004
title: Prefetch File Deleted
