author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/06/06
description: Detects loaded kernel modules that did not meet the WHQL signing requirements.
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_vmware:
    FileNameBuffer:
    - system32\drivers\vsock.sys
    - System32\drivers\vmci.sys
  selection:
    EventID:
    - 3082
    - 3083
falsepositives:
- Unlikely
id: 2f8cd7a0-9d5a-4f62-9f8b-2c951aa0dd1f
level: high
logsource:
  product: windows
  service: codeintegrity-operational
modified: 2023/06/14
references:
- https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-id-explanations
- https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-tag-explanations
- Internal Research
status: test
tags:
- attack.privilege_escalation
title: CodeIntegrity - Unmet WHQL Requirements For Loaded Kernel Module
