author: Sean Metcalf (source), Florian Roth (Nextron Systems)
date: 2017/03/05
description: Detects PowerShell called from an executable by the version mismatch
  method
detection:
  condition: all of selection_*
  selection_engine:
    Data|contains:
    - EngineVersion=2.
    - EngineVersion=4.
    - EngineVersion=5.
  selection_host:
    Data|contains: HostVersion=3.
falsepositives:
- Unknown
id: c70e019b-1479-4b65-b0cc-cd0c6093a599
level: high
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://adsecurity.org/?p=2921
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001
title: PowerShell Called from an Executable Version Mismatch
