author: frack113
date: 2021/06/03
description: Shadow Copies deletion using operating systems utilities via PowerShell
detection:
  condition: selection
  selection:
    Data|contains:
    - Delete()
    - Remove-WmiObject
    Data|contains|all:
    - Get-WmiObject
    - Win32_ShadowCopy
falsepositives:
- Legitimate Administrator deletes Shadow Copies using operating systems utilities
  for legitimate reason
id: 87df9ee1-5416-453a-8a08-e8d4a51e9ce1
level: high
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md
- https://www.fortinet.com/blog/threat-research/stomping-shadow-copies-a-second-look-into-deletion-methods
status: stable
tags:
- attack.impact
- attack.t1490
title: Delete Volume Shadow Copies Via WMI With PowerShell
