author: Harish Segar, frack113
date: 2020/06/29
description: Detects renamed powershell
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_ps:
    Data|contains:
    - HostApplication=powershell
    - HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell
    - HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
    - HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell
    - HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
  selection:
    Data|contains: HostName=ConsoleHost
falsepositives:
- Unknown
id: 30a8cb77-8eb3-4cfb-8e79-ad457c5a4592
level: low
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: test
tags:
- attack.execution
- attack.t1059.001
title: Renamed Powershell Under Powershell Channel
