author: Sai Prashanth Pulisetti @pulisettis, Aishwarya Singam
date: 2022/12/10
description: Detects a powershell download cradle using nslookup. This cradle uses
  nslookup to extract payloads from DNS records.
detection:
  condition: selection
  selection:
    Data|contains:
    - -q=txt http
    - -querytype=txt http
    Data|contains|all:
    - powershell
    - nslookup
    - '[1]'
falsepositives:
- Unknown
id: 999bff6d-dc15-44c9-9f5c-e1051bfc86e1
level: medium
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://twitter.com/Alh4zr3d/status/1566489367232651264
related:
- id: 1b3b01c7-84e9-4072-86e5-fc285a41ff23
  type: similar
status: test
tags:
- attack.execution
- attack.t1059.001
title: Nslookup PowerShell Download Cradle
