author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/06/24
description: Detects suspicious use of the WSMAN provider without PowerShell.exe as
  the host application.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_ps:
    Data|contains:
    - HostApplication=powershell
    - HostApplication=C:\Windows\System32\WindowsPowerShell\v1.0\powershell
    - HostApplication=C:\Windows\SysWOW64\WindowsPowerShell\v1.0\powershell
    - HostApplication=C:/Windows/System32/WindowsPowerShell/v1.0/powershell
    - HostApplication=C:/Windows/SysWOW64/WindowsPowerShell/v1.0/powershell
  selection:
    Data|contains: ProviderName=WSMan
falsepositives:
- Unknown
id: df9a0e0e-fedb-4d6c-8668-d765dfc92aa7
level: medium
logsource:
  product: windows
  service: powershell-classic
modified: 2023/10/27
references:
- https://twitter.com/chadtilbury/status/1275851297770610688
- https://bohops.com/2020/05/12/ws-management-com-another-approach-for-winrm-lateral-movement/
- https://github.com/bohops/WSMan-WinRM
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.003
title: Suspicious Non PowerShell WSMAN COM Provider
