author: Florian Roth (Nextron Systems), Lee Holmes (idea), Harish Segar (improvements)
date: 2017/03/22
description: Detects PowerShell downgrade attack by comparing the host versions with
  the actually used engine version 2.0
detection:
  condition: selection and not filter_main
  filter_main:
    Data|contains: HostVersion=2.
  selection:
    Data|contains: EngineVersion=2.
falsepositives:
- Unknown
id: 6331d09b-4785-4c13-980f-f96661356249
level: medium
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- http://www.leeholmes.com/blog/2017/03/17/detecting-and-preventing-powershell-downgrade-attacks/
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059.001
title: PowerShell Downgrade Attack - PowerShell
