author: Florian Roth (Nextron Systems)
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
  condition: all of selection_*
  selection_download:
    Data|contains:
    - .DownloadFile(
    - .DownloadString(
  selection_webclient:
    Data|contains: Net.WebClient
falsepositives:
- PowerShell scripts that download content from the Internet
id: 3236fcd0-b7e3-4433-b4f8-86ad61a9af2d
level: medium
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://www.trendmicro.com/en_us/research/22/j/lv-ransomware-exploits-proxyshell-in-attack.html
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download
