author: Teymur Kheirkhabarov, Harish Segar (rule)
date: 2020/06/29
description: Detects suspicious powershell process which includes bxor command, alternative
  obfuscation method to b64 encoded commands.
detection:
  condition: selection and filter
  filter:
    Data|contains:
    - bxor
    - char
    - join
  selection:
    Data|contains: HostName=ConsoleHost
falsepositives:
- Unknown
id: 812837bb-b17f-45e9-8bd0-0ec35d2e3bd6
level: medium
logsource:
  category: ps_classic_start
  product: windows
modified: 2023/10/27
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=46
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious XOR Encoded PowerShell Command Line - PowerShell
