author: Tim Brown
date: 2023/01/09
description: Detects juniper BGP missing MD5 digest. Which may be indicative of brute
  force attacks to manipulate routing.
detection:
  condition: keywords_bgp_juniper
  keywords_bgp_juniper:
    '|all':
    - :179
    - missing MD5 digest
falsepositives:
- Unlikely. Except due to misconfigurations
fields:
- host
id: a7c0ae48-8df8-42bf-91bd-2ea57e2f9d43
level: low
logsource:
  definition: 'Requirements: juniper bgp logs need to be enabled and ingested'
  product: juniper
  service: bgp
modified: 2023/01/23
references:
- https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
status: test
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.credential_access
- attack.collection
- attack.t1078
- attack.t1110
- attack.t1557
title: Juniper BGP Missing MD5
