author: Sagie Dulce, Dekel Paz
date: 2022/01/01
description: Detects remote RPC calls to get event log information via EVEN or EVEN6
detection:
  condition: selection
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid:
    - 82273fdc-e32a-18c3-3f78-827929dc23ea
    - f6beaff7-1e19-4fbb-9f8f-b89e2018337c
falsepositives:
- Remote administrative tasks on Windows Events
id: 2053961f-44c7-4a64-b62d-f6e72800af0d
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:82273fdc-e32a-18c3-3f78-827929dc23ea and uuid:f6beaff7-1e19-4fbb-9f8f-b89e2018337c"'
  product: rpc_firewall
modified: 2022/01/01
references:
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
status: test
tags:
- attack.discovery
title: Remote Event Log Recon
