author: Sagie Dulce, Dekel Paz
date: 2022/01/01
description: Detects remote RPC calls useb by SharpHound to map remote connections
  and local group membership.
detection:
  condition: selection
  selection:
    EventID: 3
    EventLog: RPCFW
    InterfaceUuid: 6bffd098-a112-3610-9833-46c3f87e345a
    OpNum: 2
falsepositives:
- Unknown
id: 65f77b1e-8e79-45bf-bb67-5988a8ce45a5
level: high
logsource:
  category: application
  definition: 'Requirements: install and apply the RPC Firewall to all processes with
    "audit:true action:block uuid:6bffd098-a112-3610-9833-46c3f87e345a opnum:2'
  product: rpc_firewall
modified: 2022/01/01
references:
- https://docs.microsoft.com/en-us/openspecs/windows_protocols/ms-wkst/55118c55-2122-4ef9-8664-0c1ff9e168f3
- https://github.com/jsecurity101/MSRPC-to-ATTACK/blob/ddd4608fe8684fcf2fcf9b48c5f0b3c28097f8a3/documents/MS-WKST.md
- https://github.com/zeronetworks/rpcfirewall
- https://zeronetworks.com/blog/stopping-lateral-movement-via-the-rpc-firewall/
status: test
tags:
- attack.t1087
- attack.discovery
title: SharpHound Recon Account Discovery
