author: Roberto Rodriguez @Cyb3rWard0g, Open Threat Research (OTR)
date: 2020/10/20
description: Detects volume shadow copy mount via Windows event log
detection:
  condition: selection
  selection:
    DeviceName|contains: HarddiskVolumeShadowCopy
    EventID: 98
    Provider_Name: Microsoft-Windows-Ntfs
falsepositives:
- Legitimate use of volume shadow copy mounts (backups maybe).
id: f512acbf-e662-4903-843e-97ce4652b740
level: low
logsource:
  product: windows
  service: system
modified: 2022/12/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1003.002/T1003.002.md#atomic-test-3---esentutlexe-sam-copy
status: test
tags:
- attack.credential_access
- attack.t1003.002
title: Volume Shadow Copy Mount
