author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/14
description: Identifies when the same privilege role has multiple activations by the
  same user.
detection:
  condition: selection
  selection:
    riskEventType: sequentialActivationRenewalsAlertIncident
falsepositives:
- Investigate where if active time period for a role is set too short.
id: 645fd80d-6c07-435b-9e06-7bc1b5656cba
level: high
logsource:
  product: azure
  service: pim
references:
- https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-activated-too-frequently
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.privilege_escalation
title: Roles Activated Too Frequently
