author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/14
description: Identifies an event where there are there are too many accounts assigned
  the Global Administrator role.
detection:
  condition: selection
  selection:
    riskEventType: tooManyGlobalAdminsAssignedToTenantAlertIncident
falsepositives:
- Investigate if threshold setting in PIM is too low.
id: 7bbc309f-e2b1-4eb1-8369-131a367d67d3
level: high
logsource:
  product: azure
  service: pim
references:
- https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#there-are-too-many-global-administrators
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.privilege_escalation
title: Too Many Global Admins
