author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/14
description: Identifies when a privilege role assignment has taken place outside of
  PIM and may indicate an attack.
detection:
  condition: selection
  selection:
    riskEventType: rolesAssignedOutsidePrivilegedIdentityManagementAlertConfiguration
falsepositives:
- Investigate where users are being assigned privileged roles outside of Privileged
  Identity Management and prohibit future assignments from there.
id: b1bc08d1-8224-4758-a0e6-fbcfc98c73bb
level: high
logsource:
  product: azure
  service: pim
references:
- https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#roles-are-being-assigned-outside-of-privileged-identity-management
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.privilege_escalation
title: Roles Assigned Outside PIM
