author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/14
description: Identifies when an organization doesn't have the proper license for PIM
  and is out of compliance.
detection:
  condition: selection
  selection:
    riskEventType: invalidLicenseAlertIncident
falsepositives:
- Investigate if licenses have expired.
id: 58af08eb-f9e1-43c8-9805-3ad9b0482bd8
level: high
logsource:
  product: azure
  service: pim
references:
- https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#the-organization-doesnt-have-microsoft-entra-premium-p2-or-microsoft-entra-id-governance
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.privilege_escalation
title: Invalid PIM License
