author: Mark Morowczynski '@markmorow', Gloria Lee, '@gleeiamglo'
date: 2023/09/14
description: Identifies when a user has been assigned a privilege role and are not
  using that role.
detection:
  condition: selection
  selection:
    riskEventType: redundantAssignmentAlertIncident
falsepositives:
- Investigate if potential generic account that cannot be removed.
id: 8c6ec464-4ae4-43ac-936a-291da66ed13d
level: high
logsource:
  product: azure
  service: pim
references:
- https://learn.microsoft.com/en-us/azure/active-directory/privileged-identity-management/pim-how-to-configure-security-alerts#administrators-arent-using-their-privileged-roles
status: experimental
tags:
- attack.t1078
- attack.persistence
- attack.privilege_escalation
title: Roles Are Not Being Used
