author: Moti Harmats
date: 2023/02/11
description: Detects potential SpEL Injection exploitation, which may lead to RCE.
detection:
  condition: keywords
  keywords:
  - org.springframework.expression.ExpressionException
falsepositives:
- Application bugs
id: e9edd087-89d8-48c9-b0b4-5b9bb10896b8
level: high
logsource:
  category: application
  definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR
    and above)'
  product: spring
references:
- https://owasp.org/www-community/vulnerabilities/Expression_Language_Injection
- https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs
status: test
tags:
- attack.initial_access
- attack.t1190
title: Potential SpEL Injection In Spring Framework
