author: Florian Roth (Nextron Systems)
date: 2018/02/20
description: Detects suspicious DNS error messages that indicate a fatal or suspicious
  error that could be caused by exploiting attempts
detection:
  condition: keywords
  keywords:
  - ' dropping source port zero packet from '
  - ' denied AXFR from '
  - ' exiting (due to fatal error)'
falsepositives:
- Unknown
id: c8e35e96-19ce-4f16-aeb6-fd5588dc5365
level: high
logsource:
  product: linux
  service: syslog
modified: 2022/10/05
references:
- https://github.com/ossec/ossec-hids/blob/1ecffb1b884607cb12e619f9ab3c04f530801083/etc/rules/named_rules.xml
status: test
tags:
- attack.initial_access
- attack.t1190
title: Suspicious Named Error
