author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects unauthorized access attempts to a resource.
detection:
  condition: selection
  selection:
    auditType.action: Unauthorized access to a resource
    auditType.category: Security
falsepositives:
- Access attempts to non-existent repositories or due to outdated plugins. Usually
  "Anonymous" user is reported in the "author.name" field in most cases.
id: 7215374a-de4f-4b33-8ba5-70804c9251d3
level: critical
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
status: experimental
tags:
- attack.resource_development
- attack.t1586
title: Bitbucket Unauthorized Access To A Resource
