author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects global permissions change activity.
detection:
  condition: selection
  selection:
    auditType.action:
    - Global permission remove request
    - Global permission removed
    - Global permission granted
    - Global permission requested
    auditType.category: Permissions
falsepositives:
- Legitimate user activity.
id: aac6c4f4-87c7-4961-96ac-c3fd3a42c310
level: medium
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/global-permissions-776640369.html
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1098
title: Bitbucket Global Permission Changed
