author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects when full data export is attempted an unauthorized user.
detection:
  condition: selection
  selection:
    auditType.action: Unauthorized full data export triggered
    auditType.category: Data pipeline
falsepositives:
- Unlikely
id: 34d81081-03c9-4a7f-91c9-5e46af625cde
level: critical
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
status: experimental
tags:
- attack.collection
- attack.resource_development
- attack.t1213.003
- attack.t1586
title: Bitbucket Unauthorized Full Data Export Triggered
