author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects when secret scanning rule is deleted for the project or repository.
detection:
  condition: selection
  selection:
    auditType.action:
    - Project secret scanning rule deleted
    - Repository secret scanning rule deleted
    auditType.category:
    - Projects
    - Repositories
falsepositives:
- Legitimate user activity.
id: ff91e3f0-ad15-459f-9a85-1556390c138d
level: low
logsource:
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Bitbucket Secret Scanning Rule Deleted
