author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: 'Detects user authentication failure events.

  Please note that this rule can be noisy and it is recommended to use with correlation
  based on "author.name" field.

  '
detection:
  condition: selection
  selection:
    auditType.action: User login failed
    auditType.category: Authentication
falsepositives:
- Legitimate user wrong password attempts.
id: 70ed1d26-0050-4b38-a599-92c53d57d45a
level: medium
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
status: experimental
tags:
- attack.defense_evasion
- attack.credential_access
- attack.t1078.004
- attack.t1110
title: Bitbucket User Login Failure
