author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects Bitbucket global secret scanning rule deletion activity.
detection:
  condition: selection
  selection:
    auditType.action: Global secret scanning rule deleted
    auditType.category: Global administration
falsepositives:
- Legitimate user activity.
id: e16cf0f0-ee88-4901-bd0b-4c8d13d9ee05
level: medium
logsource:
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Bitbucket Global Secret Scanning Rule Deleted
