author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects user data export activity.
detection:
  condition: selection
  selection:
    auditType.action:
    - User permissions export failed
    - User permissions export started
    - User permissions exported
    auditType.category: Users and groups
falsepositives:
- Legitimate user activity.
id: 5259cbf2-0a75-48bf-b57a-c54d6fabaef3
level: medium
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://support.atlassian.com/security-and-access-policies/docs/export-user-accounts
status: experimental
tags:
- attack.collection
- attack.reconnaissance
- attack.discovery
- attack.t1213
- attack.t1082
- attack.t1591.004
title: Bitbucket User Details Export Attempt Detected
