author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects user permission data export attempt.
detection:
  condition: selection
  selection:
    auditType.action:
    - User details export failed
    - User details export started
    - User details exported
    auditType.category: Users and groups
falsepositives:
- Legitimate user activity.
id: 87cc6698-3e07-4ba2-9b43-a85a73e151e2
level: medium
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/users-and-groups-776640439.html
status: experimental
tags:
- attack.reconnaissance
- attack.t1213
- attack.t1082
- attack.t1591.004
title: Bitbucket User Permissions Export Attempt
