author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects when full data export is attempted.
detection:
  condition: selection
  selection:
    auditType.action: Full data export triggered
    auditType.category: Data pipeline
falsepositives:
- Legitimate user activity.
id: 195e1b9d-bfc2-4ffa-ab4e-35aef69815f8
level: high
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/adminjiraserver0811/importing-and-exporting-data-1019391889.html
status: experimental
tags:
- attack.collection
- attack.t1213.003
title: Bitbucket Full Data Export Triggered
