author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects when a secret scanning allowlist rule is added for projects.
detection:
  condition: selection
  selection:
    auditType.action: Project secret scanning allowlist rule added
    auditType.category: Projects
falsepositives:
- Legitimate user activity.
id: 42ccce6d-7bd3-4930-95cd-e4d83fa94a30
level: low
logsource:
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Bitbucket Project Secret Scanning Allowlist Added
