author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: Detects when a repository is exempted from secret scanning feature.
detection:
  condition: selection
  selection:
    auditType.action: Secret scanning exempt repository added
    auditType.category: Repositories
falsepositives:
- Legitimate user activity.
id: b91e8d5e-0033-44fe-973f-b730316f23a1
level: high
logsource:
  definition: 'Requirements: "Basic" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
- https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Bitbucket Secret Scanning Exempt Repository Added
