author: Muhammad Faisal (@faisalusuf)
date: 2024/02/25
description: 'Detects SSH user login access failures.

  Please note that this rule can be noisy and is recommended to use with correlation
  based on "author.name" field.

  '
detection:
  condition: selection
  selection:
    auditType.action: User login failed(SSH)
    auditType.category: Authentication
falsepositives:
- Legitimate user wrong password attempts.
id: d3f90469-fb05-42ce-b67d-0fded91bbef3
level: medium
logsource:
  definition: 'Requirements: "Advance" log level is required to receive these audit
    events.'
  product: bitbucket
  service: audit
references:
- https://confluence.atlassian.com/bitbucketserver/view-and-configure-the-audit-log-776640417.html
- https://confluence.atlassian.com/bitbucketserver/enable-ssh-access-to-git-repositories-776640358.html
status: experimental
tags:
- attack.t1021.004
- attack.t1110
title: Bitbucket User Login Failure Via SSH
