author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/31
description: Detects MSI package installation from suspicious locations
detection:
  condition: selection and not 1 of filter_*
  filter_updhealthtools:
    Data|contains: C:\Windows\TEMP\UpdHealthTools.msi
  filter_winget:
    Data|contains: \AppData\Local\Temp\WinGet\
  selection:
    Data|contains:
    - :\Windows\TEMP\
    - \\\\
    - \Desktop\
    - \PerfLogs\
    - \Users\Public\
    EventID:
    - 1040
    - 1042
    Provider_Name: MsiInstaller
falsepositives:
- False positives may occur if you allow installation from folders such as the desktop,
  the public folder or remote shares. A baseline is required before production use.
id: c7c8aa1c-5aff-408e-828b-998e3620b341
level: medium
logsource:
  product: windows
  service: application
modified: 2023/10/23
references:
- https://www.trendmicro.com/en_us/research/22/h/ransomware-actor-abuses-genshin-impact-anti-cheat-driver-to-kill-antivirus.html
status: test
tags:
- attack.execution
title: MSI Installation From Suspicious Locations
