author: Stamatis Chatzimangou
date: 2022/10/23
description: Detects installation of a remote msi file from web.
detection:
  condition: selection
  selection:
    Data|contains: ://
    EventID:
    - 1040
    - 1042
    Provider_Name: MsiInstaller
falsepositives:
- Unknown
id: 5594e67a-7f92-4a04-b65d-1a42fd824a60
level: medium
logsource:
  product: windows
  service: application
modified: 2022/10/23
references:
- https://twitter.com/_st0pp3r_/status/1583922009842802689
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.t1218.007
title: MSI Installation From Web
