author: Markus Neis, @markus_neis
date: 2021/07/07
description: Detects the image load of vss_ps.dll by uncommon executables
detection:
  condition: selection and not 1 of filter_*
  filter_image_null:
    Image: null
  filter_legit:
    Image|endswith:
    - \clussvc.exe
    - \dismhost.exe
    - \dllhost.exe
    - \inetsrv\appcmd.exe
    - \inetsrv\iissetup.exe
    - \msiexec.exe
    - \rundll32.exe
    - \searchindexer.exe
    - \srtasks.exe
    - \svchost.exe
    - \System32\SystemPropertiesAdvanced.exe
    - \taskhostw.exe
    - \thor.exe
    - \thor64.exe
    - \tiworker.exe
    - \vssvc.exe
    - \WmiPrvSE.exe
    - \wsmprovhost.exe
    Image|startswith: C:\Windows\
  filter_programfiles:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_update:
    CommandLine|contains: \dismhost.exe {
    CommandLine|startswith: C:\$WinREAgent\Scratch\
  selection:
    ImageLoaded|endswith: \vss_ps.dll
falsepositives:
- Unknown
id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
level: high
logsource:
  category: image_load
  product: windows
modified: 2024/03/28
references:
- https://www.virustotal.com/gui/file/ba88ca45589fae0139a40ca27738a8fc2dfbe1be5a64a9558f4e0f52b35c5add
- https://twitter.com/am0nsec/status/1412232114980982787
related:
- id: 48bfd177-7cf2-412b-ad77-baf923489e82
  type: similar
- id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490
title: Suspicious Volume Shadow Copy VSS_PS.dll Load
