author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/11
description: Detects DLL sideloading of unsigned "mfdetours.dll". Executing "mftrace.exe"
  can be abused to attach to an arbitrary process and force load any DLL named "mfdetours.dll"
  from the current directory of execution.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_legit_path:
    ImageLoaded|contains: :\Program Files (x86)\Windows Kits\10\bin\
    SignatureStatus: Valid
  selection:
    ImageLoaded|endswith: \mfdetours.dll
falsepositives:
- Unlikely
id: 948a0953-f287-4806-bbcb-3b2e396df89f
level: high
logsource:
  category: image_load
  product: windows
references:
- Internal Research
related:
- id: d2605a99-2218-4894-8fd3-2afb7946514d
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1574.001
- attack.t1574.002
title: Unsigned Mfdetours.DLL Sideloading
