author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/10/29
description: Detects loading and execution of an unsigned thor scanner binary.
detection:
  condition: selection and not filter_main
  filter_main:
    Signature: Nextron Systems GmbH
    SignatureStatus: valid
    Signed: 'true'
  selection:
    ImageLoaded|endswith:
    - \thor.exe
    - \thor64.exe
    Image|endswith:
    - \thor.exe
    - \thor64.exe
falsepositives:
- Other legitimate binaries named "thor.exe" that aren't published by Nextron Systems
id: ea5c131b-380d-49f9-aeb3-920694da4d4b
level: high
logsource:
  category: image_load
  product: windows
references:
- Internal Research
status: stable
tags:
- attack.defense_evasion
- attack.t1574.002
title: Suspicious Unsigned Thor Scanner Execution
