author: Swachchhanda Shrawan Poudel
date: 2024/02/28
description: 'Detects windows utilities loading an unsigned or untrusted DLL.

  Adversaries often abuse those programs to proxy execution of malicious code.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_sig_status:
    SignatureStatus:
    - errorChaining
    - errorCode_endpoint
    - errorExpired
    - trusted
  filter_main_sig_status_empty:
    SignatureStatus:
    - ''
    - '-'
  filter_main_sig_status_null:
    SignatureStatus: null
  filter_main_signed:
    Signed: 'true'
  filter_main_signed_empty:
    Signed:
    - ''
    - '-'
  filter_main_signed_null:
    Signed: null
  selection:
    Image|endswith:
    - \InstallUtil.exe
    - \RegAsm.exe
    - \RegSvcs.exe
    - \regsvr32.exe
    - \rundll32.exe
falsepositives:
- Unknown
id: b5de0c9a-6f19-43e0-af4e-55ad01f550af
level: medium
logsource:
  category: image_load
  product: windows
modified: 2024/03/07
references:
- https://www.elastic.co/security-labs/Hunting-for-Suspicious-Windows-Libraries-for-Execution-and-Evasion
- https://akhere.hashnode.dev/hunting-unsigned-dlls-using-kql
- https://unit42.paloaltonetworks.com/unsigned-dlls/?web_view=true
status: experimental
tags:
- attack.t1218.011
- attack.t1218.010
- attack.defense_evasion
title: Unsigned DLL Loaded by Windows Utility
