author: '@SerkinValery'
date: 2023/06/08
description: Detects unsigned module load by ClickOnce application.
detection:
  condition: all of selection_*
  selection_path:
    Image|contains: \AppData\Local\Apps\2.0\
  selection_sig_status:
  - Signed: 'false'
  - SignatureStatus: Expired
falsepositives:
- Unlikely
id: 060d5ad4-3153-47bb-8382-43e5e29eda92
level: medium
logsource:
  category: image_load
  product: windows
references:
- https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
status: test
tags:
- attack.persistence
- attack.t1574.002
title: Unsigned Module Loaded by ClickOnce Application
