author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/08
description: Detects outlvba (Microsoft VBA for Outlook Addin) DLL being loaded by
  the outlook process
detection:
  condition: selection
  selection:
    ImageLoaded|endswith: \outlvba.dll
    Image|endswith: \outlook.exe
falsepositives:
- Legitimate macro usage. Add the appropriate filter according to your environment
id: 9a0b8719-cd3c-4f0a-90de-765a4cb3f5ed
level: medium
logsource:
  category: image_load
  product: windows
modified: 2024/03/12
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=58
status: test
tags:
- attack.execution
- attack.t1204.002
title: Microsoft VBA For Outlook Addin Loaded Via Outlook
