author: frack113
date: 2023/02/17
description: Detects the image load of VSS DLL by uncommon executables
detection:
  condition: selection and not 1 of filter_*
  filter_program_files:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  filter_windows:
  - Image:
    - C:\Windows\explorer.exe
    - C:\Windows\ImmersiveControlPanel\SystemSettings.exe
  - Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\Temp\{
    - C:\Windows\WinSxS\
  selection:
    ImageLoaded|endswith: \vsstrace.dll
falsepositives:
- Unknown
id: 48bfd177-7cf2-412b-ad77-baf923489e82
level: high
logsource:
  category: image_load
  product: windows
modified: 2023/03/28
references:
- https://github.com/ORCx41/DeleteShadowCopies
related:
- id: 333cdbe8-27bb-4246-bf82-b41a0dca4b70
  type: similar
- id: 37774c23-25a1-4adb-bb6d-8bb9fd59c0f8
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.impact
- attack.t1490
title: Suspicious Volume Shadow Copy Vsstrace.dll Load
