author: Florian Roth (Nextron Systems)
date: 2022/09/07
description: Detects the load of EvtMuteHook.dll, a key component of SharpEvtHook,
  a tool that tampers with the Windows event logs
detection:
  condition: selection
  selection:
  - Hashes|contains: IMPHASH=330768A4F172E10ACB6287B87289D83B
  - Imphash: 330768a4f172e10acb6287b87289d83b
falsepositives:
- Other DLLs with the same Imphash
id: 49329257-089d-46e6-af37-4afce4290685
level: high
logsource:
  category: image_load
  product: windows
modified: 2023/02/17
references:
- https://github.com/bats3c/EvtMute
related:
- id: bedfc8ad-d1c7-4e37-a20e-e2b0dbee759c
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1562.002
title: HackTool - SharpEvtMute DLL Load
