author: Patrick St. John, OTR (Open Threat Research)
date: 2020/05/03
description: Detects the image load of "Python Core" by a non-Python process. This
  might be indicative of a Python script bundled with Py2Exe.
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_generic:
  - Image|contains: Python
  - Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
    - C:\ProgramData\Anaconda3\
  filter_optional_aurora:
    Image: null
  selection:
    Description: Python Core
falsepositives:
- Legitimate Py2Exe Binaries
- Known false positive caused with Python Anaconda
id: cbb56d62-4060-40f7-9466-d8aaf3123f83
level: medium
logsource:
  category: image_load
  product: windows
modified: 2023/09/18
references:
- https://www.py2exe.org/
- https://unit42.paloaltonetworks.com/unit-42-technical-analysis-seaduke/
status: experimental
tags:
- attack.defense_evasion
- attack.t1027.002
title: Python Image Load By Non-Python Process
