author: Anish Bogati
date: 2024/01/09
description: Detects image load events of system control panel items (.cpl) from uncommon
  or non-system locations which might be the result of sideloading.
detection:
  condition: selection and not 1 of filter_*
  filter_main_legit_location:
    ImageLoaded|contains:
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    - :\Windows\WinSxS\
  selection:
    ImageLoaded|endswith:
    - \hdwwiz.cpl
    - \appwiz.cpl
falsepositives:
- Unknown
id: 2b140a5c-dc02-4bb8-b6b1-8bdb45714cde
level: medium
logsource:
  category: image_load
  product: windows
references:
- https://www.hexacorn.com/blog/2024/01/06/1-little-known-secret-of-fondue-exe/
- https://www.hexacorn.com/blog/2024/01/01/1-little-known-secret-of-hdwwiz-exe/
status: experimental
tags:
- attack.defense_evasion
- attack.t1036
title: System Control Panel Item Loaded From Uncommon Location
