author: yatinwad, TheDFIRReport
date: 2022/06/23
description: Detects DNS queries to "ufile.io", which was seen abused by malware and
  threat actors as a method for data exfiltration
detection:
  condition: selection
  selection:
    QueryName|contains: ufile.io
falsepositives:
- DNS queries for "ufile" are not malicious by nature necessarily. Investigate the
  source to determine the necessary actions to take
id: 1cbbeaaf-3c8c-4e4c-9d72-49485b6a176b
level: low
logsource:
  category: dns_query
  product: windows
modified: 2023/09/18
references:
- https://thedfirreport.com/2021/12/13/diavol-ransomware/
related:
- id: 090ffaad-c01a-4879-850c-6d57da98452d
  type: similar
status: experimental
tags:
- attack.exfiltration
- attack.t1567.002
title: DNS Query To Ufile.io
