author: Florian Roth (Nextron Systems)
date: 2022/01/30
description: Detects DNS queries to a TeamViewer domain only resolved by a TeamViewer
  client by an image that isn't named TeamViewer (sometimes used by threat actors
  for obfuscation)
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_teamviewer:
    Image|contains: TeamViewer
  selection:
    QueryName:
    - taf.teamviewer.com
    - udp.ping.teamviewer.com
falsepositives:
- Unknown binary names of TeamViewer
- Depending on the environment the rule might require some initial tuning before usage
  to avoid FP with third party applications
id: 778ba9a8-45e4-4b80-8e3e-34a419f0b85e
level: medium
logsource:
  category: dns_query
  product: windows
modified: 2023/09/18
references:
- https://www.teamviewer.com/en-us/
status: test
tags:
- attack.command_and_control
- attack.t1219
title: TeamViewer Domain Query By Non-TeamViewer Application
