author: Cian Heasley
date: 2020/08/13
description: Windows Defender logs when the history of detected infections is deleted.
detection:
  condition: selection
  selection:
    EventID: 1013
falsepositives:
- Deletion of Defender malware detections history for legitimate reasons
id: 2afe6582-e149-11ea-87d0-0242ac130003
level: informational
logsource:
  product: windows
  service: windefend
modified: 2023/11/24
references:
- https://docs.microsoft.com/en-us/windows/security/threat-protection/microsoft-defender-antivirus/troubleshoot-microsoft-defender-antivirus
- https://web.archive.org/web/20160727113019/https://answers.microsoft.com/en-us/protect/forum/mse-protect_scanning/microsoft-antimalware-has-removed-history-of/f15af6c9-01a9-4065-8c6c-3f2bdc7de45e
status: test
tags:
- attack.defense_evasion
title: Windows Defender Malware Detection History Deletion
