author: Bailey Bercik '@baileybercik', Mark Morowczynski '@markmorow'
date: 2022/07/28
description: Detects when administrator grants either application permissions (app
  roles) or highly privileged delegated permissions
detection:
  condition: selection
  selection:
    properties.message: Add app role assignment to service principal
falsepositives:
- When the permission is legitimately needed for the app
id: 5aecf3d5-f8a0-48e7-99be-3a759df7358f
level: high
logsource:
  product: azure
  service: auditlogs
modified: 2023/03/29
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-applications#application-granted-highly-privileged-permissions
related:
- id: ba2a7c80-027b-460f-92e2-57d113897dbc
  type: obsoletes
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1098.003
title: App Granted Privileged Delegated Or App Permissions
