author: Harjot Shah Singh, '@cyb3rjy0t'
date: 2024/03/26
description: Detects newly added root certificate authority to an AzureAD tenant to
  support certificate based authentication.
detection:
  condition: selection
  selection:
    OperationName: Set Company Information
    TargetResources.modifiedProperties.newValue|contains: TrustedCAsForPasswordlessAuth
falsepositives:
- Unknown
id: 4bb80281-3756-4ec8-a88e-523c5a6fda9e
level: medium
logsource:
  product: azure
  service: auditlogs
references:
- https://posts.specterops.io/passwordless-persistence-and-privilege-escalation-in-azure-98a01310be3f
- https://goodworkaround.com/2022/02/15/digging-into-azure-ad-certificate-based-authentication/
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1556
title: New Root Certificate Authority Added
