author: Florian Roth (Nextron Systems)
date: 2022/04/29
description: Detects cases in which ngrok, a reverse proxy tool, forwards events to
  the local RDP port, which could be a sign of malicious behaviour
detection:
  condition: selection
  selection:
    Address|contains: '16777216'
    EventID: 21
falsepositives:
- Unknown
id: 64d51a51-32a6-49f0-9f3d-17e34d640272
level: high
logsource:
  product: windows
  service: terminalservices-localsessionmanager
references:
- https://twitter.com/tekdefense/status/1519711183162556416?s=12&t=OTsHCBkQOTNs1k3USz65Zg
- https://ngrok.com/
status: test
tags:
- attack.command_and_control
- attack.t1090
title: Ngrok Usage with Remote Desktop Service
