author: Florian Roth (Nextron Systems)
date: 2022/10/07
description: Detects the invocation of TabTip via CLSID as seen when JuicyPotatoNG
  is used on a system in brute force mode
detection:
  condition: selection
  selection:
    EventID: 10001
    Provider_Name: Microsoft-Windows-DistributedCOM
    param1: C:\Program Files\Common Files\microsoft shared\ink\TabTip.exe
    param2: 2147943140
    param3: '{054AAE20-4BEA-4347-8A35-64A533254A9D}'
falsepositives:
- Unknown
id: bc2e25ed-b92b-4daa-b074-b502bdd1982b
level: high
logsource:
  product: windows
  service: system
modified: 2023/04/14
references:
- https://github.com/antonioCoco/JuicyPotatoNG
status: test
tags:
- attack.execution
- attack.t1557.001
title: Local Privilege Escalation Indicator TabTip
