author: Florian Roth (Nextron Systems)
date: 2017/02/28
description: Detects a segmentation fault error message caused by a crashing apache
  worker process
detection:
  condition: keywords
  keywords:
  - exit signal Segmentation Fault
falsepositives:
- Unknown
id: 1da8ce0b-855d-4004-8860-7d64d42063b1
level: high
logsource:
  definition: 'Requirements: Must be able to collect the error.log file'
  service: apache
modified: 2021/11/27
references:
- http://www.securityfocus.com/infocus/1633
status: test
tags:
- attack.impact
- attack.t1499.004
title: Apache Segmentation Fault
