author: Florian Roth (Nextron Systems)
date: 2019/01/22
description: Detects an issue in apache logs that reports threading related errors
detection:
  condition: keywords
  keywords:
  - '__pthread_tpp_change_priority: Assertion `new_prio == -1 || (new_prio >= fifo_min_prio
    && new_prio <= fifo_max_prio)'
falsepositives:
- 3rd party apache modules - https://bz.apache.org/bugzilla/show_bug.cgi?id=46185
id: e9a2b582-3f6a-48ac-b4a1-6849cdc50b3c
level: medium
logsource:
  definition: 'Requirements: Must be able to collect the error.log file'
  service: apache
modified: 2021/11/27
references:
- https://github.com/hannob/apache-uaf/blob/da40f2be3684c8095ec6066fa68eb5c07a086233/README.md
status: test
tags:
- attack.initial_access
- attack.lateral_movement
- attack.t1190
- attack.t1210
title: Apache Threading Error
