author: Florian Roth (Nextron Systems)
date: 2021/06/09
description: Detects Baby Shark C2 Framework default communication patterns
detection:
  condition: selection
  selection:
    c-uri|contains: momyshark\?key=
falsepositives:
- Unlikely
id: 304810ed-8853-437f-9e36-c4975c3dfd7e
level: critical
logsource:
  category: proxy
modified: 2024/02/15
references:
- https://nasbench.medium.com/understanding-detecting-c2-frameworks-babyshark-641be4595845
status: test
tags:
- attack.command_and_control
- attack.t1071.001
title: HackTool - BabyShark Agent Default URL Pattern
