author: Florian Roth (Nextron Systems)
date: 2017/11/07
description: Detects download of certain file types from hosts in suspicious TLDs
detection:
  condition: selection
  selection:
    c-uri-extension:
    - exe
    - vbs
    - bat
    - rar
    - ps1
    - doc
    - docm
    - xls
    - xlsm
    - pptm
    - rtf
    - hta
    - dll
    - ws
    - wsf
    - sct
    - zip
    cs-host|endswith:
    - .country
    - .stream
    - .gdn
    - .mom
    - .xin
    - .kim
    - .men
    - .loan
    - .download
    - .racing
    - .online
    - .science
    - .ren
    - .gb
    - .win
    - .top
    - .review
    - .vip
    - .party
    - .tech
    - .xyz
    - .date
    - .faith
    - .zip
    - .cricket
    - .space
    - .info
    - .vn
    - .cm
    - .am
    - .cc
    - .asia
    - .ws
    - .tk
    - .biz
    - .su
    - .st
    - .ro
    - .ge
    - .ms
    - .pk
    - .nu
    - .me
    - .ph
    - .to
    - .tt
    - .name
    - .tv
    - .kz
    - .tc
    - .mobi
    - .study
    - .click
    - .link
    - .trade
    - .accountant
    - .cf
    - .gq
    - .ml
    - .ga
    - .pw
falsepositives:
- All kinds of software downloads
fields:
- ClientIP
- c-uri
id: 00d0b5ab-1f55-4120-8e83-487c0a7baf19
level: low
logsource:
  category: proxy
modified: 2023/05/18
references:
- https://www.symantec.com/connect/blogs/shady-tld-research-gdn-and-our-2016-wrap
- https://promos.mcafee.com/en-US/PDF/MTMW_Report.pdf
- https://www.spamhaus.org/statistics/tlds/
- https://krebsonsecurity.com/2018/06/bad-men-at-work-please-dont-click/
related:
- id: b5de2919-b74a-4805-91a7-5049accbaefe
  type: similar
status: test
tags:
- attack.initial_access
- attack.t1566
- attack.execution
- attack.t1203
- attack.t1204.002
title: Download From Suspicious TLD - Blacklist
