author: Axel Olsson
date: 2022/08/14
description: Detect the update check performed by Advanced IP/Port Scanner utilities.
detection:
  condition: selection
  selection:
    c-uri-query|contains|all:
    - lng=
    - ver=
    - beta=
    - type=
    - rmode=
    - product=
    c-uri|contains: /checkupdate.php
falsepositives:
- Expected if you legitimately use the Advanced IP or Port Scanner utilities in your
  environement.
id: 1a9bb21a-1bb5-42d7-aa05-3219c7c8f47d
level: medium
logsource:
  category: proxy
modified: 2024/02/15
references:
- https://www.advanced-ip-scanner.com/
- https://www.advanced-port-scanner.com/
status: test
tags:
- attack.discovery
- attack.t1590
title: PUA - Advanced IP/Port Scanner Update Check
