author: Florian Roth (Nextron Systems)
date: 2017/03/13
description: Detects executable downloads from suspicious remote systems
detection:
  condition: selection and not filter
  filter:
    cs-host|endswith:
    - .com
    - .org
    - .net
    - .edu
    - .gov
    - .uk
    - .ca
    - .de
    - .jp
    - .fr
    - .au
    - .us
    - .ch
    - .it
    - .nl
    - .se
    - .no
    - .es
  selection:
    c-uri-extension:
    - exe
    - vbs
    - bat
    - rar
    - ps1
    - doc
    - docm
    - xls
    - xlsm
    - pptm
    - rtf
    - hta
    - dll
    - ws
    - wsf
    - sct
    - zip
falsepositives:
- All kind of software downloads
fields:
- ClientIP
- c-uri
id: b5de2919-b74a-4805-91a7-5049accbaefe
level: low
logsource:
  category: proxy
modified: 2023/05/18
references:
- Internal Research
related:
- id: 00d0b5ab-1f55-4120-8e83-487c0a7baf19
  type: similar
status: test
tags:
- attack.initial_access
- attack.t1566
- attack.execution
- attack.t1203
- attack.t1204.002
title: Download From Suspicious TLD - Whitelist
