author: Florian Roth (Nextron Systems)
date: 2017/07/08
description: 'Detects a potentially suspicious empty user agent strings in proxy log.

  Could potentially indicate an uncommon request method.

  '
detection:
  condition: selection
  selection:
    c-useragent: ''
falsepositives:
- Unknown
id: 21e44d78-95e7-421b-a464-ffd8395659c4
level: medium
logsource:
  category: proxy
modified: 2021/11/27
references:
- https://twitter.com/Carlos_Perez/status/883455096645931008
status: test
tags:
- attack.defense_evasion
- attack.command_and_control
- attack.t1071.001
title: HTTP Request With Empty User Agent
