author: Florian Roth (Nextron Systems), Tim Shelton
date: 2019/03/07
description: Detects Bitsadmin connections to domains with uncommon TLDs
detection:
  condition: selection and not falsepositives
  falsepositives:
    cs-host|endswith:
    - .com
    - .net
    - .org
    - .scdn.co
    - .sfx.ms
  selection:
    c-useragent|startswith: Microsoft BITS/
falsepositives:
- Rare programs that use Bitsadmin and update from regional TLDs e.g. .uk or .ca
fields:
- ClientIP
- c-uri
- c-useragent
id: 9eb68894-7476-4cd6-8752-23b51f5883a7
level: high
logsource:
  category: proxy
modified: 2023/05/17
references:
- https://twitter.com/jhencinski/status/1102695118455349248
- https://isc.sans.edu/forums/diary/Investigating+Microsoft+BITS+Activity/23281/
status: test
tags:
- attack.command_and_control
- attack.t1071.001
- attack.defense_evasion
- attack.persistence
- attack.t1197
- attack.s0190
title: Bitsadmin to Uncommon TLD
