author: Daniil Yugoslavskiy, oscd.community
date: 2020/10/19
description: Detects macOS Gatekeeper bypass via xattr utility
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - -d
    - com.apple.quarantine
    Image|endswith: /xattr
falsepositives:
- Legitimate activities
id: f5141b6d-9f42-41c6-a7bf-2a780678b29b
level: low
logsource:
  category: process_creation
  product: macos
modified: 2024/04/18
references:
- https://github.com/redcanaryco/atomic-red-team/blob/1fed40dc7e48f16ed44dcdd9c73b9222a70cca85/atomics/T1553.001/T1553.001.md
- https://www.loobins.io/binaries/xattr/
status: test
tags:
- attack.defense_evasion
- attack.t1553.001
title: Gatekeeper Bypass via Xattr
