author: Pratinav Chandra
date: 2024/05/29
description: 'Detects the addition of a new file or path exclusion to MacOS Time Machine
  via the "tmutil" utility.

  An adversary could exclude a path from Time Machine backups to prevent certain files
  from being backed up.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    CommandLine|contains: addexclusion
  selection_img:
  - Image|endswith: /tmutil
  - CommandLine|contains: tmutil
falsepositives:
- Legitimate administrator activity
id: 9acf45ed-3a26-4062-bf08-56857613eb52
level: medium
logsource:
  category: process_creation
  product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
- https://www.loobins.io/binaries/tmutil/
status: experimental
tags:
- attack.impact
- attack.t1490
title: New File Exclusion Added To Time Machine Via Tmutil - MacOS
