author: Sohan G (D4rkCiph3r)
date: 2023/01/31
description: Detects possible malicious execution of JXA in-memory via OSAScript
detection:
  condition: all of selection_*
  selection_js:
  - CommandLine|contains|all:
    - ' -l '
    - JavaScript
  - CommandLine|contains: .js
  selection_main:
    CommandLine|contains|all:
    - osascript
    - ' -e '
    - eval
    - NSData.dataWithContentsOfURL
falsepositives:
- Unknown
fields:
- CommandLine
id: f1408a58-0e94-4165-b80a-da9f96cf6fc3
level: high
logsource:
  category: process_creation
  product: macos
references:
- https://redcanary.com/blog/applescript/
related:
- id: 1bc2e6c5-0885-472b-bed6-be5ea8eace55
  type: derived
status: test
tags:
- attack.t1059.002
- attack.t1059.007
- attack.execution
title: JXA In-memory Execution Via OSAScript
