author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024/01/02
description: 'Detects the use of csrutil to disable the Configure System Integrity
  Protection (SIP). This technique is used in post-exploit scenarios.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains: disable
    Image|endswith: /csrutil
falsepositives:
- Unknown
id: 3603f18a-ec15-43a1-9af2-d196c8a7fec6
level: medium
logsource:
  category: process_creation
  product: macos
references:
- https://ss64.com/osx/csrutil.html
- https://objective-see.org/blog/blog_0x6D.html
- https://www.welivesecurity.com/2017/10/20/osx-proton-supply-chain-attack-elmedia/
- https://www.virustotal.com/gui/file/05a2adb266ec6c0ba9ed176d87d8530e71e845348c13caf9f60049760c312cd3/behavior
status: experimental
tags:
- attack.discovery
- attack.t1518.001
title: System Integrity Protection (SIP) Disabled
