author: Pratinav Chandra
date: 2024/05/29
description: 'Detects deletion attempts of MacOS Time Machine backups via the native
  backup utility "tmutil".

  An adversary may perform this action before launching a ransonware attack to prevent
  the victim from restoring their files.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    CommandLine|contains: delete
  selection_img:
  - Image|endswith: /tmutil
  - CommandLine|contains: tmutil
falsepositives:
- Legitimate activities
id: 452df256-da78-427a-866f-49fa04417d74
level: medium
logsource:
  category: process_creation
  product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
- https://www.loobins.io/binaries/tmutil/
status: experimental
tags:
- attack.impact
- attack.t1490
title: Time Machine Backup Deletion Attempt Via Tmutil - MacOS
