author: Pratinav Chandra
date: 2024/05/29
description: 'Detects disabling of Time Machine (Apple''s automated backup utility
  software) via the native macOS backup utility "tmutil".

  An attacker can use this to prevent backups from occurring.

  '
detection:
  condition: all of selection_*
  selection_cmd:
    CommandLine|contains: disable
  selection_img:
  - Image|endswith: /tmutil
  - CommandLine|contains: tmutil
falsepositives:
- Legitimate administrator activity
id: 2c95fa8a-8b8d-4787-afce-7117ceb8e3da
level: medium
logsource:
  category: process_creation
  product: macos
references:
- https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1490/T1490.md#atomic-test-12---disable-time-machine
- https://www.loobins.io/binaries/tmutil/
status: experimental
tags:
- attack.impact
- attack.t1490
title: Time Machine Backup Disabled Via Tmutil - MacOS
