author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2023/12/20
description: Detects the use of "sw_vers" for system information discovery
detection:
  condition: all of selection_*
  selection_image:
    Image|endswith: /sw_vers
  selection_options:
    CommandLine|contains:
    - -buildVersion
    - -productName
    - -productVersion
falsepositives:
- Legitimate administrative activities
id: 5de06a6f-673a-4fc0-8d48-bcfe3837b033
level: medium
logsource:
  category: process_creation
  product: macos
references:
- https://www.virustotal.com/gui/file/d3fa64f63563fe958b75238742d1e473800cb5f49f5cb79d38d4aa3c93709026/behavior
- https://www.virustotal.com/gui/file/03b71eaceadea05bc0eea5cddecaa05f245126d6b16cfcd0f3ba0442ac58dab3/behavior
- https://ss64.com/osx/sw_vers.html
status: experimental
tags:
- attack.discovery
- attack.t1082
title: System Information Discovery Using sw_vers
