author: Joseliyo Sanchez, @Joseliyo_Jstnk
date: 2024/01/02
description: 'Detects the use of csrutil to view the Configure System Integrity Protection
  (SIP) status. This technique is used in post-exploit scenarios.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains: status
    Image|endswith: /csrutil
falsepositives:
- Legitimate administration activities
id: 53821412-17b0-4147-ade0-14faae67d54b
level: low
logsource:
  category: process_creation
  product: macos
references:
- https://ss64.com/osx/csrutil.html
- https://objective-see.org/blog/blog_0x6D.html
- https://www.welivesecurity.com/2017/10/20/osx-proton-supply-chain-attack-elmedia/
- https://www.virustotal.com/gui/file/05a2adb266ec6c0ba9ed176d87d8530e71e845348c13caf9f60049760c312cd3/behavior
status: experimental
tags:
- attack.discovery
- attack.t1518.001
title: System Integrity Protection (SIP) Enumeration
