author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/14
description: Detects potential abuse of ntdsutil to dump ntds.dit database to a suspicious
  location
detection:
  condition: all of selection_*
  selection_paths:
    Data|contains:
    - :\ntds.dit
    - \Appdata\
    - \Desktop\
    - \Downloads\
    - \Perflogs\
    - \Temp\
    - \Users\Public\
  selection_root:
    Data|contains: ntds.dit
    EventID: 325
    Provider_Name: ESENT
falsepositives:
- Legitimate backup operation/creating shadow copies
id: 94dc4390-6b7c-4784-8ffc-335334404650
level: medium
logsource:
  product: windows
  service: application
modified: 2023/10/23
references:
- https://twitter.com/mgreen27/status/1558223256704122882
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2012-r2-and-2012/jj574207(v=ws.11)
status: test
tags:
- attack.execution
title: Dump Ntds.dit To Suspicious Location
