author: Nikita Khalimonenkov
date: 2024/04/17
description: 'Detects when a successful MFA authentication occurs due to the use of
  a bypass code.

  A bypass code is a temporary passcode created by an administrator for a specific
  user to access a Duo-protected application. These are generally used as "backup
  codes," so that enrolled users who are having problems with their mobile devices
  (e.g., mobile service is disrupted, the device is lost or stolen, etc.) or who temporarily
  can''t use their enrolled devices (on a plane without mobile data services) can
  still access their Duo-protected systems.

  '
detection:
  condition: selection
  selection:
    event_type: authentication
    reason: bypass_user
falsepositives:
- Legitimate user that was assigned on purpose to a bypass group
id: 6f7e1c10-2dc9-4312-adb6-9574ff09a5c8
level: medium
logsource:
  product: cisco
  service: duo
references:
- https://duo.com/docs/adminapi#logs
- https://help.duo.com/s/article/6327?language=en_US
status: experimental
tags:
- attack.credential_access
- attack.defense_evasion
- attack.initial_access
title: Cisco Duo Successful MFA Authentication Via Bypass Code
