author: Florian Roth (Nextron Systems)
date: 2022/06/28
description: Detects new BITS transfer job where the LocalName/Saved file is stored
  in a potentially suspicious location
detection:
  condition: selection
  selection:
    EventID: 16403
    LocalName|contains:
    - \Desktop\
    - C:\Users\Public\
    - C:\PerfLogs\
falsepositives:
- Unknown
id: f8a56cb7-a363-44ed-a82f-5926bb44cd05
level: high
logsource:
  product: windows
  service: bits-client
modified: 2023/03/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
title: BITS Transfer Job Download To Potential Suspicious Folder
