author: frack113
date: 2022/03/01
description: Detects new BITS transfer job saving local files with potential suspicious
  extensions
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_generic:
    LocalName|contains: \AppData\
    RemoteName|contains: .com
  selection:
    EventID: 16403
    LocalName|endswith:
    - .bat
    - .dll
    - .exe
    - .hta
    - .ps1
    - .psd1
    - .sh
    - .vbe
    - .vbs
falsepositives:
- While the file extensions in question can be suspicious at times. It's best to add
  filters according to your environment to avoid large amount false positives
id: b85e5894-9b19-4d86-8c87-a2f3b81f0521
level: medium
logsource:
  product: windows
  service: bits-client
modified: 2023/03/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
title: BITS Transfer Job Downloading File Potential Suspicious Extension
