author: frack113
date: 2022/03/01
description: Detects the creation of a new bits job by PowerShell
detection:
  condition: selection
  selection:
    EventID: 3
    processPath|endswith:
    - \powershell.exe
    - \pwsh.exe
falsepositives:
- Administrator PowerShell scripts
id: fe3a2d49-f255-4d10-935c-bda7391108eb
level: low
logsource:
  product: windows
  service: bits-client
modified: 2023/03/27
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1197/T1197.md
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.t1197
title: New BITS Job Created Via PowerShell
