author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
description: Detects when the MSSQL "xp_cmdshell" stored procedure is used to execute
  commands
detection:
  condition: selection
  selection:
    Data|contains|all:
    - object_name:xp_cmdshell
    - statement:EXEC
    EventID: 33205
    Provider_Name: MSSQLSERVER
falsepositives:
- Unknown
id: 7f103213-a04e-4d59-8261-213dddf22314
level: high
logsource:
  definition: MSSQL audit policy to monitor for 'xp_cmdshell' must be enabled in order
    to receive this event in the application log (Follow this tutorial https://dba.stackexchange.com/questions/103183/is-there-any-way-to-monitor-execution-of-xp-cmdshell-in-sql-server-2012)
  product: windows
  service: application
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
status: test
tags:
- attack.execution
title: MSSQL XPCmdshell Suspicious Execution
