author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/13
description: Detects when an attacker tries to backdoor the MSSQL server by adding
  a backdoor account to the sysadmin fixed server role
detection:
  condition: selection
  selection:
    Data|contains|all:
    - object_name:sysadmin
    - 'statement:alter server role [sysadmin] add member '
    EventID: 33205
    Provider_Name: MSSQLSERVER
falsepositives:
- Rare legitimate administrative activity
id: 08200f85-2678-463e-9c32-88dce2f073d1
level: high
logsource:
  definition: MSSQL audit policy must be enabled in order to receive this event in
    the application log
  product: windows
  service: application
references:
- https://www.netspi.com/blog/technical/network-penetration-testing/sql-server-persistence-part-1-startup-stored-procedures/
status: test
tags:
- attack.persistence
title: MSSQL Add Account To Sysadmin Role
