author: j4son
date: 2023/10/11
description: Detects failed logon attempts from clients with external network IP to
  an MSSQL server. This can be a sign of a bruteforce attack.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ips:
    Data|contains:
    - 'CLIENT: 10.'
    - 'CLIENT: 172.16.'
    - 'CLIENT: 172.17.'
    - 'CLIENT: 172.18.'
    - 'CLIENT: 172.19.'
    - 'CLIENT: 172.20.'
    - 'CLIENT: 172.21.'
    - 'CLIENT: 172.22.'
    - 'CLIENT: 172.23.'
    - 'CLIENT: 172.24.'
    - 'CLIENT: 172.25.'
    - 'CLIENT: 172.26.'
    - 'CLIENT: 172.27.'
    - 'CLIENT: 172.28.'
    - 'CLIENT: 172.29.'
    - 'CLIENT: 172.30.'
    - 'CLIENT: 172.31.'
    - 'CLIENT: 192.168.'
    - 'CLIENT: 127.'
    - 'CLIENT: 169.254.'
  selection:
    EventID: 18456
    Provider_Name: MSSQLSERVER
falsepositives:
- Unknown
id: ebfe73c2-5bc9-4ed9-aaa8-8b54b2b4777d
level: medium
logsource:
  definition: 'Requirements: Must enable MSSQL authentication.'
  product: windows
  service: application
references:
- https://cybersecthreat.com/2020/07/08/enable-mssql-authentication-log-to-eventlog/
- https://www.experts-exchange.com/questions/27800944/EventID-18456-Failed-to-open-the-explicitly-specified-database.html
related:
- id: 218d2855-2bba-4f61-9c85-81d0ea63ac71
  type: similar
status: experimental
tags:
- attack.credential_access
- attack.t1110
title: MSSQL Server Failed Logon From External Network
