author: Florian Roth (Nextron Systems), Rich Warren, Christian Burkard (Nextron Systems)
date: 2021/08/09
description: Detects a successful export of an Exchange mailbox to untypical directory
  or with aspx name suffix which can be used to place a webshell or the needed role
  assignment for it
detection:
  condition: (export_command and export_params) or role_assignment
  export_command:
    '|all':
    - New-MailboxExportRequest
    - ' -Mailbox '
  export_params:
  - -FilePath "\\\\
  - .aspx
  role_assignment:
    '|all':
    - New-ManagementRoleAssignment
    - ' -Role "Mailbox Import Export"'
    - ' -User '
falsepositives:
- Unlikely
id: 516376b4-05cd-4122-bae0-ad7641c38d48
level: critical
logsource:
  product: windows
  service: msexchange-management
modified: 2023/04/30
references:
- https://blog.orange.tw/2021/08/proxylogon-a-new-attack-surface-on-ms-exchange-part-1.html
status: test
tags:
- attack.persistence
- attack.t1505.003
title: Mailbox Export to Exchange Webserver
