author: Christian Burkard (Nextron Systems)
date: 2021/08/27
description: Detects removal of an exported Exchange mailbox which could be to cover
  tracks from ProxyShell exploit
detection:
  condition: keywords
  keywords:
    '|all':
    - Remove-MailboxExportRequest
    - ' -Identity '
    - ' -Confirm "False"'
falsepositives:
- Unknown
id: 09570ae5-889e-43ea-aac0-0e1221fb3d95
level: high
logsource:
  product: windows
  service: msexchange-management
modified: 2023/01/23
references:
- https://github.com/rapid7/metasploit-framework/blob/1416b5776d963f21b7b5b45d19f3e961201e0aed/modules/exploits/windows/http/exchange_proxyshell_rce.rb#L430
status: test
tags:
- attack.defense_evasion
- attack.t1070
title: Remove Exported Mailbox from Exchange Webserver
