author: frack113
date: 2023/01/13
description: 'Detects when adversaries try to stop system services or processes by
  deleting their respective scheduled tasks in order to conduct data destructive activities

  '
detection:
  condition: selection and not filter
  filter:
    UserName|contains:
    - AUTHORI
    - AUTORI
  selection:
    EventID: 141
    TaskName|contains:
    - \Windows\SystemRestore\SR
    - \Windows\Windows Defender\
    - \Windows\BitLocker
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
    - \Windows\UpdateOrchestrator\
    - \Windows\ExploitGuard
falsepositives:
- Unknown
id: 9e3cb244-bdb8-4632-8c90-6079c8f4f16d
level: high
logsource:
  definition: 'Requirements: The "Microsoft-Windows-TaskScheduler/Operational" is
    disabled by default and needs to be enabled in order for this detection to trigger'
  product: windows
  service: taskscheduler
modified: 2023/02/07
references:
- https://www.socinvestigation.com/most-common-windows-event-ids-to-hunt-mind-map/
related:
- id: dbc1f800-0fe0-4bc0-9c66-292c2abe3f78
  type: similar
- id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
  type: similar
status: test
tags:
- attack.impact
- attack.t1489
title: Important Scheduled Task Deleted
