author: Harjot Singh, '@cyb3rjy0t'
date: 2023/01/10
description: Detects risky authencaition from a non AD registered device without MFA
  being required.
detection:
  condition: selection
  selection:
    AuthenticationRequirement: singleFactorAuthentication
    DeviceDetail.trusttype: ''
    RiskState: atRisk
    Status: Success
falsepositives:
- Unknown
id: 572b12d4-9062-11ed-a1eb-0242ac120002
level: high
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#non-compliant-device-sign-in
status: test
tags:
- attack.defense_evasion
- attack.t1078
title: Suspicious SignIns From A Non Registered Device
