author: AlertIQ
date: 2021/10/10
description: "Detect access has been blocked by Conditional Access policies.\nThe\
  \ access policy does not allow token issuance which might be sights\u2248 of unauthorizeed\
  \ login to valid accounts.\n"
detection:
  condition: selection
  selection:
    ResultType: 53003
falsepositives:
- Unknown
id: 9a60e676-26ac-44c3-814b-0c2a8b977adf
level: medium
logsource:
  product: azure
  service: signinlogs
modified: 2022/12/25
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-privileged-accounts
status: test
tags:
- attack.credential_access
- attack.initial_access
- attack.t1110
- attack.t1078.004
title: User Access Blocked by Azure Conditional Access
