author: Yochana Henderson, '@Yochana-H'
date: 2022/06/17
description: Alert on when legacy authentication has been used on an account
detection:
  condition: selection
  selection:
    ActivityDetails: Sign-ins
    ClientApp:
    - Other client
    - IMAP
    - POP3
    - MAPI
    - SMTP
    - Exchange ActiveSync
    - Exchange Web Services
    Username: UPN
falsepositives:
- User has been put in acception group so they can use legacy authentication
id: 60f6535a-760f-42a9-be3f-c9a0a025906e
level: high
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-privileged-accounts
status: test
tags:
- attack.initial_access
- attack.credential_access
- attack.t1078.004
- attack.t1110
title: Use of Legacy Authentication Protocols
