author: Mark Morowczynski '@markmorow', MikeDuddington, '@dudders1'
date: 2022/08/11
description: Detects when sign-ins increased by 10% or greater.
detection:
  condition: selection
  selection:
    Count: <10%
    Status: failure
falsepositives:
- Unlikely
id: e1d02b53-c03c-4948-b11d-4d00cca49d03
level: medium
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-user-accounts#monitoring-for-failed-unusual-sign-ins
status: test
tags:
- attack.defense_evasion
- attack.t1078
title: Increased Failed Authentications Of Any Type
