author: MikeDuddington, '@dudders1'
date: 2022/07/28
description: Detect failed authentications from countries you do not operate out of.
detection:
  condition: not selection and not selection1
  selection:
    Status: Success
  selection1:
    Location|contains: <Countries you DO operate out of e,g GB, use OR for multiple>
falsepositives:
- If this was approved by System Administrator.
id: 28870ae4-6a13-4616-bd1a-235a7fad7458
level: low
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-user-accounts
status: test
tags:
- attack.initial_access
- attack.credential_access
- attack.t1078.004
- attack.t1110
title: Failed Authentications From Countries You Do Not Operate Out Of
