author: Janantha Marasinghe
date: 2022/11/27
description: Detects AzureHound (A BloodHound data collector for Microsoft Azure)
  activity via the default User-Agent that is used during its operation after successful
  authentication.
detection:
  condition: selection
  selection:
    ResultType: 0
    userAgent|contains: azurehound
falsepositives:
- Unknown
id: 35b781cc-1a08-4a5a-80af-42fd7c315c6b
level: high
logsource:
  product: azure
  service: signinlogs
references:
- https://github.com/BloodHoundAD/AzureHound
status: test
tags:
- attack.discovery
- attack.t1087.004
- attack.t1526
title: Discovery Using AzureHound
