author: Michael Epping, '@mepples21'
date: 2022/06/28
description: Monitor and alert for device registration or join events where MFA was
  not performed.
detection:
  condition: selection and not filter_mfa
  filter_mfa:
    AuthenticationRequirement: multiFactorAuthentication
  selection:
    ResourceDisplayName: Device Registration Service
    conditionalAccessStatus: success
falsepositives:
- Unknown
id: 5afa454e-030c-4ab4-9253-a90aa7fcc581
level: medium
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-us/azure/active-directory/fundamentals/security-operations-devices#device-registrations-and-joins-outside-policy
status: test
tags:
- attack.defense_evasion
- attack.t1078.004
title: Device Registration or Join Without MFA
