author: Yochana Henderson, '@Yochana-H'
date: 2022/06/01
description: Define a baseline threshold for failed sign-ins due to Conditional Access
  failures
detection:
  condition: selection
  selection:
    ResultType: 53003
    Resultdescription: Blocked by Conditional Access
falsepositives:
- Service Account misconfigured
- Misconfigured Systems
- Vulnerability Scanners
id: b4a6d707-9430-4f5f-af68-0337f52d5c42
level: high
logsource:
  product: azure
  service: signinlogs
references:
- https://docs.microsoft.com/en-gb/azure/active-directory/fundamentals/security-operations-privileged-accounts
status: test
tags:
- attack.initial_access
- attack.credential_access
- attack.t1110
- attack.t1078.004
title: Sign-in Failure Due to Conditional Access Requirements Not Met
