author: Bjoern Kimminich
date: 2017/11/27
description: Detects SQL error messages that indicate probing for an injection attack
detection:
  condition: keywords
  keywords:
  - quoted string not properly terminated
  - You have an error in your SQL syntax
  - Unclosed quotation mark
  - 'near "*": syntax error'
  - SELECTs to the left and right of UNION do not have the same number of result columns
falsepositives:
- A syntax error in MySQL also occurs in non-dynamic (safe) queries if there is an
  empty in() clause, that may often be the case.
id: 8a670c6d-7189-4b1c-8017-a417ca84a086
level: high
logsource:
  category: application
  definition: 'Requirements: application error logs must be collected (with LOG_LEVEL
    ERROR and above)'
  product: sql
modified: 2023/02/12
references:
- http://www.sqlinjection.net/errors
status: test
tags:
- attack.initial_access
- attack.t1190
title: Suspicious SQL Error Messages
