author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/10
description: Detects when a file with a suspicious extension is created in the startup
  folder
detection:
  condition: selection
  selection:
    TargetFilename|contains: \Windows\Start Menu\Programs\Startup\
    TargetFilename|endswith:
    - .vbs
    - .vbe
    - .bat
    - .ps1
    - .hta
    - .dll
    - .jar
    - .msi
    - .scr
    - .cmd
falsepositives:
- Rare legitimate usage of some of the extensions mentioned in the rule
id: 28208707-fe31-437f-9a7f-4b1108b94d2e
level: high
logsource:
  category: file_event
  product: windows
modified: 2023/01/06
references:
- https://github.com/last-byte/PersistenceSniper
related:
- id: 2aa0a6b4-a865-495b-ab51-c28249537b75
  type: similar
status: test
tags:
- attack.persistence
- attack.t1547.001
title: Suspicious Startup Folder Persistence
