author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/11
description: Detects the creation of binaries in the WinSxS folder by non-system processes
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_system_location:
    Image|startswith:
    - C:\Windows\Systems32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
  selection:
    TargetFilename|endswith: .exe
    TargetFilename|startswith: C:\Windows\WinSxS\
falsepositives:
- Unknown
id: 34746e8c-5fb8-415a-b135-0abc167e912a
level: medium
logsource:
  category: file_event
  product: windows
references:
- https://media.defense.gov/2023/May/09/2003218554/-1/-1/0/JOINT_CSA_HUNTING_RU_INTEL_SNAKE_MALWARE_20230509.PDF
related:
- id: 64827580-e4c3-4c64-97eb-c72325d45399
  type: derived
status: test
tags:
- attack.execution
title: WinSxS Executable File Creation By Non-System Process
