author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/03/11
description: Detects file creation events with filename patterns used by CrackMapExec.
detection:
  condition: selection_path and 1 of selection_names_*
  selection_names_re:
  - TargetFilename|re: \\[0-9a-f]{8}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{4}-[0-9a-f]{12}\.txt$
  - TargetFilename|re: \\[a-zA-Z]{8}\.tmp$
  selection_names_str:
    TargetFilename|endswith:
    - \temp.ps1
    - \msol.ps1
  selection_path:
    TargetFilename|startswith: C:\Windows\Temp\
falsepositives:
- Unknown
id: 736ffa74-5f6f-44ca-94ef-1c0df4f51d2a
level: high
logsource:
  category: file_event
  product: windows
references:
- https://github.com/byt3bl33d3r/CrackMapExec/
related:
- id: 9433ff9c-5d3f-4269-99f8-95fc826ea489
  type: obsoletes
status: experimental
tags:
- attack.credential_access
- attack.t1003.001
title: CrackMapExec File Indicators
