author: frack113
date: 2022/09/05
description: 'Detect creation of suspicious executable file names.

  Some strings look for suspicious file extensions, others look for filenames that
  exploit unquoted service paths.

  '
detection:
  condition: selection
  selection:
    TargetFilename|endswith:
    - :\$Recycle.Bin.exe
    - :\Documents and Settings.exe
    - :\MSOCache.exe
    - :\PerfLogs.exe
    - :\Recovery.exe
    - .bat.exe
    - .sys.exe
falsepositives:
- Unknown
id: 74babdd6-a758-4549-9632-26535279e654
level: high
logsource:
  category: file_event
  product: windows
modified: 2023/12/11
references:
- https://medium.com/@SumitVerma101/windows-privilege-escalation-part-1-unquoted-service-path-c7a011a8d8ae
- https://app.any.run/tasks/76c69e2d-01e8-49d9-9aea-fb7cc0c4d3ad/
status: test
tags:
- attack.defense_evasion
- attack.t1564
title: Suspicious Executable File Creation
