author: Tim Shelton
date: 2022/01/10
description: Detects a file ending in jse, vbe, js, vba, vbs written by cscript.exe
  or wscript.exe
detection:
  condition: selection
  selection:
    Image|endswith:
    - \wscript.exe
    - \cscript.exe
    TargetFilename|endswith:
    - .jse
    - .vbe
    - .js
    - .vba
    - .vbs
    TargetFilename|startswith:
    - C:\Users\
    - C:\ProgramData
falsepositives:
- Unknown
fields:
- Image
- TargetFilename
id: 002bdb95-0cf1-46a6-9e08-d38c128a6127
level: high
logsource:
  category: file_event
  product: windows
modified: 2022/12/02
references:
- WScript or CScript Dropper (cea72823-df4d-4567-950c-0b579eaf0846)
related:
- id: cea72823-df4d-4567-950c-0b579eaf0846
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: WScript or CScript Dropper - File
