author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/06/24
description: 'Detects the creation of a file with the ".dll" extension that has the
  name of a System DLL in uncommon or unsuspected locations. (Outisde of "System32",
  "SysWOW64", etc.).

  It is highly recommended to perform an initial baseline before using this rule in
  production.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    TargetFilename|contains:
    - C:\$WINDOWS.~BT\
    - C:\$WinREAgent\
    - C:\Windows\SoftwareDistribution\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
    - C:\Windows\WinSxS\
    - C:\Windows\uus\
  selection:
    TargetFilename|endswith:
    - \secur32.dll
    - \tdh.dll
falsepositives:
- Third party software might bundle specific versions of system DLLs.
id: 13c02350-4177-4e45-ac17-cf7ca628ff5e
level: medium
logsource:
  category: file_event
  product: windows
references:
- Internal Research
status: test
tags:
- attack.defense_evasion
- attack.t1036.005
title: Files With System DLL Name In Unsuspected Locations
