author: Moti Harmats
date: 2023/02/11
description: Detects exceptions in velocity template renderer, this most likely happens
  due to dynamic rendering of user input and may lead to RCE.
detection:
  condition: keywords
  keywords:
  - ParseErrorException
  - VelocityException
  - TemplateInitException
falsepositives:
- Application bugs
- Missing .vm files
id: 16c86189-b556-4ee8-b4c7-7e350a195a4f
level: high
logsource:
  category: application
  definition: 'Requirements: application error logs must be collected (with LOG_LEVEL=ERROR
    and above)'
  product: velocity
references:
- https://antgarsil.github.io/posts/velocity/
- https://www.wix.engineering/post/threat-and-vulnerability-hunting-with-application-server-error-logs
status: test
tags:
- attack.initial_access
- attack.t1190
title: Potential Server Side Template Injection In Velocity
