author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/25
description: Detects tampering with the MacroRuntimeScanScope registry key to disable
  runtime scanning of enabled macros
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|contains|all:
    - \SOFTWARE\
    - \Microsoft\Office\
    - \Common\Security
    TargetObject|endswith: \MacroRuntimeScanScope
falsepositives:
- Unknown
id: ab871450-37dc-4a3a-997f-6662aa8ae0f1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://www.microsoft.com/en-us/security/blog/2018/09/12/office-vba-amsi-parting-the-veil-on-malicious-macros/
- https://admx.help/?Category=Office2016&Policy=office16.Office.Microsoft.Policies.Windows::L_MacroRuntimeScanScope
- https://github.com/S3cur3Th1sSh1t/OffensiveVBA/blob/28cc6a2802d8176195ac19b3c8e9a749009a82a3/src/AMSIbypasses.vba
status: experimental
tags:
- attack.defense_evasion
title: Disable Macro Runtime Scan Scope
