author: Christian Burkard (Nextron Systems)
date: 2021/08/30
description: Detects the pattern of UAC Bypass using a path parsing issue in winsat.exe
  (UACMe 52)
detection:
  condition: selection
  selection:
    Details|endswith: \appdata\local\temp\system32\winsat.exe
    Details|startswith: c:\users\
    TargetObject|contains: \Root\InventoryApplicationFile\winsat.exe|
    TargetObject|endswith: \LowerCaseLongPath
falsepositives:
- Unknown
id: 6597be7b-ac61-4ac8-bef4-d3ec88174853
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Abusing Winsat Path Parsing - Registry
