author: frack113
date: 2022/08/19
description: Detect set UseActionCenterExperience to 0 to disable the Windows security
  center notification
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|endswith: Windows\CurrentVersion\ImmersiveShell\UseActionCenterExperience
falsepositives:
- Unknown
id: 3ae1a046-f7db-439d-b7ce-b8b366b81fa6
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Disable Windows Security Center Notifications
