author: D3F7A5105
date: 2023/01/02
description: Detects tampering with EventLog service "file" key. In order to change
  the default location of an Evtx file. This technique is used to tamper with log
  collection and alerting
detection:
  condition: selection and not filter
  filter:
    Details|contains: \System32\Winevt\Logs\
  selection:
    TargetObject|contains: \SYSTEM\CurrentControlSet\Services\EventLog\
    TargetObject|endswith: \File
falsepositives:
- Unknown
id: 0cb8d736-995d-4ce7-a31e-1e8d452a1459
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://learn.microsoft.com/en-us/windows/win32/eventlog/eventlog-key
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002
title: Potential EventLog File Location Tampering
