author: frack113
date: 2022/08/19
description: Detect set DisallowRun to 1 to prevent user running specific computer
  program
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: Software\Microsoft\Windows\CurrentVersion\Policies\Explorer\DisallowRun
falsepositives:
- Unknown
id: 275641a5-a492-45e2-a817-7c81e9d9d3e9
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Add DisallowRun Execution to Registry
