author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/09
description: Detects changes to the "TracingDisabled" key in order to disable ETW
  logging for services.exe (SCM)
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: Software\Microsoft\Windows NT\CurrentVersion\Tracing\SCM\Regular\TracingDisabled
falsepositives:
- Unknown
id: 4f281b83-0200-4b34-bf35-d24687ea57c2
level: low
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
title: ETW Logging Disabled For SCM
