author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/16
description: Detects setting of a new registry value related to BgInfo configuration,
  which can be abused to execute custom VBScript via "BgInfo.exe"
detection:
  condition: selection
  selection:
    Details|startswith: '4'
    EventType: SetValue
    TargetObject|contains: \Software\Winternals\BGInfo\UserFields\
falsepositives:
- Legitimate VBScript
id: 992dd79f-dde8-4bb0-9085-6350ba97cfb3
level: medium
logsource:
  category: registry_set
  product: windows
references:
- Internal Research
related:
- id: cd277474-5c52-4423-a52b-ac2d7969902f
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: New BgInfo.EXE Custom VBScript Registry Configuration
