author: Florian Roth (Nextron Systems), oscd.community
date: 2018/07/18
description: Detects a possible persistence mechanism using RUN key for Windows Explorer
  and pointing to a suspicious folder
detection:
  condition: selection
  selection:
    Details|contains:
    - :\$Recycle.bin\
    - :\ProgramData\
    - :\Temp\
    - :\Users\Default\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    TargetObject|endswith: \Microsoft\Windows\CurrentVersion\Policies\Explorer\Run
falsepositives:
- Unknown
id: b7916c2a-fa2f-4795-9477-32b731f70f11
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/12/11
references:
- https://researchcenter.paloaltonetworks.com/2018/07/unit42-upatre-continues-evolve-new-anti-analysis-techniques/
status: test
tags:
- attack.persistence
- attack.t1547.001
title: Registry Persistence via Explorer Run Key
