author: CD_R0M_
date: 2022/06/11
description: Detects the abuse of custom file open handler, executing powershell
detection:
  condition: selection
  selection:
    Details|contains|all:
    - powershell
    - -command
    TargetObject|contains: shell\open\command\
falsepositives:
- Unknown
id: 7530b96f-ad8e-431d-a04d-ac85cc461fdc
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://news.sophos.com/en-us/2022/02/01/solarmarker-campaign-used-novel-registry-changes-to-establish-persistence/?cmp=30728
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Custom File Open Handler Executes PowerShell
