author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/12
description: Detects when the enablement of developer features such as "Developer
  Mode" or "Application Sideloading". Which allows the user to install untrusted packages.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|contains:
    - \Microsoft\Windows\CurrentVersion\AppModelUnlock
    - \Policies\Microsoft\Windows\Appx\
    TargetObject|endswith:
    - \AllowAllTrustedApps
    - \AllowDevelopmentWithoutDevLicense
falsepositives:
- Unknown
id: b110ebaf-697f-4da1-afd5-b536fa27a2c1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://twitter.com/malmoeb/status/1560536653709598721
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
related:
- id: a383dec4-deec-4e6e-913b-ed9249670848
  type: similar
status: experimental
tags:
- attack.defense_evasion
title: Potential Signing Bypass Via Windows Developer Features - Registry
