author: X__Junior (Nextron Systems)
date: 2023/11/21
description: 'Detects usage of Windows Input Method Editor (IME) keyboard layout feature,
  which allows an attacker to load a DLL into the process after sending the WM_INPUTLANGCHANGEREQUEST
  message.

  Before doing this, the client needs to register the DLL in a special registry key
  that is assumed to implement this keyboard layout. This registry key should store
  a value named "Ime File" with a DLL path.

  IMEs are essential for languages that have more characters than can be represented
  on a standard keyboard, such as Chinese, Japanese, and Korean.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_known_extension:
    Details|endswith: .ime
  selection:
    TargetObject|contains|all:
    - \Control\Keyboard Layouts\
    - Ime File
falsepositives:
- IMEs are essential for languages that have more characters than can be represented
  on a standard keyboard, such as Chinese, Japanese, and Korean.
id: b888e3f2-224d-4435-b00b-9dd66e9ea1f1
level: high
logsource:
  category: registry_set
  product: windows
references:
- https://www.linkedin.com/pulse/guntior-story-advanced-bootkit-doesnt-rely-windows-disk-baranov-wue8e/
related:
- id: 9d8f9bb8-01af-4e15-a3a2-349071530530
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Uncommon Extension In Keyboard Layout IME File Registry Value
