author: Wojciech Lesicki
date: 2021/06/29
description: 'Detects known malicious service installs that appear in cases in which
  a Cobalt Strike beacon elevates privileges or lateral movement.

  '
detection:
  condition: all of selection_*
  selection_details:
  - Details|contains|all:
    - ADMIN$
    - .exe
  - Details|contains|all:
    - '%COMSPEC%'
    - start
    - powershell
  selection_key:
  - TargetObject|contains: \System\CurrentControlSet\Services
  - TargetObject|contains|all:
    - \System\ControlSet
    - \Services
falsepositives:
- Unlikely
id: 61a7697c-cb79-42a8-a2ff-5f0cdfae0130
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024/03/25
references:
- https://www.sans.org/webcasts/tech-tuesday-workshop-cobalt-strike-detection-log-analysis-119395
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.lateral_movement
- attack.t1021.002
- attack.t1543.003
- attack.t1569.002
title: Potential CobaltStrike Service Installations - Registry
