author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects that a powershell code is written to the registry as a service.
detection:
  condition: selection
  selection:
    Details|contains:
    - powershell
    - pwsh
    TargetObject|contains: \Services\
    TargetObject|endswith: \ImagePath
falsepositives:
- Unknown
id: 4a5f5a5e-ac01-474b-9b4e-d61298c9df1d
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: test
tags:
- attack.execution
- attack.t1569.002
title: PowerShell as a Service in Registry
