author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/09/05
description: Detects applications or users re-enabling old TLS versions by setting
  the "Enabled" value to "1" for the "Protocols" registry key.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|contains:
    - \Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.0\
    - \Control\SecurityProviders\SCHANNEL\Protocols\TLS 1.1\
    TargetObject|endswith: \Enabled
falsepositives:
- Legitimate enabling of the old tls versions due to incompatibility
id: 439957a7-ad86-4a8f-9705-a28131c6821b
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://techcommunity.microsoft.com/t5/windows-it-pro-blog/tls-1-0-and-tls-1-1-soon-to-be-disabled-in-windows/ba-p/3887947
status: experimental
tags:
- attack.defense_evasion
title: Old TLS1.0/TLS1.1 Protocol Version Enabled
