author: frack113
date: 2022/04/04
description: Detects the modification of the registry to disable a system restore
  on the computer
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|contains:
    - \Policies\Microsoft\Windows NT\SystemRestore
    - \Microsoft\Windows NT\CurrentVersion\SystemRestore
    TargetObject|endswith:
    - DisableConfig
    - DisableSR
falsepositives:
- Unknown
id: 5de03871-5d46-4539-a82d-3aa992a69a83
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-9---disable-system-restore-through-registry
status: experimental
tags:
- attack.impact
- attack.t1490
title: Registry Disable System Restore
