author: Omer Yampel, Christian Burkard (Nextron Systems)
date: 2017/03/17
description: Detects the pattern of UAC Bypass using registry key manipulation of
  sdclt.exe (e.g. UACMe 53)
detection:
  condition: 1 of selection*
  selection1:
    TargetObject|endswith: Software\Classes\exefile\shell\runas\command\isolatedCommand
  selection2:
    Details|re: -1[0-9]{3}\\Software\\Classes\\
    TargetObject|endswith: Software\Classes\Folder\shell\open\command\SymbolicLinkValue
falsepositives:
- Unknown
id: 5b872a46-3b90-45c1-8419-f675db8053aa
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://enigma0x3.net/2017/03/17/fileless-uac-bypass-using-sdclt-exe/
- https://github.com/hfiref0x/UACME
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
- car.2019-04-001
title: UAC Bypass via Sdclt
