author: Jose Luis Sanchez Martinez (@Joseliyo_Jstnk)
date: 2022/05/04
description: Detects registry key established after masqueraded .scr file execution
  using Rundll32 through desk.cpl
detection:
  condition: selection and registry and not filter
  filter:
    Details|contains:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  registry:
    Details|endswith: .scr
    TargetObject|contains: \Control Panel\Desktop\SCRNSAVE.EXE
  selection:
    Image|endswith: \rundll32.exe
falsepositives:
- Legitimate use of screen saver
id: 40b6e656-4e11-4c0c-8772-c1cc6dae34ce
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://twitter.com/VakninHai/status/1517027824984547329
- https://twitter.com/pabraeken/status/998627081360695297
- https://jstnk9.github.io/jstnk9/research/InstallScreenSaver-SCR-files
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: ScreenSaver Registry Key Set
