author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/01
description: Detects tampering with autologger trace sessions which is a technique
  used by attackers to disable logging
detection:
  condition: all of selection_* and not 1 of filter_*
  filter_wevtutil:
    Image: C:\Windows\system32\wevtutil.exe
  selection_main:
    TargetObject|contains: \System\CurrentControlSet\Control\WMI\Autologger\
  selection_values:
    Details: DWORD (0x00000000)
    TargetObject|contains:
    - \EventLog-
    - \Defender
    TargetObject|endswith:
    - \Enable
    - \Start
falsepositives:
- Unknown
id: f37b4bce-49d0-4087-9f5b-58bffda77316
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
- https://i.blackhat.com/EU-21/Wednesday/EU-21-Teodorescu-Veni-No-Vidi-No-Vici-Attacks-On-ETW-Blind-EDRs.pdf
status: experimental
tags:
- attack.defense_evasion
title: Potential AutoLogger Sessions Tampering
