author: Victor Sergeev, Daniil Yugoslavskiy, Gleb Sukhodolskiy, Timur Zinniatullin,
  oscd.community, Tim Shelton, frack113 (split)
date: 2019/10/25
description: Detects modification of autostart extensibility point (ASEP) in registry.
detection:
  condition: nt_current_version_base and nt_current_version and not 1 of filter_*
  filter_edge:
    Image|endswith: \MicrosoftEdgeUpdate.exe
    Image|startswith: C:\Program Files (x86)\Microsoft\Temp\
  filter_empty:
    Details: (Empty)
  filter_legitimate_subkey:
    TargetObject|contains: \Image File Execution Options\
    TargetObject|endswith:
    - \DisableExceptionChainValidation
    - \MitigationOptions
  filter_msoffice:
  - TargetObject|contains:
    - \ClickToRunStore\HKLM\SOFTWARE\Microsoft\Windows NT\CurrentVersion\
    - \ClickToRun\REGISTRY\MACHINE\Software\Microsoft\Windows NT\CurrentVersion\
  - Image:
    - C:\Program Files\Microsoft Office\root\integration\integrator.exe
    - C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  filter_ngen:
    Image|endswith: \ngen.exe
    Image|startswith: C:\Windows\Microsoft.NET\Framework
  filter_officeclicktorun:
    Image|endswith: \OfficeClickToRun.exe
    Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  filter_onedrive:
    Details|endswith: \AppData\Local\Microsoft\OneDrive\Update\OneDriveSetup.exe"
    Details|startswith: C:\Windows\system32\cmd.exe /q /c del /q "C:\Users\
    Image|endswith: \AppData\Local\Microsoft\OneDrive\StandaloneUpdater\OneDriveSetup.exe
    TargetObject|endswith: \Microsoft\Windows\CurrentVersion\RunOnce\Delete Cached
      Update Binary
  filter_security_extension_dc:
    Details:
    - DWORD (0x00000009)
    - DWORD (0x000003c0)
    Image: C:\Windows\system32\svchost.exe
    TargetObject|contains:
    - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\PreviousPolicyAreas
    - \Winlogon\GPExtensions\{827D319E-6EAC-11D2-A4EA-00C04F79F83A}\MaxNoGPOListChangesInterval
  nt_current_version:
    TargetObject|contains:
    - \Winlogon\VmApplet
    - \Winlogon\Userinit
    - \Winlogon\Taskman
    - \Winlogon\Shell
    - \Winlogon\GpExtensions
    - \Winlogon\AppSetup
    - \Winlogon\AlternateShells\AvailableShells
    - \Windows\IconServiceLib
    - \Windows\Appinit_Dlls
    - \Image File Execution Options
    - \Font Drivers
    - \Drivers32
    - \Windows\Run
    - \Windows\Load
  nt_current_version_base:
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion
falsepositives:
- Legitimate software automatically (mostly, during installation) sets up autorun
  keys for legitimate reason
- Legitimate administrator sets up autorun keys for legitimate reason
fields:
- SecurityID
- ObjectName
- OldValueType
- NewValueType
id: cbf93e5d-ca6c-4722-8bea-e9119007c248
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.001/T1547.001.md
- https://docs.microsoft.com/en-us/sysinternals/downloads/autoruns
- https://gist.github.com/GlebSukhodolskiy/0fc5fa5f482903064b448890db1eaf9d
related:
- id: 17f878b8-9968-4578-b814-c4217fc5768c
  type: obsoletes
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: CurrentVersion NT Autorun Keys Modification
