author: frack113
date: 2022/06/19
description: 'Detects processes setting a new DLL in DllName in under HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Services\W32Time\TimeProvider.

  Adversaries may abuse time providers to execute DLLs when the system boots.

  The Windows Time service (W32Time) enables time synchronization across and within
  domains.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_w32time:
    Details:
    - '%SystemRoot%\System32\vmictimeprovider.dll'
    - '%systemroot%\system32\w32time.dll'
    - C:\Windows\SYSTEM32\w32time.DLL
  selection:
    TargetObject|contains: \Services\W32Time\TimeProviders
    TargetObject|endswith: \DllName
falsepositives:
- Unknown
id: e88a6ddc-74f7-463b-9b26-f69fc0d2ce85
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.003/T1547.003.md
status: experimental
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1547.003
title: New TimeProviders Registered With Uncommon DLL Name
