author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/16
description: 'Detects changes to the Internet Explorer "DisableFirstRunCustomize"
  value, which prevents Internet Explorer from running the first run wizard the first
  time a user starts the browser after installing Internet Explorer or Windows.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    Image:
    - C:\Windows\explorer.exe
    - C:\Windows\System32\ie4uinit.exe
  selection:
    Details:
    - DWORD (0x00000001)
    - DWORD (0x00000002)
    TargetObject|endswith: \Microsoft\Internet Explorer\Main\DisableFirstRunCustomize
falsepositives:
- As this is controlled by group policy as well as user settings. Some false positives
  may occur.
id: ab567429-1dfb-4674-b6d2-979fd2f9d125
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://www.ncsc.gov.uk/static-assets/documents/malware-analysis-reports/devil-bait/NCSC-MAR-Devil-Bait.pdf
- https://unit42.paloaltonetworks.com/operation-ke3chang-resurfaces-with-new-tidepool-malware/
- https://admx.help/?Category=InternetExplorer&Policy=Microsoft.Policies.InternetExplorer::NoFirstRunCustomise
status: experimental
tags:
- attack.defense_evasion
title: Internet Explorer DisableFirstRunCustomize Enabled
