author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/03/06
description: Detects potentially suspicious changes to the SentinelOne context menu
  scan command by a process other than SentinelOne.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_sentinelone_binary:
    Image|endswith:
    - C:\Program Files\SentinelOne\
    - C:\Program Files (x86)\SentinelOne\
  filter_main_sentinelone_default_scan_binary:
    Details|contains: \SentinelScanFromContextMenu.exe
    Details|startswith:
    - C:\Program Files\SentinelOne\Sentinel Agent
    - C:\Program Files (x86)\SentinelOne\Sentinel Agent
  selection:
    TargetObject|contains: \shell\SentinelOneScan\command\
falsepositives:
- Unknown
id: 6c304b02-06e6-402d-8be4-d5833cdf8198
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://mrd0x.com/sentinelone-persistence-via-menu-context/
status: experimental
tags:
- attack.persistence
title: Potential SentinelOne Shell Context Menu Scan Command Tampering
