author: frack113
date: 2022/07/17
description: Detect possible persistence using Fax DLL load when service restart
detection:
  condition: selection and not filter
  filter:
    Details: '%systemroot%\system32\fxst30.dll'
  selection:
    TargetObject|contains|all:
    - \Software\Microsoft\Fax\Device Providers\
    - \ImageName
falsepositives:
- Unknown
id: 9e3357ba-09d4-4fbd-a7c5-ad6386314513
level: high
logsource:
  category: registry_set
  product: windows
modified: 2022/12/30
references:
- https://twitter.com/dottor_morte/status/1544652325570191361
- https://raw.githubusercontent.com/RiccardoAncarani/talks/master/F-Secure/unorthodox-lateral-movement.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Change the Fax Dll
