author: frack113
date: 2022/08/19
description: Detect set Notification_Suppress to 1 to disable the Windows security
  center notification
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: SOFTWARE\Policies\Microsoft\Windows Defender\UX Configuration\Notification_Suppress
falsepositives:
- Unknown
id: 0c93308a-3f1b-40a9-b649-57ea1a1c1d63
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1112/T1112.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Activate Suppression of Windows Security Center Notifications
