author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/20
description: Detects the creation of user-specific or system-wide environment variables
  via the registry. Which contains suspicious commands and strings
detection:
  condition: all of selection_*
  selection_details:
  - Details:
    - powershell
    - pwsh
  - Details|contains:
    - \AppData\Local\Temp\
    - C:\Users\Public\
    - TVqQAAMAAAAEAAAA
    - TVpQAAIAAAAEAA8A
    - TVqAAAEAAAAEABAA
    - TVoAAAAAAAAAAAAA
    - TVpTAQEAAAAEAAAA
    - SW52b2tlL
    - ludm9rZS
    - JbnZva2Ut
    - SQBuAHYAbwBrAGUALQ
    - kAbgB2AG8AawBlAC0A
    - JAG4AdgBvAGsAZQAtA
  - Details|startswith:
    - SUVY
    - SQBFAF
    - SQBuAH
    - cwBhA
    - aWV4
    - aQBlA
    - R2V0
    - dmFy
    - dgBhA
    - dXNpbm
    - H4sIA
    - Y21k
    - cABhAH
    - Qzpc
    - Yzpc
  selection_main:
    TargetObject|contains: \Environment\
falsepositives:
- Unknown
id: 966315ef-c5e1-4767-ba25-fce9c8de3660
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://infosec.exchange/@sbousseaden/109542254124022664
status: test
tags:
- attack.defense_evasion
- attack.persistence
title: Suspicious Environment Variable Has Been Registered
