author: xknow (@xknow_infosec), xorxes (@xor_xes)
date: 2019/04/08
description: 'Detects installation of NalDrv or PROCEXP152 services via registry-keys
  to non-system32 folders.

  Both services are used in the tool Ghost-In-The-Logs (https://github.com/bats3c/Ghost-In-The-Logs),
  which uses KDU (https://github.com/hfiref0x/KDU)

  '
detection:
  condition: selection and not filter
  filter:
    Details|contains: \WINDOWS\system32\Drivers\PROCEXP152.SYS
    Image|endswith:
    - \procexp64.exe
    - \procexp.exe
    - \procmon64.exe
    - \procmon.exe
    - \handle.exe
    - \handle64.exe
  selection:
    TargetObject:
    - HKLM\System\CurrentControlSet\Services\NalDrv\ImagePath
    - HKLM\System\CurrentControlSet\Services\PROCEXP152\ImagePath
falsepositives:
- Other legimate tools using this service names and drivers. Note - clever attackers
  may easily bypass this detection by just renaming the services. Therefore just Medium-level
  and don't rely on it.
id: f2485272-a156-4773-82d7-1d178bc4905b
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://web.archive.org/web/20200419024230/https://blog.dylan.codes/evading-sysmon-and-windows-event-logging/
status: test
tags:
- attack.t1562.001
- attack.defense_evasion
title: Suspicious Service Installed
