author: frack113
date: 2022/01/16
description: Administrative shares are hidden network shares created by Microsoft
  Windows NT operating systems that grant system administrators remote access to every
  disk volume on a network-connected system
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|contains: \Services\LanmanServer\Parameters\
    TargetObject|endswith:
    - \AutoShareWks
    - \AutoShareServer
falsepositives:
- Unknown
id: c7dcacd0-cc59-4004-b0a4-1d6cdebe6f3e
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2024/03/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1070.005/T1070.005.md#atomic-test-4---disable-administrative-share-creation-at-startup
status: test
tags:
- attack.defense_evasion
- attack.t1070.005
title: Disable Administrative Share Creation at Startup
