author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/01/01
description: 'Detects the setting of the REGISTERAPPRESTART compatibility layer on
  an application.

  This compatibility layer allows an application to register for restart using the
  "RegisterApplicationRestart" API.

  This can be potentially abused as a persistence mechanism.

  '
detection:
  condition: selection
  selection:
    Details|contains: REGISTERAPPRESTART
    TargetObject|contains: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Layers\
falsepositives:
- Legitimate applications making use of this feature for compatibility reasons
id: b86852fb-4c77-48f9-8519-eb1b2c308b59
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://github.com/nasbench/Misc-Research/blob/d114d6a5e0a437d3818e492ef9864367152543e7/Other/Persistence-Via-RegisterAppRestart-Shim.md
status: experimental
tags:
- attack.persistence
- attack.t1546.011
title: Potential Persistence Via AppCompat RegisterAppRestart Layer
