author: frack113
date: 2021/12/30
description: 'Adversaries may use port monitors to run an attacker supplied DLL during
  system boot for persistence or privilege escalation.

  A port monitor can be set through the AddMonitor API call to set a DLL to be loaded
  at startup.

  '
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_cutepdf:
    Details: cpwmon64_v40.dll
    Image: C:\Windows\System32\spoolsv.exe
    TargetObject|contains: \Control\Print\Monitors\CutePDF Writer Monitor v4.0\Driver
    User|contains:
    - AUTHORI
    - AUTORI
  filter_optional_monvnc:
    TargetObject|contains: \Control\Print\Monitors\MONVNC\Driver
  filter_optional_vnc:
    TargetObject|contains|all:
    - Control\Print\Environments\
    - \Drivers\
    - \VNC Printer
  selection:
    Details|endswith: .dll
    TargetObject|contains: \Control\Print\Monitors\
falsepositives:
- Unknown
id: 944e8941-f6f6-4ee8-ac05-1c224e923c0e
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2024/03/25
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1547.010/T1547.010.md
status: experimental
tags:
- attack.persistence
- attack.t1547.010
title: Add Port Monitor Persistence in Registry
