author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021/06/08
description: Detects changes to Microsoft Office protected view registry keys with
  which the attacker disables this feature.
detection:
  condition: selection_path and 1 of selection_values_*
  selection_path:
    TargetObject|contains|all:
    - \SOFTWARE\Microsoft\Office\
    - \Security\ProtectedView\
  selection_values_0:
    Details: DWORD (0x00000000)
    TargetObject|endswith:
    - \enabledatabasefileprotectedview
    - \enableforeigntextfileprotectedview
  selection_values_1:
    Details: DWORD (0x00000001)
    TargetObject|endswith:
    - \DisableAttachementsInPV
    - \DisableInternetFilesInPV
    - \DisableIntranetCheck
    - \DisableUnsafeLocationsInPV
falsepositives:
- Unlikely
id: a5c7a43f-6009-4a8c-80c5-32abf1c53ecc
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md
- https://unit42.paloaltonetworks.com/unit42-gorgon-group-slithering-nation-state-cybercrime/
- https://yoroi.company/research/cyber-criminal-espionage-operation-insists-on-italian-manufacturing/
- https://admx.help/HKCU/software/policies/microsoft/office/16.0/excel/security/protectedview
related:
- id: 7c637634-c95d-4bbf-b26c-a82510874b34
  type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Microsoft Office Protected View Disabled
