author: frack113
date: 2022/09/17
description: Detects tampering with the "ChannelAccess" registry key in order to change
  access to Windows event channel.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_tiworker:
    Image|endswith: \TiWorker.exe
    Image|startswith: C:\Windows\WinSxS\
  filter_main_trustedinstaller:
    Image: C:\Windows\servicing\TrustedInstaller.exe
  selection:
    Details|contains:
    - (A;;0x1;;;LA)
    - (A;;0x1;;;SY)
    - (A;;0x5;;;BA)
    TargetObject|contains: \Microsoft\Windows\CurrentVersion\WINEVT\Channels\
    TargetObject|endswith: \ChannelAccess
falsepositives:
- Unknown
id: 7d9263bd-dc47-4a58-bc92-5474abab390c
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024/03/25
references:
- https://app.any.run/tasks/77b2e328-8f36-46b2-b2e2-8a80398217ab/
- https://learn.microsoft.com/en-us/windows/win32/api/winevt/
- https://itconnect.uw.edu/tools-services-support/it-systems-infrastructure/msinf/other-help/understanding-sddl-syntax/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.002
title: Change Winevt Channel Access Permission Via Registry
