author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/09
description: Detects changes to the "ExtErrorInformation" key in order to disable
  ETW logging for rpcrt4.dll
detection:
  condition: selection
  selection:
    Details:
    - DWORD (0x00000000)
    - DWORD (0x00000002)
    TargetObject|endswith: \Microsoft\Windows NT\Rpc\ExtErrorInformation
falsepositives:
- Unknown
id: 90f342e1-1aaa-4e43-b092-39fda57ed11e
level: low
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- http://redplait.blogspot.com/2020/07/whats-wrong-with-etw.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
- attack.t1562
title: ETW Logging Disabled For rpcrt4.dll
