author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/17
description: Detects potential registry persistence technique using the Event Viewer
  "Events.asp" technique
detection:
  condition: selection and not 1 of filter_*
  filter_cleaner:
    Details: (Empty)
  filter_default_redirect_program:
    Details: '%%SystemRoot%%\PCHealth\HelpCtr\Binaries\HelpCtr.exe'
    Image|endswith: C:\WINDOWS\system32\svchost.exe
    TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram
  filter_default_redirect_program_cli:
    Details: -url hcp://services/centers/support?topic=%%s
    Image|endswith: C:\WINDOWS\system32\svchost.exe
    TargetObject|endswith: \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgramCommandLineParameters
  filter_url:
    Details: http://go.microsoft.com/fwlink/events.asp
  selection:
    TargetObject|contains:
    - \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionProgram
    - \Microsoft\Windows NT\CurrentVersion\Event Viewer\MicrosoftRedirectionURL
falsepositives:
- Unknown
id: a1e11042-a74a-46e6-b07c-c4ce8ecc239b
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/03/05
references:
- https://twitter.com/nas_bench/status/1626648985824788480
- https://admx.help/?Category=Windows_7_2008R2&Policy=Microsoft.Policies.InternetCommunicationManagement::EventViewer_DisableLinks
- https://www.hexacorn.com/blog/2019/02/15/beyond-good-ol-run-key-part-103/
- https://github.com/redcanaryco/atomic-red-team/blob/f296668303c29d3f4c07e42bdd2b28d8dd6625f9/atomics/T1112/T1112.md
status: test
tags:
- attack.persistence
- attack.defense_evasion
- attack.t1112
title: Potential Persistence Via Event Viewer Events.asp
