author: '@ScoubiMtl'
date: 2021/04/05
description: Detects the modification of Outlook security setting to allow unprompted
  execution of macros.
detection:
  condition: selection
  selection:
    Details|contains: '0x00000001'
    TargetObject|endswith: \Outlook\Security\Level
falsepositives:
- Unlikely
id: e3b50fa5-3c3f-444e-937b-0a99d33731cd
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://www.mdsec.co.uk/2020/11/a-fresh-outlook-on-mail-based-persistence/
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
status: test
tags:
- attack.persistence
- attack.command_and_control
- attack.t1137
- attack.t1008
- attack.t1546
title: Outlook Macro Execution Without Warning Setting Enabled
