author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/30
description: Detects potential persistence activity via the registering of a new custom
  protocole handlers. While legitimate applications register protocole handlers often
  times during installation. And attacker can abuse this by setting a custom handler
  to be used as a persistence mechanism.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic_locations:
    Image|startswith:
    - C:\Program Files (x86)
    - C:\Program Files\
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  filter_main_ms_trusted:
    Details|startswith: URL:ms-
  selection:
    Details|startswith: 'URL:'
    TargetObject|startswith: HKCR\
falsepositives:
- Many legitimate applications can register a new custom protocol handler. Additional
  filters needs to applied according to your environment.
id: fdbf0b9d-0182-4c43-893b-a1eaab92d085
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/05/12
references:
- https://ladydebug.com/blog/2019/06/21/custom-protocol-handler-cph/
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Potential Persistence Via Custom Protocol Handler
