author: Austin Songer @austinsonger
date: 2021/08/04
description: Detects disabling Windows Defender Tamper Protection
detection:
  condition: selection and not 1 of filter_*
  filter_msmpeng_client:
    Image|endswith: \MsMpEng.exe
    Image|startswith: C:\ProgramData\Microsoft\Windows Defender\Platform\
  filter_msmpeng_domain_controller:
    Image: C:\Program Files\Windows Defender\MsMpEng.exe
  selection:
    Details: DWORD (0x00000000)
    TargetObject|contains: \Microsoft\Windows Defender\Features\TamperProtection
falsepositives:
- Unknown
id: 93d298a1-d28f-47f1-a468-d971e7796679
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://www.tenforums.com/tutorials/123792-turn-off-tamper-protection-microsoft-defender-antivirus.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Disable Tamper Protection on Windows Defender
