author: Nasreddine Bencherchali (Nextron Systems)
date: 2021/04/05
description: Detects the modification of Outlook setting "LoadMacroProviderOnBoot"
  which if enabled allows the automatic loading of any configured VBA project/module
detection:
  condition: selection
  selection:
    Details|contains: '0x00000001'
    TargetObject|endswith: \Outlook\LoadMacroProviderOnBoot
falsepositives:
- Unknown
id: 396ae3eb-4174-4b9b-880e-dc0364d78a19
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=53
- https://www.linkedin.com/pulse/outlook-backdoor-using-vba-samir-b-/
status: experimental
tags:
- attack.persistence
- attack.command_and_control
- attack.t1137
- attack.t1008
- attack.t1546
title: Potential Persistence Via Outlook LoadMacroProviderOnBoot Setting
