author: frack113
date: 2022/12/11
description: Detect changes to the "LegalNoticeCaption" or "LegalNoticeText" registry
  values where the message set contains keywords often used in ransomware ransom messages
detection:
  condition: selection
  selection:
    Details|contains:
    - encrypted
    - Unlock-Password
    - paying
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeCaption
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Policies\System\LegalNoticeText
falsepositives:
- Unknown
id: 8b9606c9-28be-4a38-b146-0e313cc232c1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/5c1e6f1b4fafd01c8d1ece85f510160fc1275fbf/atomics/T1491.001/T1491.001.md
status: experimental
tags:
- attack.impact
- attack.t1491.001
title: Potential Ransomware Activity Using LegalNotice Message
