author: Christian Burkard (Nextron Systems)
date: 2021/08/23
description: Detects the pattern of UAC Bypass using Windows Media Player osksupport.dll
  (UACMe 32)
detection:
  condition: selection
  selection:
    Details: Binary Data
    TargetObject|endswith: \SOFTWARE\Microsoft\Windows NT\CurrentVersion\AppCompatFlags\Compatibility
      Assistant\Store\C:\Program Files\Windows Media Player\osk.exe
falsepositives:
- Unknown
id: 5f9db380-ea57-4d1e-beab-8a2d33397e93
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/hfiref0x/UACME
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1548.002
title: UAC Bypass Using Windows Media Player - Registry
