author: Florian Roth (Nextron Systems)
date: 2021/03/05
description: Detects VBScript content stored into registry keys as seen being used
  by UNC2452 group
detection:
  condition: selection and not 1 of filter*
  filter:
    TargetObject|contains: Software\Microsoft\Windows\CurrentVersion\Run
  filter_dotnet:
    Details|contains:
    - \Microsoft.NET\Primary Interop Assemblies\Microsoft.mshtml.dll
    - <\Microsoft.mshtml,fileVersion=
    - _mshtml_dll_
    - <\Microsoft.mshtml,culture=
    Image|endswith: \msiexec.exe
    TargetObject|contains: \SOFTWARE\Microsoft\Windows\CurrentVersion\Installer\UserData\
  selection:
    Details|contains:
    - 'vbscript:'
    - 'jscript:'
    - mshtml,
    - RunHTMLApplication
    - Execute(
    - CreateObject
    - window.close
    TargetObject|contains: Software\Microsoft\Windows\CurrentVersion
falsepositives:
- Unknown
id: 46490193-1b22-4c29-bdd6-5bf63907216f
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://www.microsoft.com/security/blog/2021/03/04/goldmax-goldfinder-sibot-analyzing-nobelium-malware/
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: VBScript Payload Stored in Registry
