author: frack113
date: 2022/08/19
description: Detect set EnableFirewall to 0 to disable the Windows firewall
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|endswith:
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\StandardProfile\EnableFirewall
    - \SOFTWARE\Policies\Microsoft\WindowsFirewall\DomainProfile\EnableFirewall
falsepositives:
- Unknown
id: e78c408a-e2ea-43cd-b5ea-51975cf358c0
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1562.004/T1562.004.md
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Disable Windows Firewall by Registry
