author: frack113
date: 2022/08/20
description: Detect use of scrobj.dll as this DLL looks for the ScriptletURL key to
  get the location of the script to execute
detection:
  condition: selection
  selection:
    Details: C:\WINDOWS\system32\scrobj.dll
    TargetObject|endswith: InprocServer32\(Default)
falsepositives:
- Legitimate use of the dll.
id: fe20dda1-6f37-4379-bbe0-a98d400cae90
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1546.015/T1546.015.md
status: experimental
tags:
- attack.persistence
- attack.t1546.015
title: Potential Persistence Via Scrobj.dll COM Hijacking
