author: Tobias Michalski (Nextron Systems)
date: 2021/06/10
description: Detects potential persistence activity via outlook today pages. An attacker
  can set a custom page to execute arbitrary code and link to it via the registry
  key "UserDefinedUrl".
detection:
  condition: selection_main and 1 of selection_value_* and not 1 of filter_*
  filter_office:
    Image|endswith: \OfficeClickToRun.exe
    Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  selection_main:
    TargetObject|contains|all:
    - Software\Microsoft\Office\
    - \Outlook\Today\
  selection_value_stamp:
    Details: DWORD (0x00000001)
    TargetObject|endswith: Stamp
  selection_value_user_defined:
    TargetObject|endswith: UserDefinedUrl
falsepositives:
- Unknown
fields:
- Details
id: 487bb375-12ef-41f6-baae-c6a1572b4dd1
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://speakerdeck.com/heirhabarov/hunting-for-persistence-via-microsoft-exchange-server-or-outlook?slide=74
status: experimental
tags:
- attack.persistence
- attack.t1112
title: Potential Persistence Via Outlook Today Pages
