author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/02
description: Detects tamper attempts to sophos av functionality via registry key modification
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|contains:
    - \Sophos Endpoint Defense\TamperProtection\Config\SAVEnabled
    - \Sophos Endpoint Defense\TamperProtection\Config\SEDEnabled
    - \Sophos\SAVService\TamperProtection\Enabled
falsepositives:
- Some FP may occur when the feature is disabled by the AV itself, you should always
  investigate if the action was legitimate
id: 9f4662ac-17ca-43aa-8f12-5d7b989d0101
level: high
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://redacted.com/blog/bianlian-ransomware-gang-gives-it-a-go/
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Tamper With Sophos AV Registry Keys
