author: frack113
date: 2022/01/22
description: Hides the file extension through modification of the registry
detection:
  condition: 1 of selection_*
  selection_Hidden:
    Details: DWORD (0x00000002)
    TargetObject|endswith: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\Hidden
  selection_HideFileExt:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced\HideFileExt
falsepositives:
- Administrative scripts
id: 5df86130-4e95-4a54-90f7-26541b40aec2
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-1---modify-registry-of-current-user-profile---cmd
- https://unit42.paloaltonetworks.com/ransomware-families/
- https://www.microsoft.com/en-us/wdsi/threats/malware-encyclopedia-description?name=TrojanSpy%3aMSIL%2fHakey.A
status: test
tags:
- attack.persistence
- attack.t1137
title: Registry Modification to Hidden File Extension
