author: Florian Roth (Nextron Systems), Markus Neis, Sander Wiebing
date: 2018/08/25
description: Detects suspicious new RUN key element pointing to an executable in a
  suspicious folder
detection:
  condition: all of selection_* and not 1 of filter_main_*
  filter_main_windows_update:
    Details|contains|all:
    - rundll32.exe C:\WINDOWS\system32\advpack.dll,DelNodeRunDLL32
    - C:\Windows\Temp\
    Image|startswith: C:\Windows\SoftwareDistribution\Download\
  selection_details:
  - Details|contains:
    - :\$Recycle.bin\
    - :\Temp\
    - :\Users\Default\
    - :\Users\Desktop\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    - '%temp%\'
    - '%tmp%\'
  - Details|startswith:
    - '%Public%\'
    - wscript
    - cscript
  selection_target:
    TargetObject|contains:
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\Run\
    - \SOFTWARE\Microsoft\Windows\CurrentVersion\RunOnce\
falsepositives:
- Software using weird folders for updates
id: 02ee49e2-e294-4d0f-9278-f5b3212fc588
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024/03/18
references:
- https://www.fireeye.com/blog/threat-research/2018/08/fin7-pursuing-an-enigmatic-and-evasive-global-criminal-operation.html
status: experimental
tags:
- attack.persistence
- attack.t1547.001
title: New RUN Key Pointing to Suspicious Folder
