author: frack113
date: 2022/04/02
description: 'Detects modifications to the "Hidden" and "ShowSuperHidden" explorer
  registry values in order to disable showing of hidden files and system files.

  This technique is abused by several malware families to hide their files from normal
  users.

  '
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000000)
    TargetObject|endswith:
    - \Microsoft\Windows\CurrentVersion\Explorer\Advanced\ShowSuperHidden
    - \Microsoft\Windows\CurrentVersion\Explorer\Advanced\Hidden
falsepositives:
- Unknown
id: 5a5152f1-463f-436b-b2f5-8eceb3964b42
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2024/03/26
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1564.001/T1564.001.md#atomic-test-8---hide-files-through-registry
status: experimental
tags:
- attack.defense_evasion
- attack.t1564.001
title: Displaying Hidden Files Feature Disabled
