author: frack113
date: 2022/01/22
description: Detects modification of the registry settings used for Internet Explorer
  and other Windows components that use these settings. An attacker can abuse this
  registry key to add a domain to the trusted sites Zone or insert javascript for
  persistence
detection:
  condition: selection_domains and not 1 of filter_*
  filter_accepted_documents:
    TargetObject|contains: \Accepted Documents\
  filter_binary:
    Details: Binary Data
  filter_dword:
    Details|startswith: DWORD
  filter_office:
    Details:
    - 'Cookie:'
    - 'Visited:'
    - (Empty)
  filter_path:
    TargetObject|contains:
    - \Cache
    - \ZoneMap
    - \WpadDecision
  selection_domains:
    TargetObject|contains: \Software\Microsoft\Windows\CurrentVersion\Internet Settings
falsepositives:
- Unknown
id: d88d0ab2-e696-4d40-a2ed-9790064e66b3
level: low
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-4---add-domain-to-trusted-sites-zone
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1112/T1112.md#atomic-test-5---javascript-in-registry
status: experimental
tags:
- attack.defense_evasion
- attack.t1112
title: Modification of IE Registry Settings
