author: Nasreddine Bencherchali (Nextron Systems), Thurein Oo
date: 2023/10/18
description: Detects the enabling of the PowerShell script execution policy. Once
  enabled, this policy allows scripts to be executed.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \Policies\Microsoft\Windows\PowerShell\EnableScripts
falsepositives:
- Likely
id: 8218c875-90b9-42e2-b60d-0b0069816d10
level: low
logsource:
  category: registry_set
  product: windows
references:
- https://admx.help/?Category=Windows_10_2016&Policy=Microsoft.Policies.PowerShell::EnableScripts
related:
- id: fad91067-08c5-4d1a-8d8c-d96a21b37814
  type: derived
status: experimental
tags:
- attack.execution
title: PowerShell Script Execution Policy Enabled
