author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/17
description: Detects changes to the AppInstaller (winget) policy. Specifically the
  activation of the local manifest installation, which allows a user to install new
  packages via custom manifests.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \AppInstaller\EnableLocalManifestFiles
falsepositives:
- Administrators or developers might enable this for testing purposes or to install
  custom private packages
id: fa277e82-9b78-42dd-b05c-05555c7b6015
level: medium
logsource:
  category: registry_set
  product: windows
modified: 2023/08/17
references:
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
status: experimental
tags:
- attack.defense_evasion
- attack.persistence
title: Enable Local Manifest Installation With Winget
