author: Trent Liffick (@tliffick), Nasreddine Bencherchali (Nextron Systems)
date: 2020/05/22
description: Detects registry changes to Microsoft Office "VBAWarning" to a value
  of "1" which enables the execution of all macros, whether signed or unsigned.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|endswith: \Security\VBAWarnings
falsepositives:
- Unlikely
id: 91239011-fe3c-4b54-9f24-15c86bb65913
level: high
logsource:
  category: registry_set
  product: windows
modified: 2024/03/19
references:
- https://twitter.com/inversecos/status/1494174785621819397
- https://www.mcafee.com/blogs/other-blogs/mcafee-labs/zloader-with-a-new-infection-technique/
- https://securelist.com/scarcruft-surveilling-north-korean-defectors-and-human-rights-activists/105074/
related:
- id: a166f74e-bf44-409d-b9ba-ea4b2dd8b3cd
  type: obsoletes
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Office Macros Warning Disabled
