author: Austin Songer @austinsonger, Florian Roth (Nextron Systems), Nasreddine Bencherchali
  (Nextron Systems)
date: 2021/11/26
description: 'Detects when a user is potentially trying to bypass the Windows Defender
  AV by renaming a tool to dump64.exe and placing it in the Visual Studio folder.

  Currently the rule is covering only usage of procdump but other utilities can be
  added in order to increase coverage.

  '
detection:
  condition: selection_dump and 1 of selection_tools_*
  selection_dump:
    Image|contains: \Microsoft Visual Studio\
    Image|endswith: \dump64.exe
    Image|startswith: :\Program Files
  selection_tools_procdump:
  - OriginalFileName: procdump
  - CommandLine|contains:
    - ' -ma '
    - ' -mp '
falsepositives:
- Unknown
id: 129966c9-de17-4334-a123-8b58172e664d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/06/21
references:
- https://twitter.com/mrd0x/status/1460597833917251595
status: test
tags:
- attack.credential_access
- attack.t1003.001
title: Potential Windows Defender AV Bypass Via Dump64.EXE Rename
