author: Sander Wiebing
date: 2020/05/23
description: Detects usage of the netsh command to open and allow connections to port
  3389 (RDP). As seen used by Sarwent Malware
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - portopening
    - allow
    CommandLine|contains|all:
    - 'firewall '
    - 'add '
    - 'tcp '
    - '3389'
  selection_img:
  - Image|endswith: \netsh.exe
  - OriginalFileName: netsh.exe
falsepositives:
- Legitimate administration activity
id: 01aeb693-138d-49d2-9403-c4f52d7d3d62
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/12/11
references:
- https://labs.sentinelone.com/sarwent-malware-updates-command-detonation/
status: test
tags:
- attack.defense_evasion
- attack.t1562.004
title: RDP Connection Allowed Via Netsh.EXE
