author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/20
description: Detects the execution of the hacktool SafetyKatz via PE information and
  default Image name
detection:
  condition: selection
  selection:
  - Image|endswith: \SafetyKatz.exe
  - OriginalFileName: SafetyKatz.exe
  - Description: SafetyKatz
falsepositives:
- Unlikely
id: b1876533-4ed5-4a83-90f3-b8645840a413
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2023/02/04
references:
- https://github.com/GhostPack/SafetyKatz
status: test
tags:
- attack.credential_access
- attack.t1003.001
title: HackTool - SafetyKatz Execution
