author: Nasreddine Bencherchali (Nextron Systems)
date: 2021/12/18
description: Detects the use of CleanWipe a tool usually used to delete Symantec antivirus.
detection:
  condition: 1 of selection*
  selection1:
    Image|endswith: \SepRemovalToolNative_x64.exe
  selection2:
    CommandLine|contains: --uninstall
    Image|endswith: \CATClean.exe
  selection3:
    CommandLine|contains: -r
    Image|endswith: \NetInstaller.exe
  selection4:
    CommandLine|contains|all:
    - /uninstall
    - /enterprise
    Image|endswith: \WFPUnins.exe
falsepositives:
- Legitimate administrative use (Should be investigated either way)
id: f44800ac-38ec-471f-936e-3fa7d9c53100
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/CleanWipe
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: PUA - CleanWipe Execution
