author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/11/01
description: Detects the execution of a signed binary dropped by Kaspersky Lab Products
  Remover (kavremover) which can be abused as a LOLBIN to execute arbitrary commands
  and binaries.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_legit_parents:
    ParentImage|endswith:
    - \cleanapi.exe
    - \kavremover.exe
  selection:
    CommandLine|contains: ' run run-cmd '
falsepositives:
- Unknown
id: d047726b-c71c-4048-a99b-2e2f50dc107d
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://nasbench.medium.com/lolbined-using-kaspersky-endpoint-security-kes-installer-to-execute-arbitrary-commands-1c999f1b7fea
status: test
tags:
- attack.defense_evasion
- attack.t1127
title: Kavremover Dropped Binary LOLBIN Usage
