author: frack113
date: 2021/07/27
description: An adversary may compress or encrypt data that is collected prior to
  exfiltration using 3rd party utilities
detection:
  condition: all of selection_*
  selection_action:
    CommandLine|contains:
    - ' a '
    - ' u '
  selection_img:
  - Description|contains: 7-Zip
  - Image|endswith:
    - \7z.exe
    - \7zr.exe
    - \7za.exe
  - OriginalFileName:
    - 7z.exe
    - 7za.exe
  selection_password:
    CommandLine|contains: ' -p'
falsepositives:
- Legitimate activity is expected since compressing files with a password is common.
id: 9fbf5927-5261-4284-a71d-f681029ea574
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/03/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1560.001/T1560.001.md
status: test
tags:
- attack.collection
- attack.t1560.001
title: Compress Data and Lock With Password for Exfiltration With 7-ZIP
