author: Florian Roth (Nextron Systems)
date: 2022/09/13
description: Detects the use of 3proxy, a tiny free proxy server
detection:
  condition: 1 of selection_*
  selection_img:
    Image|endswith: \3proxy.exe
  selection_params:
    CommandLine|contains: .exe -i127.0.0.1 -p
  selection_pe:
    Description: 3proxy - tiny proxy server
falsepositives:
- Administrative activity
id: f38a82d2-fba3-4781-b549-525efbec8506
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/21
references:
- https://github.com/3proxy/3proxy
- https://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: test
tags:
- attack.command_and_control
- attack.t1572
title: PUA - 3Proxy Execution
