author: Markus Neis, Sander Wiebing
date: 2018/11/22
description: Detects Executables in the Downloads folder without FileVersion,Description,Product,Company
  likely created with py2exe
detection:
  condition: (selection1 or selection2 or selection3) and folder
  folder:
    Image|contains: \Downloads\
  selection1:
    Description: \?
    FileVersion: \?
  selection2:
    Description: \?
    Product: \?
  selection3:
    Company: \?
    Description: \?
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
id: 9637e8a5-7131-4f7f-bdc7-2b05d8670c43
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/10/09
references:
- https://securelist.com/muddywater/88059/
- https://www.virustotal.com/#/file/276a765a10f98cda1a38d3a31e7483585ca3722ecad19d784441293acf1b7beb/detection
status: test
tags:
- attack.execution
- attack.t1059.006
title: Suspicious File Characteristics Due to Missing Fields
