author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Certipy a tool for Active Directory Certificate Services enumeration
  and abuse based on PE metadata characteristics and common command line arguments.
detection:
  condition: selection_img or all of selection_cli_*
  selection_cli_commands:
    CommandLine|contains:
    - ' auth '
    - ' find '
    - ' forge '
    - ' relay '
    - ' req '
    - ' shadow '
  selection_cli_flags:
    CommandLine|contains:
    - ' -bloodhound'
    - ' -ca-pfx '
    - ' -dc-ip '
    - ' -kirbi'
    - ' -old-bloodhound'
    - ' -pfx '
    - ' -target'
    - ' -username '
    - ' -vulnerable'
    - auth -pfx
    - shadow auto
    - shadow list
  selection_img:
  - Image|endswith: \Certipy.exe
  - OriginalFileName: Certipy.exe
  - Description|contains: Certipy
falsepositives:
- Unlikely
id: 6938366d-8954-4ddc-baff-c830b3ba8fcd
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/ly4k/Certipy
status: test
tags:
- attack.discovery
- attack.credential_access
- attack.t1649
title: HackTool - Certipy Execution
