author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
detection:
  condition: selection
  selection:
    CommandLine|re: (?i)echo.*clip.*&&.*(Clipboard|i`?n`?v`?o`?k`?e`?)
falsepositives:
- Unknown
id: e1561947-b4e3-4a74-9bdd-83baed21bdb5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/04/15
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Clip
