author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/12/20
description: 'Detects the execution of the "cloudflared" binary from a non standard
  location.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_admin_location:
    Image|contains:
    - :\Program Files (x86)\cloudflared\
    - :\Program Files\cloudflared\
  selection:
    Image|endswith: \cloudflared.exe
falsepositives:
- Legitimate usage of Cloudflared portable versions
id: fadb84f0-4e84-4f6d-a1ce-9ef2bffb6ccd
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://developers.cloudflare.com/cloudflare-one/connections/connect-networks/do-more-with-tunnels/trycloudflare/
- https://github.com/cloudflare/cloudflared
- https://www.intrinsec.com/akira_ransomware/
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- https://github.com/cloudflare/cloudflared/releases
status: experimental
tags:
- attack.command_and_control
- attack.t1090.001
title: Cloudflared Portable Execution
