author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Certify a tool for Active Directory certificate abuse based on
  PE metadata characteristics and common command line arguments.
detection:
  condition: selection_img or all of selection_cli_*
  selection_cli_commands:
    CommandLine|contains:
    - '.exe cas '
    - '.exe find '
    - '.exe pkiobjects '
    - '.exe request '
    - '.exe download '
  selection_cli_options:
    CommandLine|contains:
    - ' /vulnerable'
    - ' /template:'
    - ' /altname:'
    - ' /domain:'
    - ' /path:'
    - ' /ca:'
  selection_img:
  - Image|endswith: \Certify.exe
  - OriginalFileName: Certify.exe
  - Description|contains: Certify
falsepositives:
- Unknown
id: 762f2482-ff21-4970-8939-0aa317a886bb
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/04/25
references:
- https://github.com/GhostPack/Certify
status: test
tags:
- attack.discovery
- attack.credential_access
- attack.t1649
title: HackTool - Certify Execution
