author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/19
description: Detects execution of Remote Utilities RAT (RURAT) from an unusual location
  (outside of 'C:\Program Files')
detection:
  condition: selection and not filter
  filter:
    Image|startswith:
    - C:\Program Files\Remote Utilities
    - C:\Program Files (x86)\Remote Utilities
  selection:
  - Image|endswith:
    - \rutserv.exe
    - \rfusclient.exe
  - Product: Remote Utilities
falsepositives:
- Unknown
id: e01fa958-6893-41d4-ae03-182477c5e77d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/03/05
references:
- https://redcanary.com/blog/misbehaving-rats/
status: test
tags:
- attack.defense_evasion
title: Remote Access Tool - RURAT Execution From Unusual Location
