author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunneling techniques
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_avast:
    Image|contains:
    - :\Program Files\Avast Software\SecureLine VPN\
    - :\Program Files (x86)\Avast Software\SecureLine VPN\
  filter_optional_openvpn:
    Image|contains: :\Program Files\OpenVPN Connect\drivers\tap\
  filter_optional_protonvpn:
    Image|contains: :\Program Files (x86)\Proton Technologies\ProtonVPNTap\installer\
  selection:
    Image|endswith: \tapinstall.exe
falsepositives:
- Legitimate OpenVPN TAP installation
id: 99793437-3e16-439b-be0f-078782cf953d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/11
references:
- https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
status: test
tags:
- attack.exfiltration
- attack.t1048
title: Tap Installer Execution
