author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/19
description: Detects execution of client32.exe (NetSupport RAT) from an unusual location
  (outside of 'C:\Program Files')
detection:
  condition: selection and not filter
  filter:
    Image|startswith:
    - C:\Program Files\
    - C:\Program Files (x86)\
  selection:
  - Image|endswith: \client32.exe
  - Product|contains: NetSupport Remote Control
  - OriginalFileName|contains: client32.exe
  - Imphash: a9d50692e95b79723f3e76fcf70d023e
  - Hashes|contains: IMPHASH=a9d50692e95b79723f3e76fcf70d023e
falsepositives:
- Unknown
id: 37e8d358-6408-4853-82f4-98333fca7014
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/03/05
references:
- https://redcanary.com/blog/misbehaving-rats/
status: test
tags:
- attack.defense_evasion
title: Remote Access Tool - NetSupport Execution From Unusual Location
