author: frack113
date: 2022/01/22
description: Detects the execution of Radmin which can be abused by an adversary to
  remotely control Windows machines
detection:
  condition: selection
  selection:
  - Description: Radmin Viewer
  - Product: Radmin Viewer
  - OriginalFileName: Radmin.exe
falsepositives:
- Unknown
id: 5817e76f-4804-41e6-8f1d-5fa0b3ecae2d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/11
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1072/T1072.md
- https://www.radmin.fr/
status: test
tags:
- attack.execution
- attack.lateral_movement
- attack.t1072
title: PUA - Radmin Viewer Utility Execution
