author: Bhabesh Raj, Sittikorn S, Aaron Greetham (@beardofbinary) - NCC Group
date: 2021/05/10
description: Detects execution of RClone utility for exfiltration as used by various
  ransomwares strains like REvil, Conti, FiveHands, etc
detection:
  condition: selection_specific_options or all of selection_rclone_*
  selection_rclone_cli:
    CommandLine|contains:
    - pass
    - user
    - copy
    - sync
    - config
    - lsd
    - remote
    - ls
    - mega
    - pcloud
    - ftp
    - ignore-existing
    - auto-confirm
    - transfers
    - multi-thread-streams
    - 'no-check-certificate '
  selection_rclone_img:
  - Image|endswith: \rclone.exe
  - Description: Rsync for cloud storage
  selection_specific_options:
    CommandLine|contains|all:
    - '--config '
    - '--no-check-certificate '
    - ' copy '
falsepositives:
- Unknown
fields:
- CommandLine
- ParentCommandLine
- Details
id: e37db05d-d1f9-49c8-b464-cee1a4b11638
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/03/05
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
- https://thedfirreport.com/2021/03/29/sodinokibi-aka-revil-ransomware
- https://us-cert.cisa.gov/ncas/analysis-reports/ar21-126a
- https://labs.sentinelone.com/egregor-raas-continues-the-chaos-with-cobalt-strike-and-rclone
- https://www.splunk.com/en_us/blog/security/darkside-ransomware-splunk-threat-update-and-detections.html
related:
- id: a0d63692-a531-4912-ad39-4393325b2a9c
  type: obsoletes
- id: cb7286ba-f207-44ab-b9e6-760d82b84253
  type: obsoletes
status: test
tags:
- attack.exfiltration
- attack.t1567.002
title: PUA - Rclone Execution
