author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2024/05/10
description: 'Detects the dump of highly sensitive files such as "NTDS.DIT" and "SECURITY"
  hive.

  Attackers can leverage the "wbadmin" utility in order to dump sensitive files that
  might contain credential or sensitive information.

  '
detection:
  condition: all of selection_*
  selection_backup:
    CommandLine|contains:
    - \config\SAM
    - \config\SECURITY
    - \config\SYSTEM
    - \Windows\NTDS\NTDS.dit
    CommandLine|contains|all:
    - ' recovery'
    - recoveryTarget
    - itemtype:File
  selection_img:
  - Image|endswith: \wbadmin.exe
  - OriginalFileName: WBADMIN.EXE
falsepositives:
- Unknown
id: 84972c80-251c-4c3a-9079-4f00aad93938
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Wbadmin.yml
- https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-backup
related:
- id: 6fe4aa1e-0531-4510-8be2-782154b73b48
  type: derived
status: experimental
tags:
- attack.credential_access
- attack.t1003.003
title: Sensitive File Recovery From Backup Via Wbadmin.EXE
