author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/22
description: Detects suspicious execution of "PDQDeployRunner" which is part of the
  PDQDeploy service stack that is responsible for executing commands and packages
  on a remote machines
detection:
  condition: all of selection_*
  selection_child:
  - Image|endswith:
    - \bash.exe
    - \certutil.exe
    - \cmd.exe
    - \csc.exe
    - \cscript.exe
    - \dllhost.exe
    - \mshta.exe
    - \msiexec.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \scriptrunner.exe
    - \wmic.exe
    - \wscript.exe
    - \wsl.exe
  - Image|contains:
    - :\ProgramData\
    - :\Users\Public\
    - :\Windows\TEMP\
    - \AppData\Local\Temp
  - CommandLine|contains:
    - ' -decode '
    - ' -enc '
    - ' -encodedcommand '
    - ' -w hidden'
    - DownloadString
    - FromBase64String
    - http
    - 'iex '
    - Invoke-
  selection_parent:
    ParentImage|contains: \PDQDeployRunner-
falsepositives:
- Legitimate use of the PDQDeploy tool to execute these commands
id: 12b8e9f5-96b2-41e1-9a42-8c6779a5c184
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/05/02
references:
- https://twitter.com/malmoeb/status/1550483085472432128
related:
- id: d679950c-abb7-43a6-80fb-2a480c4fc450
  type: similar
status: test
tags:
- attack.execution
title: Potentially Suspicious Execution Of PDQDeployRunner
