author: Florian Roth (Nextron Systems)
date: 2020/05/28
description: Detects suspicious renamed SysInternals DebugView execution
detection:
  condition: selection and not filter
  filter:
    Image|endswith: \Dbgview.exe
    OriginalFileName: Dbgview.exe
  selection:
    Product: Sysinternals DebugView
falsepositives:
- Unknown
id: cd764533-2e07-40d6-a718-cfeec7f2da7f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://www.epicturla.com/blog/sysinturla
status: test
tags:
- attack.resource_development
- attack.t1588.002
title: Renamed SysInternals DebugView Execution
