author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/17
description: Detects usage of winget to add new potentially suspicious download sources
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - 'source '
    - 'add '
  selection_img:
  - Image|endswith: \winget.exe
  - OriginalFileName: winget.exe
  selection_source_direct_ip:
    CommandLine|re: ://\d{1,3}\.\d{1,3}\.\d{1,3}\.\d{1,3}
falsepositives:
- Unknown
id: c15a46a0-07d4-4c87-b4b6-89207835a83b
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/04
references:
- https://learn.microsoft.com/en-us/windows/package-manager/winget/source
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
related:
- id: 05ebafc8-7aa2-4bcd-a269-2aec93f9e842
  type: similar
- id: 81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
title: Add Potential Suspicious New Download Source To Winget
