author: Nasreddine Bencherchali (Nextron Systems), AdmU3
date: 2023/12/19
description: 'Detects execution of "tar.exe" in order to create a compressed file.

  Adversaries may abuse various utilities to compress or encrypt data before exfiltration.

  '
detection:
  condition: all of selection_*
  selection_create:
    CommandLine|contains:
    - -c
    - -r
    - -u
  selection_img:
  - Image|endswith: \tar.exe
  - OriginalFileName: bsdtar
falsepositives:
- Likely
id: 418a3163-3247-4b7b-9933-dcfcb7c52ea9
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://unit42.paloaltonetworks.com/chromeloader-malware/
- https://lolbas-project.github.io/lolbas/Binaries/Tar/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/cicada-apt10-japan-espionage
status: experimental
tags:
- attack.collection
- attack.exfiltration
- attack.t1560
- attack.t1560.001
title: Compressed File Creation Via Tar.EXE
