author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/17
description: 'Detects usage of winget to add a new insecure (http) download source.

  Winget will not allow the addition of insecure sources, hence this could indicate
  potential suspicious activity (or typos)

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - 'source '
    - 'add '
    - http://
  selection_img:
  - Image|endswith: \winget.exe
  - OriginalFileName: winget.exe
falsepositives:
- False positives might occur if the users are unaware of such control checks
id: 81a0ecb5-0a41-4ba1-b2ba-c944eb92bfa2
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows/package-manager/winget/source
- https://github.com/nasbench/Misc-Research/tree/b9596e8109dcdb16ec353f316678927e507a5b8d/LOLBINs/Winget
related:
- id: 05ebafc8-7aa2-4bcd-a269-2aec93f9e842
  type: similar
- id: c15a46a0-07d4-4c87-b4b6-89207835a83b
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1059
title: Add Insecure Download Source To Winget
