author: Florian Roth (Nextron Systems)
date: 2019/12/20
description: Detects command line parameters used by Bloodhound and Sharphound hack
  tools
detection:
  condition: 1 of selection_*
  selection_cli_1:
    CommandLine|contains:
    - ' -CollectionMethod All '
    - ' --CollectionMethods Session '
    - ' --Loop --Loopduration '
    - ' --PortScanTimeout '
    - '.exe -c All -d '
    - Invoke-Bloodhound
    - Get-BloodHoundData
  selection_cli_2:
    CommandLine|contains|all:
    - ' -JsonFolder '
    - ' -ZipFileName '
  selection_cli_3:
    CommandLine|contains|all:
    - ' DCOnly '
    - ' --NoSaveCache '
  selection_img:
  - Product|contains: SharpHound
  - Description|contains: SharpHound
  - Company|contains:
    - SpecterOps
    - evil corp
  - Image|contains:
    - \Bloodhound.exe
    - \SharpHound.exe
falsepositives:
- Other programs that use these command line option and accepts an 'All' parameter
id: f376c8a7-a2d0-4ddc-aa0c-16c17236d962
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/04
references:
- https://github.com/BloodHoundAD/BloodHound
- https://github.com/BloodHoundAD/SharpHound
status: test
tags:
- attack.discovery
- attack.t1087.001
- attack.t1087.002
- attack.t1482
- attack.t1069.001
- attack.t1069.002
- attack.execution
- attack.t1059.001
title: HackTool - Bloodhound/Sharphound Execution
