author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2020/10/12
description: Detects WMIC executing "process call create" with suspicious calls to
  processes such as "rundll32", "regsrv32", etc.
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - rundll32
    - bitsadmin
    - regsvr32
    - 'cmd.exe /c '
    - 'cmd.exe /k '
    - 'cmd.exe /r '
    - 'cmd /c '
    - 'cmd /k '
    - 'cmd /r '
    - powershell
    - pwsh
    - certutil
    - cscript
    - wscript
    - mshta
    - \Users\Public\
    - \Windows\Temp\
    - \AppData\Local\
    - '%temp%'
    - '%tmp%'
    - '%ProgramData%'
    - '%appdata%'
    - '%comspec%'
    - '%localappdata%'
    CommandLine|contains|all:
    - 'process '
    - 'call '
    - 'create '
falsepositives:
- Unknown
id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://thedfirreport.com/2020/10/08/ryuks-return/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/ransomware-hive-conti-avoslocker
related:
- id: 526be59f-a573-4eea-b5f7-f0973207634d
  type: derived
status: test
tags:
- attack.execution
- attack.t1047
title: Suspicious Process Created Via Wmic.EXE
