author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2023/12/04
description: Detects the execution of "whoami.exe" with the "/all" flag
detection:
  condition: all of selection_main_*
  selection_main_cli:
    CommandLine|contains|windash: ' -all'
  selection_main_img:
  - Image|endswith: \whoami.exe
  - OriginalFileName: whoami.exe
falsepositives:
- Unknown
id: c248c896-e412-4279-8c15-1c558067b6fa
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/05
references:
- https://brica.de/alerts/alert/public/1247926/agent-tesla-keylogger-delivered-inside-a-power-iso-daa-archive/
- https://app.any.run/tasks/7eaba74e-c1ea-400f-9c17-5e30eee89906/
- https://www.youtube.com/watch?v=DsJ9ByX84o4&t=6s
status: experimental
tags:
- attack.discovery
- attack.t1033
- car.2016-03-001
title: Enumerate All Information With Whoami.EXE
