author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/14
description: Detects the execution of Windows binaries from within a WSL instance.
  This could be used to masquerade parent-child relationships
detection:
  condition: selection
  selection:
    CurrentDirectory|contains: \\\\wsl.localhost
    Image|re: '[a-zA-Z]:\\'
falsepositives:
- Unknown
id: ed825c86-c009-4014-b413-b76003e33d35
level: medium
logsource:
  category: process_creation
  product: windows
references:
- Internal Research
status: test
tags:
- attack.execution
- attack.defense_evasion
- attack.t1202
title: Windows Binary Executed From WSL
