author: Swachchhanda Shrawan Poudel
date: 2024/02/12
description: 'Detects the enumeration and query of interesting and in some cases sensitive
  services on the system via "sc.exe".

  Attackers often try to enumerate the services currently running on a system in order
  to find different attack vectors.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: query
  selection_cmd:
    CommandLine|contains: termservice
  selection_img:
  - Image|endswith: \sc.exe
  - OriginalFileName: sc.exe
falsepositives:
- Unknown
id: e83e8899-c9b2-483b-b355-5decc942b959
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://www.n00py.io/2021/05/dumping-plaintext-rdp-credentials-from-svchost-exe/
- https://pentestlab.blog/tag/svchost/
status: experimental
tags:
- attack.t1003
title: Interesting Service Enumeration Via Sc.EXE
