author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/17
description: Detects execution of "rundll32" with potential obfuscated ordinal calls
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - '#+'
    - '#-'
  selection_img:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
  - CommandLine|contains: rundll32
falsepositives:
- Unknown
id: 43fa5350-db63-4b8f-9a01-789a427074e1
level: medium
logsource:
  category: process_creation
  product: windows
references:
- Internal Research
status: test
tags:
- attack.defense_evasion
title: Potential Obfuscated Ordinal Call Via Rundll32
