author: Florian Roth (Nextron Systems), Tigzy
date: 2021/11/17
description: Detects a suspicious winrar execution in a folder which is not the default
  installation folder
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_path:
    Image|contains:
    - :\Program Files (x86)\WinRAR\
    - :\Program Files\WinRAR\
  filter_main_unrar:
    Image|endswith: \UnRAR.exe
  filter_optional_temp:
    Image|contains: :\Windows\Temp\
  selection:
  - Image|endswith:
    - \rar.exe
    - \winrar.exe
  - Description: Command line RAR
falsepositives:
- Legitimate use of WinRAR in a folder of a software that bundles WinRAR
id: 4ede543c-e098-43d9-a28f-dd784a13132f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/08/31
references:
- https://twitter.com/cyb3rops/status/1460978167628406785
status: test
tags:
- attack.collection
- attack.t1560.001
title: Winrar Execution in Non-Standard Folder
