author: Teymur Kheirkhabarov, Daniil Yugoslavskiy, oscd.community
date: 2019/10/22
description: Files with well-known filenames (sensitive files with credential data)
  copying
detection:
  condition: all of selection_esent_* or selection_susp_paths
  selection_esent_cli:
    CommandLine|contains|windash:
    - vss
    - ' /m '
    - ' /y '
  selection_esent_img:
  - Image|endswith: \esentutl.exe
  - OriginalFileName: \esentutl.exe
  selection_susp_paths:
    CommandLine|contains:
    - \config\RegBack\sam
    - \config\RegBack\security
    - \config\RegBack\system
    - \config\sam
    - \config\security
    - '\config\system '
    - \repair\sam
    - \repair\security
    - \repair\system
    - \windows\ntds\ntds.dit
falsepositives:
- Copying sensitive files for legitimate use (eg. backup) or forensic investigation
  by legitimate incident responder or forensic investigator.
id: e7be6119-fc37-43f0-ad4f-1f3f99be2f9f
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/06/04
references:
- https://room362.com/post/2013/2013-06-10-volume-shadow-copy-ntdsdit-domain-hashes-remotely-part-1/
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
- https://dfironthemountain.wordpress.com/2018/12/06/locked-file-access-using-esentutl-exe/
- https://github.com/LOLBAS-Project/LOLBAS/blob/2cc01b01132b5c304027a658c698ae09dd6a92bf/yml/OSBinaries/Esentutl.yml
status: test
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.003
- car.2013-07-001
- attack.s0404
title: Copying Sensitive Files with Credential Data
