author: pH-T (Nextron Systems)
date: 2023/04/17
description: Detects Crassus, a Windows privilege escalation discovery tool, based
  on PE metadata characteristics.
detection:
  condition: selection
  selection:
  - Image|endswith: \Crassus.exe
  - OriginalFileName: Crassus.exe
  - Description|contains: Crassus
falsepositives:
- Unlikely
id: 2c32b543-1058-4808-91c6-5b31b8bed6c5
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/vu-ls/Crassus
status: test
tags:
- attack.discovery
- attack.t1590.001
title: PUA - Crassus Execution
