author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/05
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: 1 of selection_* and not 1 of filter_*
  filter_chocolatey:
    CommandLine|contains:
    - (New-Object System.Net.WebClient).DownloadString('https://community.chocolatey.org/install.ps1
    - Write-ChocolateyWarning
  selection_convert_b64:
    CommandLine|contains|all:
    - -nop
    - ' -w '
    - hidden
    - ' -c '
    - '[Convert]::FromBase64String'
  selection_enc:
    CommandLine|contains|all:
    - ' -w '
    - hidden
    - -ep
    - bypass
    - -Enc
  selection_iex:
    CommandLine|contains|all:
    - ' -w '
    - hidden
    - -noni
    - -nop
    - ' -c '
    - iex
    - New-Object
  selection_iex_webclient:
    CommandLine|contains|all:
    - iex
    - New-Object
    - Net.WebClient
    - .Download
  selection_reg:
    CommandLine|contains|all:
    - powershell
    - reg
    - add
    - \software\
  selection_webclient:
    CommandLine|contains|all:
    - bypass
    - -noprofile
    - -windowstyle
    - hidden
    - new-object
    - system.net.webclient
    - .download
falsepositives:
- Unknown
id: 536e2947-3729-478c-9903-745aaffe60d2
level: medium
logsource:
  category: process_creation
  product: windows
references:
- Internal Research
related:
- id: fce5f582-cc00-41e1-941a-c6fabf0fdb8c
  type: obsoletes
- id: ae7fbf8e-f3cb-49fd-8db4-5f3bed522c71
  type: similar
- id: 8ff28fdd-e2fa-4dfa-aeda-ef3d61c62090
  type: similar
status: test
tags:
- attack.defense_evasion
title: Suspicious PowerShell Invocations - Specific - ProcessCreation
