author: Michael Haag, Florian Roth (Nextron Systems), juju4, oscd.community
date: 2019/01/16
description: Detects new process creation using WMIC via the "process call create"
  flag
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - process
    - call
    - create
  selection_img:
  - Image|endswith: \wmic.exe
  - OriginalFileName: wmic.exe
falsepositives:
- Unknown
id: 526be59f-a573-4eea-b5f7-f0973207634d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://www.sans.org/blog/wmic-for-incident-response/
- https://github.com/redcanaryco/atomic-red-team/blob/84215139ee5127f8e3a117e063b604812bd71928/atomics/T1047/T1047.md#atomic-test-5---wmi-execute-local-process
related:
- id: 3c89a1e8-0fba-449e-8f1b-8409d6267ec8
  type: derived
status: test
tags:
- attack.execution
- attack.t1047
- car.2016-03-002
title: New Process Created Via Wmic.EXE
