author: Jimmy Bayne (@bohops)
date: 2024/01/02
description: Detects commandline arguments for executing a child process via dotnet-trace.exe
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - '-- '
    - collect
  selection_img:
  - Image|endswith: \dotnet-trace.exe
  - OriginalFileName: dotnet-trace.dll
falsepositives:
- Legitimate usage of the utility in order to debug and trace a program.
id: 9257c05b-4a4a-48e5-a670-b7b073cf401b
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/bohops/status/1740022869198037480
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.t1218
title: Binary Proxy Execution Via Dotnet-Trace.EXE
