author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/05
description: Detects potentially suspicious file downloads from file sharing domains
  using wget.exe
detection:
  condition: all of selection_*
  selection_ext:
    CommandLine|endswith:
    - .ps1
    - .ps1'
    - .ps1"
    - .dat
    - .dat'
    - .dat"
    - .msi
    - .msi'
    - .msi"
    - .bat
    - .bat'
    - .bat"
    - .exe
    - .exe'
    - .exe"
    - .vbs
    - .vbs'
    - .vbs"
    - .vbe
    - .vbe'
    - .vbe"
    - .hta
    - .hta'
    - .hta"
    - .dll
    - .dll'
    - .dll"
    - .psm1
    - .psm1'
    - .psm1"
  selection_flag:
  - CommandLine|re: \s-O\s
  - CommandLine|contains: --output-document
  selection_http:
    CommandLine|contains: http
  selection_img:
  - Image|endswith: \wget.exe
  - OriginalFileName: wget.exe
  selection_websites:
    CommandLine|contains:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - cdn.discordapp.com/attachments/
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - ufile.io
falsepositives:
- Unknown
id: a0d7e4d2-bede-4141-8896-bc6e237e977c
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/02/09
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
status: experimental
tags:
- attack.execution
title: Suspicious File Download From File Sharing Domain Via Wget.EXE
