author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/05/16
description: Detects when a user downloads a file by using CertOC.exe
detection:
  condition: all of selection*
  selection_cli:
    CommandLine|contains|all:
    - -GetCACAPS
    - http
  selection_img:
  - Image|endswith: \certoc.exe
  - OriginalFileName: CertOC.exe
falsepositives:
- Unknown
id: 70ad0861-d1fe-491c-a45f-fa48148a300d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/10/18
references:
- https://lolbas-project.github.io/lolbas/Binaries/Certoc/
related:
- id: b86f6dea-0b2f-41f5-bdcc-a057bd19cd6a
  type: similar
status: test
tags:
- attack.command_and_control
- attack.t1105
title: File Download via CertOC.EXE
