author: Mateusz Wydra, oscd.community
date: 2020/10/12
description: Detects the start of a non built-in assistive technology applications
  via "Atbroker.EXE".
detection:
  condition: all of selection_* and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_builtin:
    CommandLine|contains:
    - animations
    - audiodescription
    - caretbrowsing
    - caretwidth
    - colorfiltering
    - cursorindicator
    - cursorscheme
    - filterkeys
    - focusborderheight
    - focusborderwidth
    - highcontrast
    - keyboardcues
    - keyboardpref
    - livecaptions
    - magnifierpane
    - messageduration
    - minimumhitradius
    - mousekeys
    - Narrator
    - osk
    - overlappedcontent
    - showsounds
    - soundsentry
    - speechreco
    - stickykeys
    - togglekeys
    - voiceaccess
    - windowarranging
    - windowtracking
    - windowtrackingtimeout
    - windowtrackingzorder
  filter_optional_java:
    CommandLine|contains: Oracle_JavaAccessBridge
  selection_cli:
    CommandLine|contains: start
  selection_img:
  - Image|endswith: \AtBroker.exe
  - OriginalFileName: AtBroker.exe
falsepositives:
- Legitimate, non-default assistive technology applications execution
id: f24bcaea-0cd1-11eb-adc1-0242ac120002
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/06
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Uncommon  Assistive Technology Applications Execution Via AtBroker.EXE
