author: omkar72
date: 2020/10/25
description: Detects uncommon "conhost" child processes. This could be a sign of "conhost"
  usage as a LOLBIN or potential process injection activity.
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_conhost:
    Image|endswith: :\Windows\System32\conhost.exe
  filter_main_empty:
    Image: ''
  filter_main_null:
    Image: null
  filter_optional_provider:
    Provider_Name: SystemTraceProvider-Process
  selection:
    ParentImage|endswith: \conhost.exe
falsepositives:
- Unknown
id: 7dc2dedd-7603-461a-bc13-15803d132355
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/11
references:
- http://www.hexacorn.com/blog/2020/05/25/how-to-con-your-host/
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Uncommon Child Process Of Conhost.EXE
