author: Max Altgelt (Nextron Systems)
date: 2022/08/23
description: Detects process creation events that use the Sysnative folder (common
  for CobaltStrike spawns)
detection:
  condition: sysnative
  sysnative:
  - CommandLine|contains: :\Windows\Sysnative\
  - Image|contains: :\Windows\Sysnative\
falsepositives:
- Unknown
id: 3c1b5fb0-c72f-45ba-abd1-4d4c353144ab
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/14
references:
- https://thedfirreport.com/2021/08/29/cobalt-strike-a-defenders-guide/
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
title: Process Creation Using Sysnative Folder
