author: Margaritis Dimitrios (idea), Florian Roth (Nextron Systems), oscd.community,
  Nasreddine Bencherchali (Nextron Systems)
date: 2019/01/16
description: Detects wscript/cscript executions of scripts located in user directories
detection:
  condition: all of selection_*
  selection_exec:
    Image|endswith:
    - \wscript.exe
    - \cscript.exe
  selection_ext:
    CommandLine|contains:
    - .js
    - .jse
    - .vba
    - .vbe
    - .vbs
    - .wsf
  selection_paths:
    CommandLine|contains:
    - :\Temp\
    - :\Tmp\
    - :\Users\Public\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
falsepositives:
- Some installers might generate a similar behavior. An initial baseline is required
id: cea72823-df4d-4567-950c-0b579eaf0846
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/01/30
references:
- https://thedfirreport.com/2023/10/30/netsupport-intrusion-results-in-domain-compromise/
- https://redcanary.com/blog/gootloader/
related:
- id: 1e33157c-53b1-41ad-bbcc-780b80b58288
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: Potential Dropper Script Execution Via WScript/CScript
