author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/12
description: Execution of ssh.exe to perform data exfiltration and tunneling through
  RDP
detection:
  condition: selection
  selection:
    CommandLine|contains: :3389
    Image|endswith: \ssh.exe
falsepositives:
- Unknown
id: f7d7ebd5-a016-46e2-9c54-f9932f2d386d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/01/25
references:
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
related:
- id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
  type: similar
status: test
tags:
- attack.command_and_control
- attack.t1572
title: Potential RDP Tunneling Via SSH
