author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/23
description: Detects potentially suspicious file downloads directly from IP addresses
  and stored in suspicious locations using Wget.exe
detection:
  condition: all of selection_*
  selection_flag:
  - CommandLine|re: \s-O\s
  - CommandLine|contains: --output-document
  selection_http:
    CommandLine|contains: http
  selection_img:
  - Image|endswith: \wget.exe
  - OriginalFileName: wget.exe
  selection_ip:
    CommandLine|re: ://[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}
  selection_paths:
  - CommandLine|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - :\Windows\Help\
    - :\Windows\Temp\
    - \Temporary Internet
  - CommandLine|contains|all:
    - :\Users\
    - \Favorites\
  - CommandLine|contains|all:
    - :\Users\
    - \Favourites\
  - CommandLine|contains|all:
    - :\Users\
    - \Contacts\
  - CommandLine|contains|all:
    - :\Users\
    - \Pictures\
falsepositives:
- Unknown
id: 40aa399c-7b02-4715-8e5f-73572b493f33
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.gnu.org/software/wget/manual/wget.html
status: experimental
tags:
- attack.execution
title: Suspicious File Download From IP Via Wget.EXE - Paths
