author: Florian Roth (Nextron Systems)
date: 2018/12/19
description: Detects the execution of SecurityXploded Tools
detection:
  condition: selection
  selection:
  - Company: SecurityXploded
  - Image|endswith: PasswordDump.exe
  - OriginalFileName|endswith: PasswordDump.exe
falsepositives:
- Unlikely
id: 7679d464-4f74-45e2-9e01-ac66c5eb041a
level: critical
logsource:
  category: process_creation
  product: windows
modified: 2023/02/04
references:
- https://securityxploded.com/
- https://cyberx-labs.com/blog/gangnam-industrial-style-apt-campaign-targets-korean-industrial-companies/
status: stable
tags:
- attack.credential_access
- attack.t1555
title: HackTool - SecurityXploded Execution
