author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/03/24
description: Detects suspicious ways to run Invoke-Execution using IEX alias
detection:
  condition: all of selection_combined_* or selection_standalone
  selection_combined_1:
    CommandLine|contains:
    - ' | iex;'
    - ' | iex '
    - ' | iex}'
    - ' | IEX ;'
    - ' | IEX -Error'
    - ' | IEX (new'
    - ');IEX '
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  selection_combined_2:
    CommandLine|contains:
    - ::FromBase64String
    - '.GetString([System.Convert]::'
  selection_standalone:
    CommandLine|contains:
    - )|iex;$
    - );iex($
    - );iex $
    - ' | IEX | '
    - ' | iex\"'
falsepositives:
- Legitimate scripts that use IEX
id: 09576804-7a05-458e-a817-eb718ca91f54
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/11/28
references:
- https://docs.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-expression?view=powershell-7.2
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell IEX Execution Patterns
