author: Florian Roth (Nextron Systems)
date: 2022/01/16
description: Detects a suspicious output redirection to the local admins share, this
  technique is often found in malicious scripts or hacktool stagers
detection:
  condition: all of selection_*
  selection_redirect:
    CommandLine|contains: '>'
  selection_share:
    CommandLine|contains:
    - \\\\127.0.0.1\\admin$\\
    - \\\\localhost\\admin$\\
falsepositives:
- Unknown
id: ab9e3b40-0c85-4ba1-aede-455d226fd124
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/12/28
references:
- https://www.microsoft.com/security/blog/2022/01/15/destructive-malware-targeting-ukrainian-organizations/
- http://blog.talosintelligence.com/2022/09/lazarus-three-rats.html
status: test
tags:
- attack.exfiltration
- attack.t1048
title: Suspicious Redirection to Local Admin Share
