author: Teymur Kheirkhabarov, Harish Segar
date: 2020/03/20
description: Detects a suspicious or uncommon parent processes of PowerShell
detection:
  condition: all of selection_*
  selection_parent:
  - ParentImage|contains: tomcat
  - ParentImage|endswith:
    - \amigo.exe
    - \browser.exe
    - \chrome.exe
    - \firefox.exe
    - \httpd.exe
    - \iexplore.exe
    - \jbosssvc.exe
    - \microsoftedge.exe
    - \microsoftedgecp.exe
    - \MicrosoftEdgeSH.exe
    - \mshta.exe
    - \nginx.exe
    - \outlook.exe
    - \php-cgi.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \safari.exe
    - \services.exe
    - \sqlagent.exe
    - \sqlserver.exe
    - \sqlservr.exe
    - \vivaldi.exe
    - \w3wp.exe
  selection_powershell:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - CommandLine|contains:
    - /c powershell
    - /c pwsh
  - Description: Windows PowerShell
  - Product: PowerShell Core 6
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
falsepositives:
- Other scripts
id: 754ed792-634f-40ae-b3bc-e0448d33f695
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/04
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse?slide=26
related:
- id: 692f0bec-83ba-4d04-af7e-e884a96059b6
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Parent Process
