author: '@gott_cyber'
date: 2024/01/02
description: 'Detects the execution of EDRSilencer, a tool that leverages Windows
  Filtering Platform (WFP) to block Endpoint Detection and Response (EDR) agents from
  reporting security events to the server based on PE metadata information.

  '
detection:
  condition: selection
  selection:
  - Image|endswith: \EDRSilencer.exe
  - OriginalFileName: EDRSilencer.exe
  - Description|contains: EDRSilencer
falsepositives:
- Unlikely
id: eb2d07d4-49cb-4523-801a-da002df36602
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/netero1010/EDRSilencer
status: experimental
tags:
- attack.defense_evasion
- attack.t1562
title: HackTool - EDRSilencer Execution
