author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2024/05/10
description: 'Detects the recovery of files from backups via "wbadmin.exe".

  Attackers can restore sensitive files such as NTDS.DIT or Registry Hives from backups
  in order to potentially extract credentials.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' recovery'
    - recoveryTarget
    - itemtype:File
  selection_img:
  - Image|endswith: \wbadmin.exe
  - OriginalFileName: WBADMIN.EXE
falsepositives:
- Unknown
id: 6fe4aa1e-0531-4510-8be2-782154b73b48
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/wbadmin-start-recovery
- https://lolbas-project.github.io/lolbas/Binaries/Wbadmin/
related:
- id: 84972c80-251c-4c3a-9079-4f00aad93938
  type: derived
status: experimental
tags:
- attack.impact
- attack.t1490
title: File Recovery From Backup Via Wbadmin.EXE
