author: Avneet Singh @v3t0_, oscd.community
date: 2020/10/18
description: Detects potential DLL injection and execution using "Tracker.exe"
detection:
  condition: all of selection_* and not 1 of filter_*
  filter_msbuild1:
    CommandLine|contains: ' /ERRORREPORT:PROMPT '
  filter_msbuild2:
    ParentImage|endswith:
    - \Msbuild\Current\Bin\MSBuild.exe
    - \Msbuild\Current\Bin\amd64\MSBuild.exe
  selection_cli:
    CommandLine|contains:
    - ' /d '
    - ' /c '
  selection_img:
  - Image|endswith: \tracker.exe
  - Description: Tracker
falsepositives:
- Unknown
id: 148431ce-4b70-403d-8525-fcc2993f29ea
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/01/09
references:
- https://lolbas-project.github.io/lolbas/OtherMSBinaries/Tracker/
status: test
tags:
- attack.defense_evasion
- attack.t1055.001
title: Potential DLL Injection Or Execution Using Tracker.exe
