author: Sai Prashanth Pulisetti @pulisettis, Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/27
description: Detects execution of the SharpImpersonation tool. Which can be used to
  manipulate tokens on a Windows computers remotely (PsExec/WmiExec) or interactively
detection:
  condition: 1 of selection_*
  selection_cli:
  - CommandLine|contains|all:
    - ' user:'
    - ' binary:'
  - CommandLine|contains|all:
    - ' user:'
    - ' shellcode:'
  - CommandLine|contains:
    - ' technique:CreateProcessAsUserW'
    - ' technique:ImpersonateLoggedOnuser'
  selection_img:
  - Image|endswith: \SharpImpersonation.exe
  - OriginalFileName: SharpImpersonation.exe
falsepositives:
- Unknown
id: f89b08d0-77ad-4728-817b-9b16c5a69c7a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/13
references:
- https://s3cur3th1ssh1t.github.io/SharpImpersonation-Introduction/
- https://github.com/S3cur3Th1sSh1t/SharpImpersonation
related:
- id: cf0c254b-22f1-4b2b-8221-e137b3c0af94
  type: similar
status: test
tags:
- attack.privilege_escalation
- attack.defense_evasion
- attack.t1134.001
- attack.t1134.003
title: HackTool - SharpImpersonation Execution
