author: frack113
date: 2021/12/13
description: 'Detects usage of the "dir" command part of Widows CMD with the "/S"
  command line flag in order to enumerate files in a specified directory and all subdirectories.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: dir*-s
  selection_cmd:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
falsepositives:
- Likely
id: 7c9340a9-e2ee-4e43-94c5-c54ebbea1006
level: low
logsource:
  category: process_creation
  product: windows
modified: 2024/04/14
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1217/T1217.md
status: test
tags:
- attack.discovery
- attack.t1217
title: File And SubFolder Enumeration Via Dir Command
