author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/18
description: Detects potential RDP connection via Mstsc using a local ".rdp" file
  located in suspicious locations.
detection:
  condition: all of selection_*
  selection_img:
  - Image|endswith: \mstsc.exe
  - OriginalFileName: mstsc.exe
  selection_parent:
    ParentImage|endswith:
    - \brave.exe
    - \CCleanerBrowser.exe
    - \chrome.exe
    - \chromium.exe
    - \firefox.exe
    - \iexplore.exe
    - \microsoftedge.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
    - \whale.exe
    - \outlook.exe
falsepositives:
- Unlikely
id: ff3b6b39-e765-42f9-bb2c-ea6761e0e0f6
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/04/18
references:
- https://www.blackhillsinfosec.com/rogue-rdp-revisiting-initial-access-methods/
- https://blog.thickmints.dev/mintsights/detecting-rogue-rdp/
status: test
tags:
- attack.lateral_movement
title: Mstsc.EXE Execution From Uncommon Parent
