author: Arun Chauhan
date: 2023/02/03
description: Detects nltest commands that can be used for information discovery
detection:
  condition: selection
  selection:
  - Image|endswith: \nltest.exe
  - OriginalFileName: nltestrk.exe
falsepositives:
- Legitimate administration activity
id: 903076ff-f442-475a-b667-4f246bcc203b
level: low
logsource:
  category: process_creation
  product: windows
references:
- https://jpcertcc.github.io/ToolAnalysisResultSheet/details/nltest.htm
related:
- id: 5cc90652-4cbd-4241-aa3b-4b462fa5a248
  type: similar
- id: eeb66bbb-3dde-4582-815a-584aee9fe6d1
  type: obsoletes
status: test
tags:
- attack.discovery
- attack.t1016
- attack.t1018
- attack.t1482
title: Nltest.EXE Execution
