author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/07/27
description: Detects execution of "curl.exe" with the "-c" flag in order to save cookie
  data.
detection:
  condition: all of selection_*
  selection_cli:
  - CommandLine|re: \s-c\s
  - CommandLine|contains: --cookie-jar
  selection_img:
  - Image|endswith: \curl.exe
  - OriginalFileName: curl.exe
falsepositives:
- Unknown
id: 5a6e1e16-07de-48d8-8aae-faa766c05e88
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://curl.se/docs/manpage.html
status: test
tags:
- attack.execution
title: Potential Cookies Session Hijacking
