author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/25
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
  from a potentially suspicious location
detection:
  condition: all of selection_*
  selection_dir:
    CommandLine|contains:
    - \AppData\Local\Temp\
    - \Microsoft\Windows\Start Menu\Programs\Startup\
    - \PerfLogs\
    - \Users\Public\
    - \Windows\Temp\
  selection_img:
  - Image|endswith:
    - \Regsvcs.exe
    - \Regasm.exe
  - OriginalFileName:
    - RegSvcs.exe
    - RegAsm.exe
falsepositives:
- Unknown
id: cc368ed0-2411-45dc-a222-510ace303cb2
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/13
references:
- https://www.fortiguard.com/threat-signal-report/4718?s=09
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
related:
- id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1218.009
title: Potentially Suspicious Execution Of Regasm/Regsvcs From Uncommon Location
