author: Swachchhanda Shrawan Poudel
date: 2024/02/12
description: 'Detects the enumeration of a specific DLL or EXE being used by a binary
  via "tasklist.exe".

  This is often used by attackers in order to find the specific process identifier
  (PID) that is using the DLL in question.

  In order to dump the process memory or perform other nefarious actions.

  '
detection:
  condition: all of selection_*
  selection_flags:
    CommandLine|contains|windash: -m
  selection_img:
  - Image|endswith: \tasklist.exe
  - OriginalFileName: tasklist.exe
  selection_module:
    CommandLine|contains: rdpcorets.dll
falsepositives:
- Unknown
id: 34275eb8-fa19-436b-b959-3d9ecd53fa1f
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/13
references:
- https://www.n00py.io/2021/05/dumping-plaintext-rdp-credentials-from-svchost-exe/
- https://pentestlab.blog/tag/svchost/
status: experimental
tags:
- attack.t1003
title: Loaded Module Enumeration Via Tasklist.EXE
