author: Tim Rauch, Elastic (idea)
date: 2022/09/14
description: Detects attempts to disable the Windows Firewall using PowerShell
detection:
  condition: all of selection_*
  selection_args:
    CommandLine|contains|all:
    - 'Set-NetFirewallProfile '
    - ' -Enabled '
    - ' False'
  selection_name:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    - \powershell_ise.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_opt:
    CommandLine|contains:
    - ' -All '
    - Public
    - Domain
    - Private
falsepositives:
- Unknown
id: 12f6b752-042d-483e-bf9c-915a6d06ad75
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/13
references:
- https://www.elastic.co/guide/en/security/current/windows-firewall-disabled-via-powershell.html
related:
- id: 488b44e7-3781-4a71-888d-c95abfacf44d
  type: similar
status: test
tags:
- attack.defense_evasion
- attack.t1562
title: Windows Firewall Disabled via PowerShell
