author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/12
description: 'Detects inline Windows shell commands redirecting output via the ">"
  symbol to a suspicious location.

  This technique is sometimes used by malicious actors in order to redirect the output
  of reconnaissance commands such as "hostname" and "dir" to files for future exfiltration.

  '
detection:
  condition: selection_img and 1 of selection_cli_*
  selection_cli_1:
    CommandLine|contains:
    - '>?%APPDATA%\'
    - '>?%TEMP%\'
    - '>?%TMP%\'
    - '>?%USERPROFILE%\'
    - '>?C:\ProgramData\'
    - '>?C:\Temp\'
    - '>?C:\Users\Public\'
    - '>?C:\Windows\Temp\'
  selection_cli_2:
    CommandLine|contains:
    - ' >'
    - '">'
    - '''>'
    CommandLine|contains|all:
    - C:\Users\
    - \AppData\Local\
  selection_img:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
falsepositives:
- Legitimate admin or third party scripts used for diagnostic collection might generate
  some false positives
id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/19
references:
- https://thedfirreport.com/2022/07/11/select-xmrig-from-sqlserver/
related:
- id: aa2efee7-34dd-446e-8a37-40790a66efd7
  type: derived
- id: 4f4eaa9f-5ad4-410c-a4be-bc6132b0175a
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Potentially Suspicious CMD Shell Output Redirect
