author: Sreeman, Nasreddine Bencherchali (Nextron Systems)
date: 2020/01/13
description: Adversaries can use curl to download payloads remotely and execute them.
  Curl is included by default in Windows 10 build 17063 and later.
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - 'curl '
    - http
    - -o
    - '&'
    CommandLine|contains|windash: ' -c '
falsepositives:
- Unknown
id: 21dd6d38-2b18-4453-9404-a0fe4a0cc288
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/03/05
references:
- https://medium.com/@reegun/curl-exe-is-the-new-rundll32-exe-lolbin-3f79c5f35983
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.command_and_control
- attack.t1105
title: Curl Download And Execute Combination
