author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2021/12/26
description: Detects when adversaries stop services or processes by disabling their
  respective scheduled tasks in order to conduct data destructive activities
detection:
  condition: selection
  selection:
    CommandLine|contains:
    - \Windows\BitLocker
    - \Windows\ExploitGuard
    - \Windows\SystemRestore\SR
    - \Windows\UpdateOrchestrator\
    - \Windows\Windows Defender\
    - \Windows\WindowsBackup\
    - \Windows\WindowsUpdate\
    CommandLine|contains|all:
    - /Change
    - /TN
    - /disable
    Image|endswith: \schtasks.exe
falsepositives:
- Unknown
id: 9ac94dc8-9042-493c-ba45-3b5e7c86b980
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/09/02
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-8---windows---disable-the-sr-scheduled-task
- https://twitter.com/MichalKoczwara/status/1553634816016498688
- https://thedfirreport.com/2021/10/18/icedid-to-xinglocker-ransomware-in-24-hours/
related:
- id: 7595ba94-cf3b-4471-aa03-4f6baa9e5fad
  type: similar
status: test
tags:
- attack.impact
- attack.t1489
title: Disable Important Scheduled Task
