author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/10
description: Detects usage of 7zip utilities (7z.exe, 7za.exe and 7zr.exe) to extract
  password protected zip files.
detection:
  condition: all of selection_*
  selection_img:
  - Description|contains: 7-Zip
  - Image|endswith:
    - \7z.exe
    - \7zr.exe
    - \7za.exe
  - OriginalFileName:
    - 7z.exe
    - 7za.exe
  selection_password:
    CommandLine|contains|all:
    - ' -p'
    - ' x '
    - ' -o'
falsepositives:
- Legitimate activity is expected since extracting files with a password can be common
  in some environment.
id: b717b8fd-6467-4d7d-b3d3-27f9a463af77
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://blog.cyble.com/2022/06/07/bumblebee-loader-on-the-rise/
status: test
tags:
- attack.collection
- attack.t1560.001
title: Password Protected Compressed File Extraction Via 7Zip
