author: Cian Heasley
date: 2020/08/13
description: In Kaspersky's 2020 Incident Response Analyst Report they listed legitimate
  tool "Mouse Lock" as being used for both credential access and collection in security
  incidents.
detection:
  condition: selection
  selection:
  - Product|contains: Mouse Lock
  - Company|contains: Misc314
  - CommandLine|contains: Mouse Lock_
falsepositives:
- Legitimate uses of Mouse Lock software
fields:
- Product
- Company
- CommandLine
id: c9192ad9-75e5-43eb-8647-82a0a5b493e3
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/21
references:
- https://github.com/klsecservices/Publications/blob/657deb6a6eb6e00669afd40173f425fb49682eaa/Incident-Response-Analyst-Report-2020.pdf
- https://sourceforge.net/projects/mouselock/
status: test
tags:
- attack.credential_access
- attack.collection
- attack.t1056.002
title: PUA - Mouse Lock Execution
