author: X__Junior (Nextron Systems)
date: 2024/03/11
description: Detects the execution of a renamed "NirCmd.exe" binary based on the PE
  metadata fields.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_img:
    Image|endswith:
    - \nircmd.exe
    - \nircmdc.exe
  selection:
    OriginalFileName: NirCmd.exe
falsepositives:
- Unknown
id: 264982dc-dbad-4dce-b707-1e0d3e0f73d9
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
- https://www.nirsoft.net/utils/nircmd.html
status: experimental
tags:
- attack.execution
- attack.t1059
- attack.defense_evasion
- attack.t1202
title: Renamed NirCmd.EXE Execution
