author: Andreas Hunkeler (@Karneades), Florian Roth
date: 2021/12/17
description: Detects suspicious processes spawned from a Java host process which could
  indicate a sign of exploitation (e.g. log4j)
detection:
  condition: selection
  selection:
    Image|endswith:
    - \AppVLP.exe
    - \bitsadmin.exe
    - \certutil.exe
    - \cscript.exe
    - \curl.exe
    - \forfiles.exe
    - \hh.exe
    - \mftrace.exe
    - \mshta.exe
    - \net.exe
    - \net1.exe
    - \query.exe
    - \reg.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \schtasks.exe
    - \scrcons.exe
    - \scriptrunner.exe
    - \sh.exe
    - \systeminfo.exe
    - \whoami.exe
    - \wmic.exe
    - \wscript.exe
    ParentImage|endswith: \java.exe
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/01/18
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
related:
- id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
  type: similar
status: experimental
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
title: Suspicious Processes Spawned by Java.EXE
