author: frack113
date: 2021/11/24
description: 'Detects execution of Microsoft bash launcher with the "-c" flag.

  This can be used to potentially bypass defenses and execute Linux or Windows-based
  binaries directly via bash.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: ' -c '
  selection_img:
  - Image|endswith:
    - :\Windows\System32\bash.exe
    - :\Windows\SysWOW64\bash.exe
  - OriginalFileName: Bash.exe
falsepositives:
- Unknown
id: 5edc2273-c26f-406c-83f3-f4d948e740dd
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/08/15
references:
- https://lolbas-project.github.io/lolbas/Binaries/Bash/
related:
- id: 2d22a514-e024-4428-9dba-41505bd63a5b
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1202
title: Indirect Inline Command Execution Via Bash.EXE
