author: Florian Roth (Nextron Systems)
date: 2023/05/08
description: Detects the execution of System Informer, a task manager tool to view
  and manipulate processes, kernel options and other low level operations
detection:
  condition: 1 of selection_*
  selection_hash_values:
  - md5: 19426363A37C03C3ED6FEDF57B6696EC
  - sha1: 8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
  - sha256: 8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
  - Imphash: B68908ADAEB5D662F87F2528AF318F12
  selection_hashes:
    Hashes|contains:
    - MD5=19426363A37C03C3ED6FEDF57B6696EC
    - SHA1=8B12C6DA8FAC0D5E8AB999C31E5EA04AF32D53DC
    - SHA256=8EE9D84DE50803545937A63C686822388A3338497CDDB660D5D69CF68B68F287
    - IMPHASH=B68908ADAEB5D662F87F2528AF318F12
  selection_image:
  - Image|endswith: \SystemInformer.exe
  - OriginalFileName: SystemInformer.exe
  - Description: System Informer
  - Product: System Informer
falsepositives:
- System Informer is regularly used legitimately by system administrators or developers.
  Apply additional filters accordingly
id: 5722dff1-4bdd-4949-86ab-fbaf707e767a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://github.com/winsiderss/systeminformer
related:
- id: 811e0002-b13b-4a15-9d00-a613fce66e42
  type: similar
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.discovery
- attack.defense_evasion
- attack.t1082
- attack.t1564
- attack.t1543
title: PUA - System Informer Execution
