author: Nasreddine Bencherchali
date: 2023/02/07
description: Detects execution of a renamed autohotkey.exe binary based on PE metadata
  fields
detection:
  condition: selection and not filter
  filter:
  - Image|endswith:
    - \AutoHotkey.exe
    - \AutoHotkey32.exe
    - \AutoHotkey32_UIA.exe
    - \AutoHotkey64.exe
    - \AutoHotkey64_UIA.exe
    - \AutoHotkeyA32.exe
    - \AutoHotkeyA32_UIA.exe
    - \AutoHotkeyU32.exe
    - \AutoHotkeyU32_UIA.exe
    - \AutoHotkeyU64.exe
    - \AutoHotkeyU64_UIA.exe
  - Image|contains: \AutoHotkey
  selection:
  - Product|contains: AutoHotkey
  - Description|contains: AutoHotkey
  - OriginalFileName:
    - AutoHotkey.exe
    - AutoHotkey.rc
falsepositives:
- Unknown
id: 0f16d9cf-0616-45c8-8fad-becc11b5a41c
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.autohotkey.com/download/
- https://thedfirreport.com/2023/02/06/collect-exfiltrate-sleep-repeat/
status: test
tags:
- attack.defense_evasion
title: Renamed AutoHotkey.EXE Execution
