author: Nasreddine Bencherchali (Nextron Systems), Michael McKinley (@McKinleyMike),
  Tony Latteri (@TheLatteri)
date: 2023/09/18
description: 'Detects execution of the Add-In deployment cache updating utility (AddInutil.exe)
  with suspicious Addinroot or Pipelineroot paths. An adversary may execute AddinUtil.exe
  with uncommon Addinroot/Pipelineroot paths that point to the adversaries Addins.Store
  payload.

  '
detection:
  condition: selection_img and (all of selection_susp_1_* or selection_susp_2)
  selection_img:
  - Image|endswith: \addinutil.exe
  - OriginalFileName: AddInUtil.exe
  selection_susp_1_flags:
    CommandLine|contains:
    - '-AddInRoot:'
    - '-PipelineRoot:'
  selection_susp_1_paths:
    CommandLine|contains:
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Users\Public\
    - \Windows\Temp\
  selection_susp_2:
    CommandLine|contains:
    - -AddInRoot:.
    - -AddInRoot:"."
    - -PipelineRoot:.
    - -PipelineRoot:"."
    CurrentDirectory|contains:
    - \AppData\Local\Temp\
    - \Desktop\
    - \Downloads\
    - \Users\Public\
    - \Windows\Temp\
falsepositives:
- Unknown
id: 631b22a4-70f4-4e2f-9ea8-42f84d9df6d8
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Suspicious AddinUtil.EXE CommandLine Execution
