author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/25
description: Detects suspicious children spawned via the Windows Terminal application
  which could be a sign of persistence via WindowsTerminal (see references section)
detection:
  condition: all of selection_* and not 1 of filter_*
  filter_builtin_visual_studio_shell:
    CommandLine|contains|all:
    - Import-Module
    - Microsoft.VisualStudio.DevShell.dll
    - Enter-VsDevShell
  filter_open_settings:
    CommandLine|contains|all:
    - \AppData\Local\Packages\Microsoft.WindowsTerminal_
    - \LocalState\settings.json
  filter_vsdevcmd:
    CommandLine|contains|all:
    - C:\Program Files\Microsoft Visual Studio\
    - \Common7\Tools\VsDevCmd.bat
  selection_parent:
    ParentImage|endswith:
    - \WindowsTerminal.exe
    - \wt.exe
  selection_susp:
  - Image|endswith:
    - \rundll32.exe
    - \regsvr32.exe
    - \certutil.exe
    - \cscript.exe
    - \wscript.exe
    - \csc.exe
  - Image|contains:
    - C:\Users\Public\
    - \Downloads\
    - \Desktop\
    - \AppData\Local\Temp\
    - \Windows\TEMP\
  - CommandLine|contains:
    - ' iex '
    - ' icm'
    - Invoke-
    - 'Import-Module '
    - 'ipmo '
    - DownloadString(
    - ' /c '
    - ' /k '
    - ' /r '
falsepositives:
- Other legitimate "Windows Terminal" profiles
id: 8de89e52-f6e1-4b5b-afd1-41ecfa300d48
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://persistence-info.github.io/Data/windowsterminalprofile.html
- https://twitter.com/nas_bench/status/1550836225652686848
status: test
tags:
- attack.execution
- attack.persistence
title: Suspicious WindowsTerminal Child Processes
