author: Tim Rauch, Elastic, E.M. Anhaus (originally from Atomic Blue Detections, Endgame),
  oscd.community
date: 2022/06/14
description: 'Detects the execution of "forfiles" with the "/c" flag.

  While this is an expected behavior of the tool, it can be abused in order to proxy
  execution through it with any binary.

  Can be used to bypass application whitelisting.

  '
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: ' -c '
  selection_img:
  - Image|endswith: \forfiles.exe
  - OriginalFileName: forfiles.exe
falsepositives:
- Legitimate use via a batch script or by an administrator.
id: 9aa5106d-bce3-4b13-86df-3a20f1d5cf0b
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/05
references:
- https://lolbas-project.github.io/lolbas/Binaries/Forfiles/
- https://pentestlab.blog/2020/07/06/indirect-command-execution/
related:
- id: a85cf4e3-56ee-4e79-adeb-789f8fb209a8
  type: obsoletes
- id: fa47597e-90e9-41cd-ab72-c3b74cfb0d02
  type: obsoletes
status: test
tags:
- attack.execution
- attack.t1059
title: Forfiles Command Execution
