author: '@SerkinValery'
date: 2022/09/16
description: 'Detects a commandline containing references to the Microsoft Teams database
  or cookies files from a process other than Teams.

  The database might contain authentication tokens and other sensitive information
  about the logged in accounts.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_legit_locations:
    Image|endswith: \Microsoft\Teams\current\Teams.exe
  selection:
    CommandLine|contains:
    - \Microsoft\Teams\Cookies
    - \Microsoft\Teams\Local Storage\leveldb
falsepositives:
- Unknown
id: d2eb17db-1d39-41dc-b57f-301f6512fa75
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/12/18
references:
- https://www.bleepingcomputer.com/news/security/microsoft-teams-stores-auth-tokens-as-cleartext-in-windows-linux-macs/
- https://www.vectra.ai/blogpost/undermining-microsoft-teams-security-by-mining-tokens
status: experimental
tags:
- attack.credential_access
- attack.t1528
title: Potentially Suspicious Command Targeting Teams Sensitive Files
