author: Florian Roth (Nextron Systems)
date: 2019/01/16
description: Detects suspicious powershell invocations from interpreters or unusual
  programs
detection:
  condition: selection and not 1 of filter_*
  filter_health_service:
    CurrentDirectory|contains: \Health Service State\
  selection:
    Image|endswith:
    - \powershell.exe
    - \pwsh.exe
    ParentImage|endswith:
    - \wscript.exe
    - \cscript.exe
falsepositives:
- Microsoft Operations Manager (MOM)
- Other scripts
id: 95eadcb2-92e4-4ed1-9031-92547773a6db
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/01/05
references:
- https://www.securitynewspaper.com/2017/03/20/attackers-leverage-excel-powershell-dns-latest-non-malware-attack/
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocation From Script Engines
