author: Nasreddine Bencherchali (Nextron Systems)
date: 2021/12/18
description: Detects the use of Advanced Port Scanner.
detection:
  condition: 1 of selection_*
  selection_cli:
    CommandLine|contains|all:
    - /portable
    - /lng
  selection_img:
  - Image|contains: \advanced_port_scanner
  - OriginalFileName|contains: advanced_port_scanner
  - Description|contains: Advanced Port Scanner
falsepositives:
- Legitimate administrative use
- Tools with similar commandline (very rare)
id: 54773c5f-f1cc-4703-9126-2f797d96a69d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/07
references:
- https://github.com/3CORESec/MAL-CL/tree/master/Descriptors/Other/Advanced%20Port%20Scanner
status: test
tags:
- attack.discovery
- attack.t1046
- attack.t1135
title: PUA - Advanced Port Scanner Execution
