author: Florian Roth (Nextron Systems)
date: 2019/01/16
description: Detects the creation of scheduled tasks by user accounts via the "schtasks"
  utility.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_system_user:
    User|contains:
    - AUTHORI
    - AUTORI
  selection:
    CommandLine|contains: ' /create '
    Image|endswith: \schtasks.exe
falsepositives:
- Administrative activity
- Software installation
id: 92626ddd-662c-49e3-ac59-f6535f12d189
level: low
logsource:
  category: process_creation
  product: windows
modified: 2024/01/18
references:
- https://learn.microsoft.com/en-us/windows-server/administration/windows-commands/schtasks-create
status: test
tags:
- attack.execution
- attack.persistence
- attack.privilege_escalation
- attack.t1053.005
- attack.s0111
- car.2013-08-001
- stp.1u
title: Scheduled Task Creation Via Schtasks.EXE
