author: Sreeman
date: 2020/04/17
description: 'HxTsr.exe is a Microsoft compressed executable file called Microsoft
  Outlook Communications.

  HxTsr.exe is part of Outlook apps, because it resides in a hidden "WindowsApps"
  subfolder of "C:\Program Files".

  Any instances of hxtsr.exe not in this folder may be malware camouflaging itself
  as HxTsr.exe

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_hxtsr:
    Image|contains: :\program files\windowsapps\microsoft.windowscommunicationsapps_
    Image|endswith: \hxtsr.exe
  selection:
    Image|endswith: \hxtsr.exe
falsepositives:
- Unknown
id: 4e762605-34a8-406d-b72e-c1a089313320
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/02/08
references:
- Internal Research
status: test
tags:
- attack.defense_evasion
- attack.t1036
title: Potential Fake Instance Of Hxtsr.EXE Executed
