author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/20
description: Detects known WMI recon method to look for unquoted service paths using
  wmic. Often used by pentester and attacker enumeration scripts
detection:
  condition: all of selection*
  selection_cli:
    CommandLine|contains|all:
    - ' service get '
    - name,displayname,pathname,startmode
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: 68bcd73b-37ef-49cb-95fc-edc809730be6
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/09/11
references:
- https://github.com/nccgroup/redsnarf/blob/35949b30106ae543dc6f2bc3f1be10c6d9a8d40e/redsnarf.py
- https://github.com/S3cur3Th1sSh1t/Creds/blob/eac23d67f7f90c7fc8e3130587d86158c22aa398/PowershellScripts/jaws-enum.ps1
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
related:
- id: 09658312-bc27-4a3b-91c5-e49ab9046d1b
  type: similar
- id: 76f55eaa-d27f-4213-9d45-7b0e4b60bbae
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1047
title: Potential Unquoted Service Path Reconnaissance Via Wmic.EXE
