author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/03/09
description: Detects updates to Sysmon's configuration. Attackers might update or
  replace the Sysmon configuration with a bare bone one to avoid monitoring without
  shutting down the service completely
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: -c
  selection_pe:
  - Image|endswith:
    - \Sysmon64.exe
    - \Sysmon.exe
  - Description: System activity monitor
falsepositives:
- Legitimate administrators might use this command to update Sysmon configuration.
id: 87911521-7098-470b-a459-9a57fc80bdfd
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/13
references:
- https://learn.microsoft.com/en-us/sysinternals/downloads/sysmon
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Sysmon Configuration Update
