author: Christian Burkard (Nextron Systems)
date: 2021/09/20
description: 'Detects the execution of Xwizard tool from a non-default directory.

  When executed from a non-default directory, this utility can be abused in order
  to side load a custom version of "xwizards.dll".

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_legit_location:
    Image|startswith:
    - C:\Windows\System32\
    - C:\Windows\SysWOW64\
  selection:
  - Image|endswith: \xwizard.exe
  - OriginalFileName: xwizard.exe
falsepositives:
- Windows installed on non-C drive
id: 193d5ccd-6f59-40c6-b5b0-8e32d5ddd3d1
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/04/22
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- http://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
status: test
tags:
- attack.defense_evasion
- attack.t1574.002
title: Xwizard.EXE Execution From Non-Default Location
