author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/05/15
description: Detects Wscript/Cscript executing a file with an uncommon (i.e. non-script)
  extension
detection:
  condition: all of selection_*
  selection_extension:
    CommandLine|contains:
    - .csv
    - .dat
    - .doc
    - .gif
    - .jpeg
    - .jpg
    - .png
    - .ppt
    - .txt
    - .xls
    - .xml
  selection_img:
  - OriginalFileName:
    - wscript.exe
    - cscript.exe
  - Image|endswith:
    - \wscript.exe
    - \cscript.exe
falsepositives:
- Unknown
id: 99b7460d-c9f1-40d7-a316-1f36f61d52ee
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/06/19
references:
- Internal Research
status: test
tags:
- attack.execution
- attack.t1059.005
- attack.t1059.007
title: Cscript/Wscript Uncommon Script Extension Execution
