author: '@d4ns4n_ (Wuerth-Phoenix)'
date: 2024/04/25
description: 'Detects usage of SoftPerfect''s "netscan.exe". An application for scanning
  networks.

  It is actively used in-the-wild by threat actors to inspect and understand the network
  architecture of a victim.

  '
detection:
  condition: selection
  selection:
  - Image|endswith: \netscan.exe
  - Product: Network Scanner
  - Description: Application for scanning networks
falsepositives:
- Legitimate administrator activity
id: ca387a8e-1c84-4da3-9993-028b45342d30
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.protect.airbus.com/blog/uncovering-cyber-intruders-netscan/
- https://secjoes-reports.s3.eu-central-1.amazonaws.com/Sockbot%2Bin%2BGoLand.pdf
- https://www.sentinelone.com/labs/black-basta-ransomware-attacks-deploy-custom-edr-evasion-tools-tied-to-fin7-threat-actor/
- https://symantec-enterprise-blogs.security.com/blogs/threat-intelligence/yanluowang-ransomware-attacks-continue
- https://research.nccgroup.com/2022/07/13/climbing-mount-everest-black-byte-bytes-back/
- https://www.bleepingcomputer.com/news/security/microsoft-exchange-servers-hacked-to-deploy-hive-ransomware/
- https://www.softperfect.com/products/networkscanner/
status: experimental
tags:
- attack.discovery
- attack.t1046
title: PUA - SoftPerfect Netscan Execution
