author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/06/20
description: Detects the execution of wmic with the "qfe" flag in order to obtain
  information about installed hotfix updates on the system. This is often used by
  pentester and attacker enumeration scripts
detection:
  condition: all of selection*
  selection_cli:
    CommandLine|contains: ' qfe'
  selection_img:
  - OriginalFileName: wmic.exe
  - Image|endswith: \WMIC.exe
falsepositives:
- Unknown
id: dfd2fcb7-8bd5-4daa-b132-5adb61d6ad45
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://github.com/carlospolop/PEASS-ng/blob/fa0f2e17fbc1d86f1fd66338a40e665e7182501d/winPEAS/winPEASbat/winPEAS.bat
- https://sushant747.gitbooks.io/total-oscp-guide/content/privilege_escalation_windows.html
status: test
tags:
- attack.execution
- attack.t1047
title: Windows Hotfix Updates Reconnaissance Via Wmic.EXE
