author: frack113
date: 2022/08/20
description: Detects the use of TruffleSnout.exe an iterative AD discovery toolkit
  for offensive operators, situational awareness and targeted low noise enumeration.
detection:
  condition: selection
  selection:
  - OriginalFileName: TruffleSnout.exe
  - Image|endswith: \TruffleSnout.exe
falsepositives:
- Unknown
id: 69ca006d-b9a9-47f5-80ff-ecd4d25d481a
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/40b77d63808dd4f4eafb83949805636735a1fd15/atomics/T1482/T1482.md
- https://github.com/dsnezhkov/TruffleSnout
- https://github.com/dsnezhkov/TruffleSnout/blob/master/TruffleSnout/Docs/USAGE.md
status: test
tags:
- attack.discovery
- attack.t1482
title: HackTool - TruffleSnout Execution
