author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2021/05/22
description: Detects unknown program using commandline flags usually used by tools
  such as PsExec and PAExec to start programs with SYSTEM Privileges
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_exclude_coverage:
    CommandLine|contains:
    - paexec
    - PsExec
    - accepteula
  selection:
    CommandLine|contains|windash:
    - ' -s cmd'
    - ' -s -i cmd'
    - ' -i -s cmd'
    - ' -s pwsh'
    - ' -s -i pwsh'
    - ' -i -s pwsh'
    - ' -s powershell'
    - ' -s -i powershell'
    - ' -i -s powershell'
falsepositives:
- Weird admins that rename their tools
- Software companies that bundle PsExec/PAExec with their software and rename it,
  so that it is less embarrassing
id: 207b0396-3689-42d9-8399-4222658efc99
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/03/05
references:
- https://docs.microsoft.com/en-us/sysinternals/downloads/psexec
- https://www.poweradmin.com/paexec/
- https://www.fireeye.com/blog/threat-research/2020/10/kegtap-and-singlemalt-with-a-ransomware-chaser.html
related:
- id: 8834e2f7-6b4b-4f09-8906-d2276470ee23
  type: similar
status: test
tags:
- attack.resource_development
- attack.t1587.001
title: Potential Privilege Escalation To LOCAL SYSTEM
