author: frack113
date: 2022/01/12
description: Detects the removal of Sysmon, which could be a potential attempt at
  defense evasion
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|windash: -u
  selection_pe:
  - Image|endswith:
    - \Sysmon64.exe
    - \Sysmon.exe
  - Description: System activity monitor
falsepositives:
- Legitimate administrators might use this command to remove Sysmon for debugging
  purposes
id: 6a5f68d1-c4b5-46b9-94ee-5324892ea939
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/03/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1562.001/T1562.001.md#atomic-test-11---uninstall-sysmon
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Uninstall Sysinternals Sysmon
