author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/09/27
description: Detects execution of 7z in order to compress a file with a ".dmp"/".dump"
  extension, which could be a step in a process of dump file exfiltration.
detection:
  condition: all of selection_*
  selection_extension:
    CommandLine|contains:
    - .dmp
    - .dump
    - .hdmp
  selection_img:
  - Description|contains: 7-Zip
  - Image|endswith:
    - \7z.exe
    - \7zr.exe
    - \7za.exe
  - OriginalFileName:
    - 7z.exe
    - 7za.exe
falsepositives:
- Legitimate use of 7z with a command line in which ".dmp" or ".dump" appears accidentally
- Legitimate use of 7z to compress WER ".dmp" files for troubleshooting
id: ec570e53-4c76-45a9-804d-dc3f355ff7a7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/09/12
references:
- https://thedfirreport.com/2022/09/26/bumblebee-round-two/
related:
- id: 1ac14d38-3dfc-4635-92c7-e3fd1c5f5bfc
  type: derived
status: experimental
tags:
- attack.collection
- attack.t1560.001
title: 7Zip Compressing Dump Files
