author: Florian Roth (Nextron Systems)
date: 2019/10/01
description: Detects a suspicious program execution in Outlook temp folder
detection:
  condition: selection
  selection:
    Image|contains: \Temporary Internet Files\Content.Outlook\
falsepositives:
- Unknown
id: a018fdc3-46a3-44e5-9afb-2cd4af1d4b39
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/10/09
references:
- Internal Research
status: test
tags:
- attack.initial_access
- attack.t1566.001
title: Suspicious Execution From Outlook Temporary Folder
