author: Florian Roth (Nextron Systems)
date: 2022/10/14
description: Detects suspicious Windows Error Reporting manager (wermgr.exe) child
  process
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_rundll32:
    CommandLine|contains|all:
    - C:\Windows\system32\WerConCpl.dll
    - LaunchErcApp -queuereporting
    Image|endswith: \rundll32.exe
  selection:
    Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \ipconfig.exe
    - \mshta.exe
    - \net.exe
    - \net1.exe
    - \netstat.exe
    - \nslookup.exe
    - \powershell_ise.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \systeminfo.exe
    - \whoami.exe
    - \wscript.exe
    ParentImage|endswith: \wermgr.exe
falsepositives:
- Unknown
id: 396f6630-f3ac-44e3-bfc8-1b161bc00c4e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/06/20
references:
- https://www.trendmicro.com/en_us/research/22/j/black-basta-infiltrates-networks-via-qakbot-brute-ratel-and-coba.html
- https://www.echotrail.io/insights/search/wermgr.exe
- https://github.com/binderlabs/DirCreate2System
related:
- id: 5394fcc7-aeb2-43b5-9a09-cac9fc5edcd5
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055
- attack.t1036
title: Suspicious Child Process Of Wermgr.EXE
