author: Matthew Matchen
date: 2020/09/04
description: Detects the use of Windows Defender MpCmdRun.EXE to download files
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - DownloadFile
    - url
  selection_img:
  - OriginalFileName: MpCmdRun.exe
  - Image|endswith: \MpCmdRun.exe
  - CommandLine|contains: MpCmdRun.exe
  - Description: Microsoft Malware Protection Command Line Utility
falsepositives:
- Unknown
id: 46123129-1024-423e-9fae-43af4a0fa9a5
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/11/09
references:
- https://web.archive.org/web/20200903194959/https://twitter.com/djmtshepana/status/1301608169496612866
- https://lolbas-project.github.io/lolbas/Binaries/MpCmdRun/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.command_and_control
- attack.t1105
title: File Download Via Windows Defender MpCmpRun.EXE
