author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/12/02
description: Detects usage of wsudo (Windows Sudo Utility). Which is a tool that let
  the user execute programs with different permissions (System, Trusted Installer,
  Administrator...etc)
detection:
  condition: 1 of selection_*
  selection_cli:
    CommandLine|contains:
    - -u System
    - -uSystem
    - -u TrustedInstaller
    - -uTrustedInstaller
    - ' --ti '
  selection_metadata:
  - Image|endswith: \wsudo.exe
  - OriginalFileName: wsudo.exe
  - Description: Windows sudo utility
  - ParentImage|endswith: \wsudo-bridge.exe
falsepositives:
- Unknown
id: bdeeabc9-ff2a-4a51-be59-bb253aac7891
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/14
references:
- https://github.com/M2Team/Privexec/
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1059
title: PUA - Wsudo Suspicious Execution
