author: frack113
date: 2021/07/30
description: Once established within a system or network, an adversary may use automated
  techniques for collecting internal data.
detection:
  condition: all of selection*
  selection_image:
  - Image|endswith:
    - \tree.com
    - \WMIC.exe
    - \doskey.exe
    - \sc.exe
  - OriginalFileName:
    - wmic.exe
    - DOSKEY.EXE
    - sc.exe
  selection_redirect:
    ParentCommandLine|contains:
    - ' > %TEMP%\'
    - ' > %TMP%\'
falsepositives:
- Unknown
id: aa2efee7-34dd-446e-8a37-40790a66efd7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/09/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1119/T1119.md
related:
- id: 8e0bb260-d4b2-4fff-bb8d-3f82118e6892
  type: similar
status: test
tags:
- attack.collection
- attack.t1119
title: Recon Information for Export with Command Prompt
