author: Tim Shelton, Florian Roth (Nextron Systems), Yassine Oukessou
date: 2022/01/13
description: Detects the execution of rundll32 with a command line that doesn't contain
  a common extension
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_empty:
    CommandLine: ''
  filter_main_known_extension:
  - CommandLine|contains:
    - '.cpl '
    - .cpl,
    - .cpl"
    - .cpl'
    - '.dll '
    - .dll,
    - .dll"
    - .dll'
    - '.inf '
    - .inf,
    - .inf"
    - .inf'
  - CommandLine|endswith:
    - .cpl
    - .dll
    - '.inf'
  filter_main_localserver:
    CommandLine|contains: ' -localserver '
  filter_main_null:
    CommandLine: null
  filter_main_zzzzInvokeManagedCustomActionOutOfProc:
    CommandLine|contains|all:
    - :\Windows\Installer\
    - .tmp
    - zzzzInvokeManagedCustomActionOutOfProc
    ParentImage|endswith: \msiexec.exe
  filter_optional_EdgeUpdate:
    ParentCommandLine|contains|all:
    - :\Users\
    - \AppData\Local\Microsoft\EdgeUpdate\Install\{
    - \EDGEMITMP_
    - .tmp\setup.exe
    - --install-archive=
    - --previous-version=
    - --msedgewebview --verbose-logging --do-not-launch-msedge --user-level
  selection:
  - Image|endswith: \rundll32.exe
  - OriginalFileName: RUNDLL32.EXE
falsepositives:
- Unknown
id: c3a99af4-35a9-4668-879e-c09aeb4f2bdf
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/04/04
references:
- https://twitter.com/mrd0x/status/1481630810495139841?s=12
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.011
title: Rundll32 Execution With Uncommon DLL Extension
