author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/09
description: Detects usage of Gpg4win to decrypt files
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' -d '
    - passphrase
  selection_metadata:
  - Image|endswith:
    - \gpg.exe
    - \gpg2.exe
  - Description: "GnuPG\u2019s OpenPGP tool"
falsepositives:
- Unknown
id: 037dcd71-33a8-4392-bb01-293c94663e5a
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://blogs.vmware.com/security/2022/11/batloader-the-evasive-downloader-malware.html
- https://www.gpg4win.de/documentation.html
- https://news.sophos.com/en-us/2022/01/19/zloader-installs-remote-access-backdoors-and-delivers-cobalt-strike/
status: experimental
tags:
- attack.execution
title: File Decryption Using Gpg4win
