author: Aedan Russell, frack113, X__Junior (Nextron Systems)
date: 2022/06/19
description: Detects a suspicious process spawning a Chromium based browser process
  with the 'load-extension' flag to start an instance with a custom extension
detection:
  condition: selection
  selection:
    CommandLine|contains: --load-extension=
    Image|endswith:
    - \brave.exe
    - \chrome.exe
    - \msedge.exe
    - \opera.exe
    - \vivaldi.exe
    ParentImage|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
falsepositives:
- Unknown
id: 27ba3207-dd30-4812-abbf-5d20c57d474e
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/11/28
references:
- https://redcanary.com/blog/chromeloader/
- https://emkc.org/s/RJjuLa
- https://www.mandiant.com/resources/blog/lnk-between-browsers
related:
- id: 88d6e60c-759d-4ac1-a447-c0f1466c2d21
  type: similar
status: experimental
tags:
- attack.persistence
- attack.t1176
title: Suspicious Chromium Browser Instance Executed With Custom Extension
