author: Florian Roth (Nextron Systems), oscd.community, Jonhnathan Ribeiro
date: 2019/01/16
description: Detects a Powershell process that contains download commands in its command
  line string
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains:
    - string(
    - file(
    CommandLine|contains|all:
    - new-object
    - net.webclient).
    - download
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
falsepositives:
- Unknown
id: 3b6ab547-8ec2-4991-b9d2-2b06702a48d7
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/01/26
references:
- https://blog.redteam.pl/2020/06/black-kingdom-ransomware.html
- https://lab52.io/blog/winter-vivern-all-summer/
- https://hatching.io/blog/powershell-analysis/
related:
- id: e6c54d94-498c-4562-a37c-b469d8e9a275
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.001
title: PowerShell Download Pattern
