author: Tim Rauch, Elastic (idea)
date: 2022/09/20
description: Detects deletion of Windows Volume Shadow Copies with PowerShell code
  and Get-WMIObject. This technique is used by numerous ransomware families such as
  Sodinokibi/REvil
detection:
  condition: all of selection*
  selection_delete:
    CommandLine|contains:
    - .Delete()
    - Remove-WmiObject
    - rwmi
    - Remove-CimInstance
    - rcim
  selection_get:
    CommandLine|contains:
    - Get-WmiObject
    - gwmi
    - Get-CimInstance
    - gcim
  selection_shadowcopy:
    CommandLine|contains: Win32_ShadowCopy
falsepositives:
- Unknown
id: 21ff4ca9-f13a-41ad-b828-0077b2af2e40
level: high
logsource:
  category: process_creation
  product: windows
modified: 2022/12/30
references:
- https://github.com/redcanaryco/atomic-red-team/blob/f339e7da7d05f6057fdfcdd3742bfcf365fee2a9/atomics/T1490/T1490.md#atomic-test-5---windows---delete-volume-shadow-copies-via-wmi-with-powershell
- https://www.elastic.co/guide/en/security/current/volume-shadow-copy-deletion-via-powershell.html
related:
- id: e17121b4-ef2a-4418-8a59-12fb1631fa9e
  type: derived
- id: c1337eb8-921a-4b59-855b-4ba188ddcc42
  type: similar
status: test
tags:
- attack.impact
- attack.t1490
title: Deletion of Volume Shadow Copies via WMI with PowerShell
