author: Florian Roth (Nextron Systems)
date: 2022/08/04
description: Execution of plink to perform data exfiltration and tunneling
detection:
  condition: selection_a or all of selection_b*
  selection_a:
    CommandLine|contains: :127.0.0.1:3389
    Image|endswith: \plink.exe
  selection_b1:
    CommandLine|contains: :3389
    Image|endswith: \plink.exe
  selection_b2:
    CommandLine|contains:
    - ' -P 443'
    - ' -P 22'
falsepositives:
- Unknown
id: f38ce0b9-5e97-4b47-a211-7dc8d8b871da
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/01/27
references:
- https://www.microsoft.com/security/blog/2022/07/26/malicious-iis-extensions-quietly-open-persistent-backdoors-into-servers/
related:
- id: f7d7ebd5-a016-46e2-9c54-f9932f2d386d
  type: similar
status: test
tags:
- attack.command_and_control
- attack.t1572
title: Potential RDP Tunneling Via Plink
