author: Sreeman
date: 2021/06/11
description: 'Detects applications trying to modify the registry in order to disable
  any write-protect property for storage devices.

  This could be a precursor to a ransomware attack and has been an observed technique
  used by cypherpunk group.

  '
detection:
  condition: selection
  selection:
    CommandLine|contains|all:
    - \System\CurrentControlSet\Control
    - Write Protection
    - '0'
    - storage
falsepositives:
- Unknown
id: 75f7a0e2-7154-4c4d-9eae-5cdb4e0a5c13
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/01/18
references:
- https://www.manageengine.com/products/desktop-central/os-imaging-deployment/media-is-write-protected.html
status: test
tags:
- attack.defense_evasion
- attack.t1562
title: Write Protect For Storage Disabled
