author: Jason Rathbun (Blackpoint Cyber)
date: 2024/02/26
description: Detects potential web shell execution from the ScreenConnect server process.
detection:
  condition: selection
  selection:
    Image|endswith:
    - \cmd.exe
    - \csc.exe
    ParentImage|endswith: \ScreenConnect.Service.exe
falsepositives:
- Unlikely
id: b19146a3-25d4-41b4-928b-1e2a92641b1b
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://blackpointcyber.com/resources/blog/breaking-through-the-screen/
- https://www.connectwise.com/company/trust/security-bulletins/connectwise-screenconnect-23.9.8
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: Remote Access Tool - ScreenConnect Server Web Shell Execution
