author: X__Junior (Nextron Systems)
date: 2023/07/18
description: 'Detects uncommon and potentially suspicious one-liner command containing
  both "ping" and "copy" at the same time, which is usually used by malware.

  '
detection:
  condition: all of selection_*
  selection_action:
    CommandLine|contains|all:
    - ping
    - 'copy '
  selection_cli_1:
    CommandLine|contains|windash: ' -n '
  selection_cli_2:
    CommandLine|contains|windash: ' -y '
  selection_cmd:
  - Image|endswith: \cmd.exe
  - OriginalFileName: Cmd.Exe
falsepositives:
- Unknown
id: ded2b07a-d12f-4284-9b76-653e37b6c8b0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/03/06
references:
- Internal Research
status: experimental
tags:
- attack.defense_evasion
- attack.t1070.004
title: Potentially Suspicious Ping/Copy Command Combination
