author: frack113, Nasreddine Bencherchali
date: 2022/08/01
description: Detects the import of '.reg' files from suspicious paths using the 'reg.exe'
  utility
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains: ' import '
  selection_img:
  - Image|endswith: \reg.exe
  - OriginalFileName: reg.exe
  selection_paths:
    CommandLine|contains:
    - C:\Users\
    - '%temp%'
    - '%tmp%'
    - '%appdata%'
    - \AppData\Local\Temp\
    - C:\Windows\Temp\
    - C:\ProgramData\
falsepositives:
- Legitimate import of keys
id: 62e0298b-e994-4189-bc87-bc699aa62d97
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/05
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/reg-import
related:
- id: 73bba97f-a82d-42ce-b315-9182e76c57b1
  type: derived
status: test
tags:
- attack.t1112
- attack.defense_evasion
title: Potential Suspicious Registry File Imported Via Reg.EXE
