author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/02/13
description: Detects potentially suspicious execution of the Regasm/Regsvcs utilities
  with an uncommon extension.
detection:
  condition: all of selection_*
  selection_extension:
    CommandLine|contains:
    - .dat
    - .gif
    - .jpeg
    - .jpg
    - .png
    - .txt
  selection_img:
  - Image|endswith:
    - \Regsvcs.exe
    - \Regasm.exe
  - OriginalFileName:
    - RegSvcs.exe
    - RegAsm.exe
falsepositives:
- Unknown
id: e9f8f8cc-07cc-4e81-b724-f387db9175e4
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://www.fortiguard.com/threat-signal-report/4718?s=09
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
- https://lolbas-project.github.io/lolbas/Binaries/Regsvcs/
related:
- id: cc368ed0-2411-45dc-a222-510ace303cb2
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1218.009
title: Potentially Suspicious Execution Of Regasm/Regsvcs With Uncommon Extension
