author: Florian Roth (Nextron Systems)
date: 2017/08/15
description: Detects an uncommon svchost parent process
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    ParentImage|endswith:
    - \Mrt.exe
    - \MsMpEng.exe
    - \ngen.exe
    - \rpcnet.exe
    - \services.exe
    - \TiWorker.exe
  filter_main_parent_empty:
    ParentImage:
    - '-'
    - ''
  filter_main_parent_null:
    ParentImage: null
  selection:
    Image|endswith: \svchost.exe
falsepositives:
- Unknown
id: 01d2e2a1-5f09-44f7-9fc1-24faa7479b6d
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2022/06/28
references:
- Internal Research
status: test
tags:
- attack.defense_evasion
- attack.t1036.005
title: Uncommon Svchost Parent Process
