author: X__Junior (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022/12/15
description: Detects RAR usage that creates an archive from a suspicious folder, either
  a system folder or one of the folders often used by attackers for staging purposes
detection:
  condition: 1 of selection_opt_* and all of selection_cli_*
  selection_cli_flags:
    CommandLine|contains|all:
    - ' -hp'
    - ' -r '
  selection_cli_folders:
    CommandLine|contains:
    - ' ?:\\\*.'
    - ' ?:\\\\\*.'
    - ' ?:\$Recycle.bin\'
    - ' ?:\PerfLogs\'
    - ' ?:\Temp'
    - ' ?:\Users\Public\'
    - ' ?:\Windows\'
    - ' %public%'
  selection_opt_1:
  - Image|endswith: \rar.exe
  - Description: Command line RAR
  selection_opt_2:
    CommandLine|contains:
    - '.exe a '
    - ' a -m'
falsepositives:
- Unknown
id: afe52666-401e-4a02-b4ff-5d128990b8cb
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/01/02
references:
- https://decoded.avast.io/martinchlumecky/png-steganography
status: experimental
tags:
- attack.execution
- attack.t1059
title: Suspicious Greedy Compression Using Rar.EXE
