author: oscd.community, Teymur Kheirkhabarov @HeirhabarovT, Zach Stanford @svch0st,
  wagga
date: 2020/10/05
description: Detects when an admin share is mounted using net.exe
detection:
  condition: all of selection_*
  selection_cli:
    CommandLine|contains|all:
    - ' use '
    - ' \\\\*\\*$'
  selection_img:
  - Image|endswith:
    - \net.exe
    - \net1.exe
  - OriginalFileName:
    - net.exe
    - net1.exe
falsepositives:
- Administrators
id: 3abd6094-7027-475f-9630-8ab9be7b9725
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/02/21
references:
- https://drive.google.com/file/d/1lKya3_mLnR3UQuCoiYruO3qgu052_iS_/view
related:
- id: f117933c-980c-4f78-b384-e3d838111165
  type: similar
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Windows Admin Share Mount Via Net.EXE
