author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/12
description: Detects addition of users to the local administrator group via "Net"
  or "Add-LocalGroupMember".
detection:
  condition: all of selection_*
  selection_group:
    CommandLine|contains:
    - ' administrators '
    - ' administrateur'
  selection_main:
  - CommandLine|contains|all:
    - 'localgroup '
    - ' /add'
  - CommandLine|contains|all:
    - 'Add-LocalGroupMember '
    - ' -Group '
falsepositives:
- Administrative activity
id: ad720b90-25ad-43ff-9b5e-5c841facc8e5
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/03/02
references:
- https://blog.talosintelligence.com/2022/08/recent-cyber-attack.html?m=1
related:
- id: ffa28e60-bdb1-46e0-9f82-05f7a61cc06e
  type: similar
- id: 10fb649c-3600-4d37-b1e6-56ea90bb7e09
  type: similar
status: test
tags:
- attack.persistence
- attack.t1098
title: User Added to Local Administrators Group
