author: Florian Roth (Nextron Systems)
date: 2022/09/15
description: Detects the execution of the hacktool SharPersist - used to deploy various
  different kinds of persistence mechanisms
detection:
  condition: 1 of selection_*
  selection_cli_1:
    CommandLine|contains:
    - ' -t schtask -c '
    - ' -t startupfolder -c '
  selection_cli_2:
    CommandLine|contains|all:
    - ' -t reg -c '
    - ' -m add'
  selection_cli_3:
    CommandLine|contains|all:
    - ' -t service -c '
    - ' -m add'
  selection_cli_4:
    CommandLine|contains|all:
    - ' -t schtask -c '
    - ' -m add'
  selection_img:
  - Image|endswith: \SharPersist.exe
  - Product: SharPersist
falsepositives:
- Unknown
id: 26488ad0-f9fd-4536-876f-52fea846a2e4
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/02/04
references:
- https://www.mandiant.com/resources/blog/sharpersist-windows-persistence-toolkit
- https://github.com/mandiant/SharPersist
status: test
tags:
- attack.persistence
- attack.t1053
title: HackTool - SharPersist Execution
