author: Andreas Hunkeler (@Karneades), Nasreddine Bencherchali
date: 2021/12/17
description: Detects shell spawned from Java host process, which could be a sign of
  exploitation (e.g. log4j exploitation)
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_build:
    CommandLine|contains: build
    ParentImage|contains: build
  selection:
    Image|endswith:
    - \bash.exe
    - \cmd.exe
    - \powershell.exe
    - \pwsh.exe
    ParentImage|endswith: \java.exe
falsepositives:
- Legitimate calls to system binaries
- Company specific internal usage
id: dff1e1cc-d3fd-47c8-bfc2-aeb878a754c0
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/01/18
references:
- https://www.lunasec.io/docs/blog/log4j-zero-day/
related:
- id: 0d34ed8b-1c12-4ff2-828c-16fc860b766d
  type: similar
status: test
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
title: Shell Process Spawned by Java.EXE
