author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/08
description: Detects suspicious child processes of "provlaunch.exe" which might indicate
  potential abuse to proxy execution.
detection:
  condition: all of selection_*
  selection_child:
  - Image|endswith:
    - \calc.exe
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \notepad.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - Image|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Users\Public\
    - \AppData\Temp\
    - \Windows\System32\Tasks\
    - \Windows\Tasks\
    - \Windows\Temp\
  selection_parent:
    ParentImage|endswith: \provlaunch.exe
falsepositives:
- Unknown
id: f9999590-1f94-4a34-a91e-951e47bedefd
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://lolbas-project.github.io/lolbas/Binaries/Provlaunch/
- https://twitter.com/0gtweet/status/1674399582162153472
related:
- id: 7f5d1c9a-3e83-48df-95a7-2b98aae6c13c
  type: similar
- id: 2a4b3e61-9d22-4e4a-b60f-6e8f0cde6f25
  type: similar
- id: 7021255e-5db3-4946-a8b9-0ba7a4644a69
  type: similar
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Suspicious Provlaunch.EXE Child Process
