author: Nasreddine Bencherchali (Nextron Systems)
date: 2024/02/23
description: Detects potentially suspicious file downloads from file sharing domains
  using PowerShell.exe
detection:
  condition: all of selection_*
  selection_download:
    CommandLine|contains:
    - .DownloadString(
    - .DownloadFile(
    - 'Invoke-WebRequest '
    - 'iwr '
    - 'wget '
  selection_img:
  - Image|endswith:
    - \powershell.exe
    - \pwsh.exe
  - OriginalFileName:
    - PowerShell.EXE
    - pwsh.dll
  selection_websites:
    CommandLine|contains:
    - anonfiles.com
    - cdn.discordapp.com
    - cdn.discordapp.com/attachments/
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.nz
    - onrender.com
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - ufile.io
falsepositives:
- Unknown
id: b6e04788-29e1-4557-bb14-77f761848ab8
level: high
logsource:
  category: process_creation
  product: windows
references:
- https://labs.withsecure.com/publications/fin7-target-veeam-servers
- https://github.com/WithSecureLabs/iocs/blob/344203de742bb7e68bd56618f66d34be95a9f9fc/FIN7VEEAM/iocs.csv
- https://www.microsoft.com/en-us/security/blog/2024/01/17/new-ttps-observed-in-mint-sandstorm-campaign-targeting-high-profile-individuals-at-universities-and-research-orgs/
- https://www.huntress.com/blog/slashandgrab-screen-connect-post-exploitation-in-the-wild-cve-2024-1709-cve-2024-1708
status: experimental
tags:
- attack.execution
title: Potentially Suspicious File Download From File Sharing Domain Via PowerShell.EXE
