author: Florian Roth (Nextron Systems)
date: 2018/03/13
description: Detects the creation of a process via the Windows task manager. This
  might be an attempt to bypass UAC
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    Image|endswith:
    - :\Windows\System32\mmc.exe
    - :\Windows\System32\resmon.exe
    - :\Windows\System32\Taskmgr.exe
  selection:
    ParentImage|endswith: \taskmgr.exe
falsepositives:
- Administrative activity
id: 3d7679bd-0c00-440c-97b0-3f204273e6c7
level: low
logsource:
  category: process_creation
  product: windows
modified: 2024/01/18
references:
- https://twitter.com/ReneFreingruber/status/1172244989335810049
status: test
tags:
- attack.defense_evasion
- attack.t1036
title: New Process Created Via Taskmgr.EXE
