author: frack113
date: 2022/03/06
description: 'Detects execution of Windows Defender "OfflineScannerShell.exe" from
  its non standard directory.

  The "OfflineScannerShell.exe" binary is vulnerable to DLL side loading and will
  load any DLL named "mpclient.dll" from the current working directory.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_empty:
    CurrentDirectory: ''
  filter_main_legit_dir:
    CurrentDirectory: C:\Program Files\Windows Defender\Offline\
  filter_main_null:
    CurrentDirectory: null
  selection:
  - Image|endswith: \OfflineScannerShell.exe
  - OriginalFileName: OfflineScannerShell.exe
falsepositives:
- Unknown
id: 02b18447-ea83-4b1b-8805-714a8a34546a
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2023/08/03
references:
- https://lolbas-project.github.io/lolbas/Binaries/OfflineScannerShell/
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: Potential Mpclient.DLL Sideloading Via OfflineScannerShell.EXE Execution
