author: Florian Roth (Nextron Systems)
date: 2022/04/27
description: Detects the execution of different Windows based hacktools via PE metadata
  (company, product, etc.) even if the files have been renamed
detection:
  condition: selection
  selection:
    Company: Cube0x0
falsepositives:
- Unlikely
id: 37c1333a-a0db-48be-b64b-7393b2386e3b
level: high
logsource:
  category: process_creation
  product: windows
modified: 2024/01/15
references:
- https://github.com/cube0x0
- https://www.virustotal.com/gui/search/metadata%253ACube0x0/files
status: test
tags:
- attack.credential_access
- attack.t1588.002
- attack.t1003
title: Hacktool Execution - PE Metadata
