author: TropChaud
date: 2022/12/19
description: Detect usage of the "sqlite" binary to query databases in Chromium-based
  browsers for potential data stealing.
detection:
  condition: all of selection_*
  selection_chromium:
    CommandLine|contains:
    - \User Data\
    - \Opera Software\
    - \ChromiumViewer\
  selection_data:
    CommandLine|contains:
    - Login Data
    - Cookies
    - Web Data
    - History
    - Bookmarks
  selection_sql:
  - Product: SQLite
  - Image|endswith:
    - \sqlite.exe
    - \sqlite3.exe
falsepositives:
- Unknown
id: 24c77512-782b-448a-8950-eddb0785fc71
level: high
logsource:
  category: process_creation
  product: windows
modified: 2023/01/19
references:
- https://github.com/redcanaryco/atomic-red-team/blob/84d9edaaaa2c5511144521b0e4af726d1c7276ce/atomics/T1539/T1539.md#atomic-test-2---steal-chrome-cookies-windows
- https://blog.cyble.com/2022/04/21/prynt-stealer-a-new-info-stealer-performing-clipper-and-keylogger-activities/
status: test
tags:
- attack.credential_access
- attack.t1539
- attack.t1555.003
- attack.collection
- attack.t1005
title: SQLite Chromium Profile Data DB Access
