author: "Ensar \u015Eamil, @sblmsrsn, @oscd_initiative, Nasreddine Bencherchali (Nextron\
  \ Systems)"
date: 2020/10/07
description: 'Detects the execution of Xwizard tool with the "RunWizard" flag and
  a GUID like argument.

  This utility can be abused in order to run custom COM object created in the registry.

  '
detection:
  condition: all of selection_* or (selection_cli and not selection_img)
  selection_cli:
    CommandLine: RunWizard
    CommandLine|re: \{[a-fA-F0-9]{8}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{4}-[a-fA-F0-9]{12}\}
  selection_img:
  - Image|endswith: \xwizard.exe
  - OriginalFileName: xwizard.exe
falsepositives:
- Unknown
id: 53d4bb30-3f36-4e8a-b078-69d36c4a79ff
level: medium
logsource:
  category: process_creation
  product: windows
modified: 2024/04/22
references:
- https://lolbas-project.github.io/lolbas/Binaries/Xwizard/
- https://www.elastic.co/guide/en/security/current/execution-of-com-object-via-xwizard.html
- https://www.hexacorn.com/blog/2017/07/31/the-wizard-of-x-oppa-plugx-style/
status: test
tags:
- attack.defense_evasion
- attack.t1218
title: COM Object Execution via Xwizard.EXE
