author: Swachchhanda Shrawan Poudel
date: 2024/05/13
description: Detects potentially suspicious child processes of KeyScrambler.exe
detection:
  condition: all of selection_*
  selection_binaries:
  - Image|endswith:
    - \cmd.exe
    - \cscript.exe
    - \mshta.exe
    - \powershell.exe
    - \pwsh.exe
    - \regsvr32.exe
    - \rundll32.exe
    - \wscript.exe
  - OriginalFileName:
    - Cmd.Exe
    - cscript.exe
    - mshta.exe
    - PowerShell.EXE
    - pwsh.dll
    - regsvr32.exe
    - RUNDLL32.EXE
    - wscript.exe
  selection_parent:
    ParentImage|endswith: \KeyScrambler.exe
falsepositives:
- Unknown
id: ca5583e9-8f80-46ac-ab91-7f314d13b984
level: medium
logsource:
  category: process_creation
  product: windows
references:
- https://twitter.com/DTCERT/status/1712785421845790799
related:
- id: d2451be2-b582-4e15-8701-4196ac180260
  type: similar
status: experimental
tags:
- attack.execution
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1203
- attack.t1574.002
title: Potentially Suspicious Child Process of KeyScrambler.exe
