author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where a REDIS service on an OpenCanary node has had
  an action command attempted.
detection:
  condition: selection
  selection:
    logtype: 17001
falsepositives:
- Unlikely
id: 547dfc53-ebf6-4afe-8d2e-793d9574975d
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.credential_access
- attack.collection
- attack.t1003
- attack.t1213
title: OpenCanary - REDIS Action Command Attempt
