author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where a TFTP service on an OpenCanary node has had
  a request.
detection:
  condition: selection
  selection:
    logtype: 10001
falsepositives:
- Unlikely
id: b4e6b016-a2ac-4759-ad85-8000b300d61e
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.exfiltration
- attack.t1041
title: OpenCanary - TFTP Request
