author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where an SMB service on an OpenCanary node has had
  a file open request.
detection:
  condition: selection
  selection:
    logtype: 5000
falsepositives:
- Unlikely
id: 22777c9e-873a-4b49-855f-6072ab861a52
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.lateral_movement
- attack.collection
- attack.t1021
- attack.t1005
title: OpenCanary - SMB File Open Request
