author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where a Telnet service on an OpenCanary node has had
  a login attempt.
detection:
  condition: selection
  selection:
    logtype: 6001
falsepositives:
- Unlikely
id: 512cff7a-683a-43ad-afe0-dd398e872f36
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.initial_access
- attack.command_and_control
- attack.t1133
- attack.t1078
title: OpenCanary - Telnet Login Attempt
