author: Security Onion Solutions
date: 2024/03/08
description: 'Detects instances where an HTTPPROXY service on an OpenCanary node has
  had an attempt to proxy another page.

  '
detection:
  condition: selection
  selection:
    logtype: 7001
falsepositives:
- Unlikely
id: 5498fc09-adc6-4804-b9d9-5cca1f0b8760
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.initial_access
- attack.defense_evasion
- attack.t1090
title: OpenCanary - HTTPPROXY Login Attempt
