author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where an HTTP service on an OpenCanary node has received
  a GET request.
detection:
  condition: selection
  selection:
    logtype: 3000
falsepositives:
- Unlikely
id: af6c3078-84cd-4c68-8842-08b76bd81b13
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.initial_access
- attack.t1190
title: OpenCanary - HTTP GET Request
