author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where an SNMP service on an OpenCanary node has had
  an OID request.
detection:
  condition: selection
  selection:
    logtype: 13001
falsepositives:
- Unlikely
id: e9856028-fd4e-46e6-b3d1-10f7ceb95078
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.discovery
- attack.lateral_movement
- attack.t1016
- attack.t1021
title: OpenCanary - SNMP OID Request
