author: Security Onion Solutions
date: 2024/03/08
description: Detects instances where an FTP service on an OpenCanary node has had
  a login attempt.
detection:
  condition: selection
  selection:
    logtype: 2000
falsepositives:
- Unlikely
id: 6991bc2b-ae2e-447f-bc55-3a1ba04c14e5
level: high
logsource:
  category: application
  product: opencanary
references:
- https://opencanary.readthedocs.io/en/latest/starting/configuration.html#services-configuration
- https://github.com/thinkst/opencanary/blob/a0896adfcaf0328cfd5829fe10d2878c7445138e/opencanary/logger.py#L52
status: experimental
tags:
- attack.initial_access
- attack.exfiltration
- attack.t1190
- attack.t1021
title: OpenCanary - FTP Login Attempt
