author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects DNS queries for subdomains related to MEGA sharing website
detection:
  condition: selection
  selection:
    EventID: 3008
    QueryName|contains: userstorage.mega.co.nz
falsepositives:
- Legitimate DNS queries and usage of Mega
id: 66474410-b883-415f-9f8d-75345a0a66a6
level: medium
logsource:
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
  product: windows
  service: dns-client
references:
- https://research.nccgroup.com/2021/05/27/detecting-rclone-an-effective-tool-for-exfiltration/
related:
- id: 613c03ba-0779-4a53-8a1f-47f914a4ded3
  type: similar
status: test
tags:
- attack.exfiltration
- attack.t1567.002
title: DNS Query To MEGA Hosting Website - DNS Client
