author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects a program that invoked suspicious DNS queries known from Cobalt
  Strike beacons
detection:
  condition: selection_eid and 1 of selection_query_*
  selection_eid:
    EventID: 3008
  selection_query_1:
    QueryName|startswith:
    - aaa.stage.
    - post.1
  selection_query_2:
    QueryName|contains: .stage.123456.
falsepositives:
- Unknown
id: 0d18728b-f5bf-4381-9dcf-915539fff6c2
level: critical
logsource:
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
  product: windows
  service: dns-client
references:
- https://www.icebrg.io/blog/footprints-of-fin7-tracking-actor-patterns
- https://www.sekoia.io/en/hunting-and-detecting-cobalt-strike/
related:
- id: f356a9c4-effd-4608-bbf8-408afd5cd006
  type: similar
status: test
tags:
- attack.command_and_control
- attack.t1071.004
title: Suspicious Cobalt Strike DNS Beaconing - DNS Client
