author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects DNS queries for anonfiles.com, which is an anonymous file upload
  platform often used for malicious purposes
detection:
  condition: selection
  selection:
    EventID: 3008
    QueryName|contains: .anonfiles.com
falsepositives:
- Rare legitimate access to anonfiles.com
id: 29f171d7-aa47-42c7-9c7b-3c87938164d9
level: high
logsource:
  definition: 'Requirements: Microsoft-Windows-DNS Client Events/Operational Event
    Log must be enabled/collected in order to receive the events.'
  product: windows
  service: dns-client
references:
- https://www.trendmicro.com/vinfo/us/security/news/ransomware-spotlight/ransomware-spotlight-blackbyte
related:
- id: 065cceea-77ec-4030-9052-fc0affea7110
  type: similar
status: test
tags:
- attack.exfiltration
- attack.t1567.002
title: DNS Query for Anonfiles.com Domain - DNS Client
