author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/09/02
description: Detect potential adversaries leveraging WMI ActiveScriptEventConsumers
  remotely to move laterally in a network
detection:
  condition: selection and not filter
  filter:
    TargetLogonId: '0x3e7'
  selection:
    EventID: 4624
    LogonType: 3
    ProcessName|endswith: scrcons.exe
falsepositives:
- SCCM
id: 9599c180-e3a8-4743-8f92-7fb96d3be648
level: high
logsource:
  product: windows
  service: security
modified: 2021/11/27
references:
- https://threathunterplaybook.com/hunts/windows/200902-RemoteWMIActiveScriptEventConsumers/notebook.html
status: test
tags:
- attack.lateral_movement
- attack.privilege_escalation
- attack.persistence
- attack.t1546.003
title: Remote WMI ActiveScriptEventConsumers
