author: Thomas Patzke
date: 2019/12/04
description: Detects successful logon attempts performed with WMI
detection:
  condition: selection
  selection:
    EventID: 4624
    ProcessName|endswith: \WmiPrvSE.exe
falsepositives:
- Monitoring tools
- Legitimate system administration
id: 5af54681-df95-4c26-854f-2565e13cfab0
level: low
logsource:
  product: windows
  service: security
modified: 2024/01/17
references:
- Internal Research
status: stable
tags:
- attack.execution
- attack.t1047
title: Successful Account Login Via WMI
