author: Thomas Patzke
date: 2019/01/28
description: RDP login with localhost source address may be a tunnelled login
detection:
  condition: selection
  selection:
    EventID: 4624
    IpAddress:
    - ::1
    - 127.0.0.1
    LogonType: 10
falsepositives:
- Unknown
id: 51e33403-2a37-4d66-a574-1fda1782cc31
level: high
logsource:
  product: windows
  service: security
modified: 2022/10/09
references:
- https://www.fireeye.com/blog/threat-research/2019/01/bypassing-network-restrictions-through-rdp-tunneling.html
status: test
tags:
- attack.lateral_movement
- car.2013-07-002
- attack.t1021.001
title: RDP Login from Localhost
