author: Michaela Adams, Zach Mathis
date: 2022/11/06
description: Detects potential token impersonation and theft. Example, when using
  "DuplicateToken(Ex)" and "ImpersonateLoggedOnUser" with the "LOGON32_LOGON_NEW_CREDENTIALS
  flag".
detection:
  condition: selection
  selection:
    AuthenticationPackageName: Negotiate
    EventID: 4624
    ImpersonationLevel: '%%1833'
    LogonProcessName: Advapi
    LogonType: 9
falsepositives:
- Anti-Virus
id: 02f7c9c1-1ae8-4c6a-8add-04693807f92f
level: medium
logsource:
  product: windows
  service: security
modified: 2023/04/26
references:
- https://www.elastic.co/fr/blog/how-attackers-abuse-access-token-manipulation
- https://www.manageengine.com/log-management/cyber-security/access-token-manipulation.html
status: test
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1134.001
- stp.4u
title: Potential Access Token Abuse
