author: Micah Babinski (@micahbabinski), Zach Mathis (@yamatosecurity)
date: 2023/01/19
description: Detects successful logon from public IP address via SMB. This can indicate
  a publicly-exposed SMB port.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_empty:
    IpAddress: '-'
  filter_main_local_ranges:
    IpAddress|cidr:
    - ::1/128
    - 10.0.0.0/8
    - 127.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - fc00::/7
    - fe80::/10
  selection:
    EventID: 4624
    LogonType: 3
falsepositives:
- Legitimate or intentional inbound connections from public IP addresses on the SMB
  port.
id: 78d5cab4-557e-454f-9fb9-a222bd0d5edc
level: high
logsource:
  product: windows
  service: security
modified: 2024/03/11
references:
- https://www.inversecos.com/2020/04/successful-4624-anonymous-logons-to.html
- https://twitter.com/Purp1eW0lf/status/1616144561965002752
related:
- id: 259a9cdf-c4dd-4fa2-b243-2269e5ab18a2
  type: derived
status: test
tags:
- attack.initial_access
- attack.credential_access
- attack.t1133
- attack.t1078
- attack.t1110
title: External Remote SMB Logon from Public IP
