author: Roberto Rodriguez (source), Dominik Schaudel (rule)
date: 2018/02/12
description: Detects successful logon with logon type 9 (NewCredentials) which matches
  the Overpass the Hash behavior of e.g Mimikatz's sekurlsa::pth module.
detection:
  condition: selection
  selection:
    AuthenticationPackageName: Negotiate
    EventID: 4624
    LogonProcessName: seclogo
    LogonType: 9
falsepositives:
- Runas command-line tool using /netonly parameter
id: 192a0330-c20b-4356-90b6-7b7049ae0b87
level: high
logsource:
  product: windows
  service: security
modified: 2021/11/27
references:
- https://web.archive.org/web/20220419045003/https://cyberwardog.blogspot.com/2017/04/chronicles-of-threat-hunter-hunting-for.html
status: test
tags:
- attack.lateral_movement
- attack.s0002
- attack.t1550.002
title: Successful Overpass the Hash Attempt
