author: Dave Kennedy, Jeff Warren (method) / David Vassallo (rule)
date: 2019/06/14
description: Detects the attack technique pass the hash which is used to move laterally
  inside the network
detection:
  condition: 1 of selection_* and not filter
  filter:
    TargetUserName: ANONYMOUS LOGON
  selection_logon3:
    EventID: 4624
    KeyLength: 0
    LogonProcessName: NtLmSsp
    LogonType: 3
    SubjectUserSid: S-1-0-0
  selection_logon9:
    EventID: 4624
    LogonProcessName: seclogo
    LogonType: 9
falsepositives:
- Administrator activity
id: 8eef149c-bd26-49f2-9e5a-9b00e3af499b
level: medium
logsource:
  definition: The successful use of PtH for lateral movement between workstations
    would trigger event ID 4624
  product: windows
  service: security
modified: 2022/10/05
references:
- https://github.com/iadgov/Event-Forwarding-Guidance/tree/master/Events
- https://blog.binarydefense.com/reliably-detecting-pass-the-hash-through-event-log-analysis
- https://blog.stealthbits.com/how-to-detect-pass-the-hash-attacks/
status: stable
tags:
- attack.lateral_movement
- attack.t1550.002
title: Pass the Hash Activity 2
