author: Tim Brown
date: 2023/01/09
description: Detects LDP failures which may be indicative of brute force attacks to
  manipulate MPLS labels
detection:
  condition: selection_protocol and selection_keywords
  selection_keywords:
  - SOCKET_TCP_PACKET_MD5_AUTHEN_FAIL
  - TCPMD5AuthenFail
  selection_protocol:
  - LDP
falsepositives:
- Unlikely. Except due to misconfigurations
fields:
- tcpConnLocalAddress
- tcpConnRemAddress
id: 50e606bf-04ce-4ca7-9d54-3449494bbd4b
level: low
logsource:
  definition: 'Requirements: cisco ldp logs need to be enabled and ingested'
  product: cisco
  service: ldp
references:
- https://www.blackhat.com/presentations/bh-usa-03/bh-us-03-convery-franz-v3.pdf
status: test
tags:
- attack.initial_access
- attack.persistence
- attack.privilege_escalation
- attack.defense_evasion
- attack.credential_access
- attack.collection
- attack.t1078
- attack.t1110
- attack.t1557
title: Cisco LDP Authentication Failures
