author: frack113
date: 2023/12/21
description: Detects file access requests to potentially sensitive files hosted on
  the Windows Sysvol share.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_generic:
    Image|startswith:
    - :\Program Files (x86)\
    - :\Program Files\
    - :\Windows\explorer.exe
    - :\Windows\system32\
    - :\Windows\SysWOW64\
  selection:
    FileName|contains|all:
    - \sysvol\
    - \Policies\
    FileName|endswith:
    - audit.csv
    - Files.xml
    - GptTmpl.inf
    - groups.xml
    - Registry.pol
    - Registry.xml
    - scheduledtasks.xml
    - scripts.ini
    - services.xml
    FileName|startswith: \\
falsepositives:
- Unknown
id: d51694fe-484a-46ac-92d6-969e76d60d10
level: medium
logsource:
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
  product: windows
references:
- https://github.com/vletoux/pingcastle
related:
- id: 8344c19f-a023-45ff-ad63-a01c5396aea0
  type: derived
status: experimental
tags:
- attack.credential_access
- attack.t1552.006
title: Access To Potentially Sensitive Sysvol Files By Uncommon Application
