author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/17
description: 'Detects file access requests to the the Windows Data Protection API
  Master keys by an uncommon application.

  This can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::masterkey" function

  '
detection:
  condition: selection and not 1 of filter_*
  filter_system_folders:
    Image|contains:
    - :\Program Files\
    - :\Program Files (x86)\
    - :\Windows\system32\
    - :\Windows\SysWOW64\
  selection:
    FileName|contains:
    - \Microsoft\Protect\S-1-5-18\
    - \Microsoft\Protect\S-1-5-21-
falsepositives:
- Unknown
id: 46612ae6-86be-4802-bc07-39b59feb1309
level: medium
logsource:
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
  product: windows
modified: 2023/12/18
references:
- http://blog.harmj0y.net/redteaming/operational-guidance-for-offensive-user-dpapi-abuse/
- https://book.hacktricks.xyz/windows-hardening/windows-local-privilege-escalation/dpapi-extracting-passwords
status: experimental
tags:
- attack.credential_access
- attack.t1555.004
title: Access To Windows DPAPI Master Keys By Uncommon Application
