author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/11
description: 'Detects suspicious processes based on name and location that access
  the windows credential manager and vault.

  Which can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::cred" function

  '
detection:
  condition: selection and not 1 of filter_*
  filter_system_folders:
    Image|contains:
    - :\Program Files\
    - :\Program Files (x86)\
    - :\Windows\system32\
    - :\Windows\SysWOW64\
  selection:
    FileName|contains:
    - \AppData\Local\Microsoft\Credentials\
    - \AppData\Roaming\Microsoft\Credentials\
    - \AppData\Local\Microsoft\Vault\
    - \ProgramData\Microsoft\Vault\
falsepositives:
- Legitimate software installed by the users for example in the "AppData" directory
  may access these files (for any reason).
id: 407aecb1-e762-4acf-8c7b-d087bcff3bb6
level: medium
logsource:
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
  product: windows
modified: 2023/12/18
references:
- https://hunter2.gitbook.io/darthsidious/privilege-escalation/mimikatz
- https://www.absolomb.com/2018-01-26-Windows-Privilege-Escalation-Guide/
status: experimental
tags:
- attack.t1003
- attack.credential_access
title: Credential Manager Access By Uncommon Application
