author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/17
description: 'Detects file access requests to the Windows Credential History File
  by an uncommon application.

  This can be a sign of credential stealing. Example case would be usage of mimikatz
  "dpapi::credhist" function

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_explorer:
    Image|endswith: :\Windows\explorer.exe
  filter_main_system_folders:
    Image|contains:
    - :\Program Files\
    - :\Program Files (x86)\
    - :\Windows\system32\
    - :\Windows\SysWOW64\
  selection:
    FileName|endswith: \Microsoft\Protect\CREDHIST
falsepositives:
- Unknown
id: 7a2a22ea-a203-4cd3-9abf-20eb1c5c6cd2
level: medium
logsource:
  category: file_access
  definition: 'Requirements: Microsoft-Windows-Kernel-File ETW provider'
  product: windows
modified: 2023/12/18
references:
- https://tools.thehacker.recipes/mimikatz/modules/dpapi/credhist
- https://www.passcape.com/windows_password_recovery_dpapi_credhist
status: experimental
tags:
- attack.credential_access
- attack.t1555.004
title: Access To Windows Credential History File By Uncommon Application
