author: Ali Alwashali
date: 2023/10/10
description: Detects command execution via ScreenConnect RMM
detection:
  condition: selection
  selection:
    Data|contains: Executed command of length
    EventID: 200
    Provider_Name: ScreenConnect
falsepositives:
- Legitimate use of ScreenConnect
id: 076ebe48-cc05-4d8f-9d41-89245cd93a14
level: low
logsource:
  product: windows
  service: application
references:
- https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
- https://github.com/SigmaHQ/sigma/pull/4467
related:
- id: b1f73849-6329-4069-bc8f-78a604bb8b23
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.003
title: Remote Access Tool - ScreenConnect Command Execution
