author: Ali Alwashali
date: 2023/10/10
description: Detects file being transferred via ScreenConnect RMM
detection:
  condition: selection
  selection:
    Data|contains: Transferred files with action
    EventID: 201
    Provider_Name: ScreenConnect
falsepositives:
- Legitimate use of ScreenConnect
id: 5d19eb78-5b5b-4ef2-a9f0-4bfa94d58a13
level: low
logsource:
  product: windows
  service: application
references:
- https://www.huntandhackett.com/blog/revil-the-usage-of-legitimate-remote-admin-tooling
- https://github.com/SigmaHQ/sigma/pull/4467
related:
- id: b1f73849-6329-4069-bc8f-78a604bb8b23
  type: similar
status: experimental
tags:
- attack.execution
- attack.t1059.003
title: Remote Access Tool - ScreenConnect File Transfer
