author: Nikita Khalimonenkov
date: 2023/01/19
description: Detects when a new admin role assignment is created. Which could be a
  sign of privilege escalation or persistence
detection:
  condition: selection
  selection:
    eventtype: iam.resourceset.bindings.add
falsepositives:
- Legitimate creation of a new admin role assignment
id: 139bdd4b-9cd7-49ba-a2f4-744d0a8f5d8c
level: medium
logsource:
  product: okta
  service: okta
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://developer.okta.com/docs/reference/api/event-types/
status: test
tags:
- attack.persistence
title: Okta Admin Role Assignment Created
