author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/10/25
description: Detects new user account creation
detection:
  condition: selection
  selection:
    eventtype: user.lifecycle.create
falsepositives:
- Legitimate and authorized user creation
id: b6c718dd-8f53-4b9f-98d8-93fdca966969
level: informational
logsource:
  product: okta
  service: okta
references:
- https://developer.okta.com/docs/reference/api/event-types/
status: experimental
tags:
- attack.credential_access
title: New Okta User Created
