author: kelnage
date: 2023/04/03
description: 'Detects when a user has potentially entered their password into the

  username field, which will cause the password to be retained in log files.

  '
detection:
  condition: selection and not filter_main
  filter_main:
    actor.alternateid|re: (^0oa.*|[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,10})
  selection:
    legacyeventtype: core.user_auth.login_failed
falsepositives:
- Unlikely
id: 91b76b84-8589-47aa-9605-c837583b82a9
level: high
logsource:
  product: okta
  service: okta
modified: 2023/10/25
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://www.mitiga.io/blog/how-okta-passwords-can-be-compromised-uncovering-a-risk-to-user-data
- https://help.okta.com/en-us/Content/Topics/users-groups-profiles/usgp-create-character-restriction.htm
status: experimental
tags:
- attack.credential_access
- attack.t1552
title: Potential Okta Password in AlternateID Field
