author: kelnage
date: 2023/09/07
description: Detects when Okta identifies new activity in the Admin Console.
detection:
  condition: selection
  selection:
    debugcontext.debugdata.behaviors: POSITIVE
    debugcontext.debugdata.logonlysecuritydata: POSITIVE
    eventtype: policy.evaluate_sign_on
    target.displayname: Okta Admin Console
falsepositives:
- Whenever an admin starts using new features of the admin console.
id: a0b38b70-3cb5-484b-a4eb-c4d8e7bcc0a9
level: low
logsource:
  product: okta
  service: okta
modified: 2023/10/25
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
status: experimental
tags:
- attack.initial_access
- attack.t1078.004
title: Okta New Admin Console Behaviours
