author: kelnage
date: 2023/09/07
description: Detects when an Okta user session starts where the user is behind an
  anonymising proxy service.
detection:
  condition: selection
  selection:
    eventtype: user.session.start
    securitycontext.isproxy: 'true'
falsepositives:
- If a user requires an anonymising proxy due to valid justifications.
id: bde30855-5c53-4c18-ae90-1ff79ebc9578
level: high
logsource:
  product: okta
  service: okta
references:
- https://developer.okta.com/docs/reference/api/system-log/
- https://sec.okta.com/articles/2023/08/cross-tenant-impersonation-prevention-and-detection
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.006
title: Okta User Session Start Via An Anonymising Proxy Service
