author: X__Junior (Nextron Systems)
date: 2023/11/03
description: Detects enabling of the "AllowAnonymousCallback" registry value, which
  allows a remote connection between computers that do not have a trust relationship.
detection:
  condition: selection
  selection:
    Details: DWORD (0x00000001)
    TargetObject|contains: \Microsoft\WBEM\CIMOM\AllowAnonymousCallback
falsepositives:
- Administrative activity
id: 4d431012-2ab5-4db7-a84e-b29809da2172
level: medium
logsource:
  category: registry_set
  product: windows
references:
- https://learn.microsoft.com/en-us/windows/win32/wmisdk/connecting-to-wmi-remotely-starting-with-vista
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Enable Remote Connection Between Anonymous Computer - AllowAnonymousCallback
