author: Mateusz Wydra, oscd.community
date: 2020/10/13
description: Detects creation/modification of Assistive Technology applications and
  persistence with usage of 'at'
detection:
  condition: selection and not 1 of filter_*
  filter_atbroker:
    Details: (Empty)
    Image: C:\Windows\system32\atbroker.exe
    TargetObject|contains: \Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration
  filter_uninstallers:
    Image|startswith: C:\Windows\Installer\MSI
    TargetObject|contains: Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs
  selection:
    TargetObject|contains:
    - Software\Microsoft\Windows NT\CurrentVersion\Accessibility\ATs
    - Software\Microsoft\Windows NT\CurrentVersion\Accessibility\Configuration
falsepositives:
- Creation of non-default, legitimate at usage
id: 9577edbb-851f-4243-8c91-1d5b50c1a39b
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2023/01/19
references:
- http://www.hexacorn.com/blog/2016/07/22/beyond-good-ol-run-key-part-42/
- https://lolbas-project.github.io/lolbas/Binaries/Atbroker/
status: test
tags:
- attack.defense_evasion
- attack.t1218
- attack.persistence
- attack.t1547
title: Atbroker Registry Change
