author: Avneet Singh @v3t0_, oscd.community
date: 2020/11/15
description: Rule to detect the configuration of Run Once registry key. Configured
  payload can be run by runonce.exe /AlternateShellStartup
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_chrome:
    Details|contains|all:
    - C:\Program Files\Google\Chrome\Application\
    - \Installer\chrmstp.exe" --configure-user-settings --verbose-logging --system-level
  filter_optional_edge:
    Details|contains:
    - C:\Program Files (x86)\Microsoft\Edge\Application\
    - C:\Program Files\Microsoft\Edge\Application\
    Details|endswith: \Installer\setup.exe" --configure-user-settings --verbose-logging
      --system-level --msedge --channel=stable
  selection:
    TargetObject|contains: \Microsoft\Active Setup\Installed Components
    TargetObject|endswith: \StubPath
falsepositives:
- Legitimate modification of the registry key by legitimate program
id: c74d7efc-8826-45d9-b8bb-f04fac9e4eff
level: medium
logsource:
  category: registry_event
  product: windows
modified: 2024/03/25
references:
- https://twitter.com/pabraeken/status/990717080805789697
- https://lolbas-project.github.io/lolbas/Binaries/Runonce/
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Run Once Task Configuration in Registry
