author: Florian Roth (Nextron Systems)
date: 2017/06/01
description: Detects Pandemic Windows Implant
detection:
  condition: selection
  selection:
    TargetObject|contains: \SYSTEM\CurrentControlSet\services\null\Instance
falsepositives:
- Unknown
id: 47e0852a-cf81-4494-a8e6-31864f8c86ed
level: critical
logsource:
  category: registry_event
  product: windows
modified: 2022/10/09
references:
- https://wikileaks.org/vault7/#Pandemic
- https://twitter.com/MalwareJake/status/870349480356454401
status: test
tags:
- attack.command_and_control
- attack.t1105
title: Pandemic Registry Key
