author: frack113
date: 2024/04/25
description: Detects "RegAsm.exe" initiating a network connection to public IP adresses
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  selection:
    Image|endswith: \regasm.exe
    Initiated: 'true'
falsepositives:
- Unknown
id: 0531e43a-d77d-47c2-b89f-5fe50321c805
level: medium
logsource:
  category: network_connection
  product: windows
references:
- https://app.any.run/tasks/ec207948-4916-47eb-a0f4-4c6abb2e7668/
- https://research.splunk.com/endpoint/07921114-6db4-4e2e-ae58-3ea8a52ae93f/
- https://lolbas-project.github.io/lolbas/Binaries/Regasm/
status: experimental
tags:
- attack.defense_evasion
- attack.t1218.009
title: RegAsm.EXE Initiating Network Connection To Public IP
