author: Roberto Rodriguez @Cyb3rWard0g
date: 2019/09/12
description: 'Detects a process that initiated a network connection over ports 5985
  or 5986 from a non-network service account.

  This could potentially indicates a remote PowerShell connection.

  '
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_localhost:
    DestinationIp:
    - ::1
    - 127.0.0.1
    SourceIp:
    - ::1
    - 127.0.0.1
  filter_main_service_users:
  - User|contains:
    - NETWORK SERVICE
    - NETZWERKDIENST
    - SERVICIO DE RED
    - SERVIZIO DI RETE
  - User|contains|all:
    - SERVICE R
    - SEAU
  filter_optional_avast:
    Image:
    - C:\Program Files\Avast Software\Avast\AvastSvc.exe
    - C:\Program Files (x86)\Avast Software\Avast\AvastSvc.exe
  selection:
    DestinationPort:
    - 5985
    - 5986
    Initiated: 'true'
    SourceIsIpv6: 'false'
falsepositives:
- Legitimate usage of remote PowerShell, e.g. remote administration and monitoring.
- Network Service user name of a not-covered localization
id: c539afac-c12a-46ed-b1bd-5a5567c9f045
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/02/02
references:
- https://threathunterplaybook.com/hunts/windows/190511-RemotePwshExecution/notebook.html
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.lateral_movement
- attack.t1021.006
title: Potential Remote PowerShell Session Initiated
