author: frack113, Florian Roth (Nextron Systems)
date: 2022/09/02
description: 'Detects a network connection initiated by the certutil.exe utility.

  Attackers can abuse the utility in order to download malware or additional payloads.

  '
detection:
  condition: selection
  selection:
    DestinationPort:
    - 80
    - 135
    - 443
    - 445
    Image|endswith: \certutil.exe
    Initiated: 'true'
falsepositives:
- Unknown
id: 0dba975d-a193-4ed1-a067-424df57570d1
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/05/31
references:
- https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/certutil
status: test
tags:
- attack.command_and_control
- attack.t1105
title: Uncommon Network Connection Initiated By Certutil.EXE
