author: Florian Roth (Nextron Systems), Nasreddine Bencherchali (Nextron Systems)
date: 2017/03/19
description: 'Detects a network connection initiated by programs or processes running
  from suspicious or uncommon files system locations.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_domains:
    DestinationHostname|endswith:
    - .githubusercontent.com
    - anonfiles.com
    - cdn.discordapp.com
    - cdn.discordapp.com/attachments/
    - ddns.net
    - dl.dropboxusercontent.com
    - ghostbin.co
    - glitch.me
    - gofile.io
    - hastebin.com
    - mediafire.com
    - mega.co.nz
    - mega.nz
    - onrender.com
    - paste.ee
    - pastebin.com
    - pastebin.pl
    - pastetext.net
    - portmap.io
    - privatlab.com
    - privatlab.net
    - send.exploit.in
    - sendspace.com
    - storage.googleapis.com
    - storjshare.io
    - supabase.co
    - temp.sh
    - transfer.sh
    - ufile.io
  selection:
    Image|contains:
    - :\$Recycle.bin
    - :\Perflogs\
    - :\Temp\
    - :\Users\Default\
    - :\Windows\Fonts\
    - :\Windows\IME\
    - :\Windows\System32\Tasks\
    - :\Windows\Tasks\
    - \config\systemprofile\
    - \Windows\addins\
    Initiated: 'true'
falsepositives:
- Unknown
id: 7b434893-c57d-4f41-908d-6a17bf1ae98f
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/05/31
references:
- https://docs.google.com/spreadsheets/d/17pSTDNpa0sf6pHeRhusvWG6rThciE8CsXTSlDUAZDyo
status: test
tags:
- attack.command_and_control
- attack.t1105
title: Network Connection Initiated From Process Located In Potentially Suspicious
  Or Uncommon Location
