author: Kiran kumar s, oscd.community
date: 2020/10/11
description: Detects a possible remote connections to Silenttrinity c2
detection:
  condition: selection and filter
  filter:
    DestinationPort:
    - 80
    - 443
    Initiated: 'true'
  selection:
    Image|endswith: \msbuild.exe
falsepositives:
- Unknown
id: 50e54b8d-ad73-43f8-96a1-5191685b17a4
level: high
logsource:
  category: network_connection
  product: windows
modified: 2022/10/05
references:
- https://www.blackhillsinfosec.com/my-first-joyride-with-silenttrinity/
status: test
tags:
- attack.execution
- attack.t1127.001
title: Silenttrinity Stager Msbuild Activity
