author: X__Junior (Nextron Systems)
date: 2023/07/12
description: 'Detects a network connection initiated by "wordpad.exe" over uncommon
  destination ports.

  This might indicate potential process injection activity from a beacon or similar
  mechanisms.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_ports:
    DestinationPort:
    - 80
    - 139
    - 443
    - 445
    - 465
    - 587
    - 993
    - 995
  selection:
    Image|endswith: \wordpad.exe
    Initiated: 'true'
falsepositives:
- Other ports can be used, apply additional filters accordingly
id: 786cdae8-fefb-4eb2-9227-04e34060db01
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2023/12/15
references:
- https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
title: Suspicious Wordpad Outbound Connections
