author: Max Altgelt (Nextron Systems)
date: 2022/04/14
description: Detects network connections from the Equation Editor process "eqnedt32.exe".
detection:
  condition: selection
  selection:
    Image|endswith: \eqnedt32.exe
falsepositives:
- Unlikely
id: a66bc059-c370-472c-a0d7-f8fd1bf9d583
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/05/31
references:
- https://twitter.com/forensicitguy/status/1513538712986079238
- https://forensicitguy.github.io/xloader-formbook-velvetsweatshop-spreadsheet/
- https://news.sophos.com/en-us/2019/07/18/a-new-equation-editor-exploit-goes-commercial-as-maldoc-attacks-using-it-spike/
status: test
tags:
- attack.execution
- attack.t1203
title: Network Connection Initiated By Eqnedt32.EXE
