author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/08/30
description: 'Detects a network connection initiated by Cmstp.EXE

  Its uncommon for "cmstp.exe" to initiate an outbound network connection. Investigate
  the source of such requests to determine if they are malicious.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  selection:
    Image|endswith: \cmstp.exe
    Initiated: 'true'
falsepositives:
- Unknown
id: efafe0bf-4238-479e-af8f-797bd3490d2d
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/05/31
references:
- https://web.archive.org/web/20190720093911/http://www.endurant.io/cmstp/detecting-cmstp-enabled-code-execution-and-uac-bypass-with-sysmon/
status: test
tags:
- attack.defense_evasion
- attack.t1218.003
title: Outbound Network Connection Initiated By Cmstp.EXE
