author: Samir Bousseaden
date: 2019/02/16
description: Detects svchost hosting RDP termsvcs communicating with the loopback
  address and on TCP port 3389
detection:
  condition: all of selection_*
  selection_destination:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - ::1/128
  selection_img:
    Image|endswith: \svchost.exe
    Initiated: 'true'
    SourcePort: 3389
falsepositives:
- Unknown
id: 5f699bc5-5446-4a4a-a0b7-5ef2885a3eb4
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/03/12
references:
- https://twitter.com/cyb3rops/status/1096842275437625346
status: test
tags:
- attack.command_and_control
- attack.t1572
- attack.lateral_movement
- attack.t1021.001
- car.2013-07-002
title: RDP Over Reverse SSH Tunnel
