author: X__Junior (Nextron Systems)
date: 2023/07/12
description: Detects an office suit application (Word, Excel, PowerPoint, Outlook)
  communicating to target systems over uncommon ports.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_common_ports:
    DestinationPort:
    - 53
    - 80
    - 139
    - 443
    - 445
  filter_main_outlook_ports:
    DestinationPort:
    - 465
    - 587
    - 993
    - 995
    Image|contains: :\Program Files\Microsoft Office\
    Image|endswith: \OUTLOOK.EXE
  selection:
    Image|endswith:
    - \excel.exe
    - \outlook.exe
    - \powerpnt.exe
    - \winword.exe
    - \wordview.exe
    Initiated: 'true'
falsepositives:
- Other ports can be used, apply additional filters accordingly
id: 3b5ba899-9842-4bc2-acc2-12308498bf42
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2024/01/31
references:
- https://blogs.blackberry.com/en/2023/07/romcom-targets-ukraine-nato-membership-talks-at-nato-summit
status: experimental
tags:
- attack.defense_evasion
- attack.command_and_control
title: Office Application Initiated Network Connection Over Uncommon Ports
