author: Michael McKinley (@McKinleyMike), Tony Latteri (@TheLatteri)
date: 2023/09/18
description: 'Detects a network connection initiated by the Add-In deployment cache
  updating utility "AddInutil.exe".

  This could indicate a potential command and control communication as this tool doesn''t
  usually initiate network activity.

  '
detection:
  condition: selection
  selection:
    Image|endswith: \addinutil.exe
    Initiated: 'true'
falsepositives:
- Unknown
id: 5205613d-2a63-4412-a895-3a2458b587b3
level: medium
logsource:
  category: network_connection
  product: windows
references:
- https://www.blue-prints.blog/content/blog/posts/lolbin/addinutil-lolbas.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1218
title: Network Connection Initiated By AddinUtil.EXE
