author: Florian Roth (Nextron Systems)
date: 2021/12/06
description: 'Detects a network connection initiated by a binary to "api.mega.co.nz".

  Attackers were seen abusing file sharing websites similar to "mega.nz" in order
  to upload/download additional payloads.

  '
detection:
  condition: selection
  selection:
    DestinationHostname|endswith:
    - mega.co.nz
    - mega.nz
    Initiated: 'true'
falsepositives:
- Legitimate MEGA installers and utilities are expected to communicate with this domain.
  Exclude hosts that are known to be allowed to use this tool.
id: fdeebdf0-9f3f-4d08-84a6-4c4d13e39fe4
level: low
logsource:
  category: network_connection
  product: windows
modified: 2024/05/31
references:
- https://megatools.megous.com/
- https://www.mandiant.com/resources/russian-targeting-gov-business
status: test
tags:
- attack.exfiltration
- attack.t1567.001
title: Network Connection Initiated To Mega.nz
