author: Kamran Saifullah, Nasreddine Bencherchali (Nextron Systems)
date: 2024/05/27
description: 'Detects network connections to Cloudflared tunnels domains initiated
  by a process on the system.

  Attackers can abuse that feature to establish a reverse shell or persistence on
  a machine.

  '
detection:
  condition: selection
  selection:
    DestinationHostname|endswith:
    - .v2.argotunnel.com
    - protocol-v2.argotunnel.com
    - trycloudflare.com
    - update.argotunnel.com
    Initiated: 'true'
falsepositives:
- Legitimate use of cloudflare tunnels will also trigger this.
id: 7cd1dcdc-6edf-4896-86dc-d1f19ad64903
level: medium
logsource:
  category: network_connection
  product: windows
references:
- https://defr0ggy.github.io/research/Abusing-Cloudflared-A-Proxy-Service-To-Host-Share-Applications/
- https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
- Internal Research
related:
- id: a1d9eec5-33b2-4177-8d24-27fe754d0812
  type: derived
status: experimental
tags:
- attack.exfiltration
- attack.command_and_control
- attack.t1567.001
title: Network Connection Initiated To Cloudflared Tunnels Domains
