author: frack113, Florian Roth (Nextron Systems)
date: 2022/08/28
description: Detects a script interpreter wscript/cscript opening a network connection
  to a non-local network. Adversaries may use script to download malicious payloads.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  filter_main_ms_ranges:
    DestinationIp|cidr: 20.0.0.0/11
  selection:
    Image|endswith:
    - \wscript.exe
    - \cscript.exe
    Initiated: 'true'
falsepositives:
- Legitimate scripts
id: 992a6cae-db6a-43c8-9cec-76d7195c96fc
level: high
logsource:
  category: network_connection
  product: windows
modified: 2024/03/13
references:
- https://github.com/redcanaryco/atomic-red-team/blob/28d190330fe44de6ff4767fc400cc10fa7cd6540/atomics/T1105/T1105.md
related:
- id: 08249dc0-a28d-4555-8ba5-9255a198e08c
  type: derived
status: test
tags:
- attack.command_and_control
- attack.t1105
title: Outbound Network Connection Initiated By Script Interpreter
