author: Christopher Peacock @securepeacock, SCYTHE @scythe_io
date: 2023/04/28
description: Detects a "winlogon.exe" process that initiate network communications
  with public IP addresses
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  selection:
    Image|endswith: \winlogon.exe
    Initiated: 'true'
falsepositives:
- Communication to other corporate systems that use IP addresses from public address
  spaces
id: 7610a4ea-c06d-495f-a2ac-0a696abcfd3b
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2024/03/12
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.command_and_control
- attack.t1218.011
title: Outbound Network Connection To Public IP Via Winlogon
