author: elhoim
date: 2022/04/28
description: Detects suspicious connections from Microsoft Sync Center to non-private
  IPs.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_local_ranges:
    DestinationIp|cidr:
    - 127.0.0.0/8
    - 10.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - ::1/128
    - fe80::/10
    - fc00::/7
  selection:
    Image|endswith: \mobsync.exe
falsepositives:
- Unknown
id: 9f2cc74d-78af-4eb2-bb64-9cd1d292b87b
level: medium
logsource:
  category: network_connection
  product: windows
modified: 2024/03/12
references:
- https://redcanary.com/blog/intelligence-insights-november-2021/
status: test
tags:
- attack.t1055
- attack.t1218
- attack.execution
- attack.defense_evasion
title: Microsoft Sync Center Suspicious Network Connections
