author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/16
description: Detects execution of AppX packages with known suspicious or malicious
  signature
detection:
  condition: selection
  selection:
    EventID: 157
    subjectName: CN=Foresee Consulting Inc., O=Foresee Consulting Inc., L=North York,
      S=Ontario, C=CA, SERIALNUMBER=1004913-1, OID.1.3.6.1.4.1.311.60.2.1.3=CA, OID.2.5.4.15=Private
      Organization
falsepositives:
- Unknown
id: b5aa7d60-c17e-4538-97de-09029d6cd76b
level: medium
logsource:
  product: windows
  service: appxpackaging-om
references:
- Internal Research
- https://www.sentinelone.com/labs/inside-malicious-windows-apps-for-malware-deployment/
status: test
tags:
- attack.defense_evasion
- attack.execution
title: Suspicious Digital Signature Of AppX Package
