author: Muhammad Faisal (@faisalusuf)
date: 2024/03/07
description: Detects if the secret scanning feature is disabled for an enterprise
  or repository.
detection:
  condition: selection
  selection:
    action:
    - business_secret_scanning.disable
    - business_secret_scanning.disabled_for_new_repos
    - repository_secret_scanning.disable
    - secret_scanning.disable
falsepositives:
- Allowed administrative activities.
id: 3883d9a0-fd0f-440f-afbb-445a2a799bb8
level: high
logsource:
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
  product: github
  service: audit
references:
- https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/about-secret-scanning
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Github Secret Scanning Feature Disabled
