author: Muhammad Faisal (@faisalusuf)
date: 2024/03/07
description: Detects when a user bypasses the push protection on a secret detected
  by secret scanning.
detection:
  condition: selection
  selection:
    action|contains: secret_scanning_push_protection.bypass
falsepositives:
- Allowed administrative activities.
id: 02cf536a-cf21-4876-8842-4159c8aee3cc
level: low
logsource:
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
  product: github
  service: audit
references:
- https://docs.github.com/en/enterprise-cloud@latest/code-security/secret-scanning/push-protection-for-repositories-and-organizations
- https://thehackernews.com/2024/03/github-rolls-out-default-secret.html
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.001
title: Github Push Protection Bypass Detected
