author: Muhammad Faisal (@faisalusuf)
date: 2023/01/20
description: Detects when a user creates action secret for the organization, environment,
  codespaces or repository.
detection:
  condition: selection
  selection:
    action:
    - codespaces.create_an_org_secret
    - environment.create_actions_secret
    - org.create_actions_secret
    - repo.create_actions_secret
falsepositives:
- This detection cloud be noisy depending on the environment. It is recommended to
  keep a check on the new secrets when created and validate the "actor".
id: f9405037-bc97-4eb7-baba-167dad399b83
level: low
logsource:
  definition: 'Requirements: The audit log streaming feature must be enabled to be
    able to receive such logs. You can enable following the documentation here: https://docs.github.com/en/enterprise-cloud@latest/admin/monitoring-activity-in-your-enterprise/reviewing-audit-logs-for-your-enterprise/streaming-the-audit-log-for-your-enterprise#setting-up-audit-log-streaming'
  product: github
  service: audit
references:
- https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings-for-your-organization/reviewing-the-audit-log-for-your-organization#audit-log-actions
status: test
tags:
- attack.defense_evasion
- attack.persistence
- attack.privilege_escalation
- attack.initial_access
- attack.t1078.004
title: Github New Secret Created
