author: Nasreddine Bencherchali (Nextron Systems), frack113
date: 2024/05/27
description: 'Detects process access request to uncommon target images with a "PROCESS_ALL_ACCESS"
  access mask.

  '
detection:
  condition: selection
  selection:
    GrantedAccess: '0x1FFFFF'
    TargetImage|endswith:
    - \calc.exe
    - \calculator.exe
    - \mspaint.exe
    - \notepad.exe
    - \ping.exe
    - \wordpad.exe
    - \write.exe
falsepositives:
- Unknown
id: a24e5861-c6ca-4fde-a93c-ba9256feddf0
level: low
logsource:
  category: process_access
  product: windows
references:
- https://learn.microsoft.com/en-us/windows/win32/procthread/process-security-and-access-rights
status: experimental
tags:
- attack.defense_evasion
- attack.privilege_escalation
- attack.t1055.011
title: Uncommon Process Access Rights For Target Image
