author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/11/28
description: Detects a Mesh Agent service installation. Mesh Agent is used to remotely
  manage computers
detection:
  condition: all of selection_*
  selection_root:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ImagePath|contains: MeshAgent.exe
  - ServiceName|contains: Mesh Agent
falsepositives:
- Legitimate use of the tool
id: e0d1ad53-c7eb-48ec-a87a-72393cc6cedc
level: medium
logsource:
  product: windows
  service: system
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
status: test
tags:
- attack.command_and_control
- attack.t1219
title: Mesh Agent Service Installation
