author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/11/28
description: Detects a TacticalRMM service installation. Tactical RMM is a remote
  monitoring & management tool.
detection:
  condition: all of selection_*
  selection_root:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ImagePath|contains: tacticalrmm.exe
  - ServiceName|contains: TacticalRMM Agent Service
falsepositives:
- Legitimate use of the tool
id: 4bb79b62-ef12-4861-981d-2aab43fab642
level: medium
logsource:
  product: windows
  service: system
references:
- https://thedfirreport.com/2022/11/28/emotet-strikes-again-lnk-file-leads-to-domain-wide-ransomware/
status: test
tags:
- attack.command_and_control
- attack.t1219
title: TacticalRMM Service Installation
