author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/07
description: Detects RemCom service installation and execution events
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ServiceName: RemComSvc
  - ImagePath|endswith: \RemComSvc.exe
falsepositives:
- Unknown
id: 9e36ed87-4986-482e-8e3b-5c23ffff11bf
level: medium
logsource:
  product: windows
  service: system
references:
- https://github.com/kavika13/RemCom/
status: experimental
tags:
- attack.execution
- attack.t1569.002
title: RemCom Service Installation
