author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/31
description: Detects Remote Utilities Host service installation on the target system.
detection:
  condition: all of selection_*
  selection_root:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ImagePath|contains|all:
    - \rutserv.exe
    - -service
  - ServiceName: Remote Utilities - Host
falsepositives:
- Legitimate use of the tool
id: 85cce894-dd8b-4427-a958-5cc47a4dc9b9
level: medium
logsource:
  product: windows
  service: system
references:
- https://www.remoteutilities.com/support/kb/host-service-won-t-start/
status: test
tags:
- attack.persistence
title: Remote Utilities Host Service Install
