author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/07/22
description: 'Detects a PDQDeploy service installation which indicates that PDQDeploy
  was installed on the machines.

  PDQDeploy can be abused by attackers to remotely install packages or execute commands
  on target machines

  '
detection:
  condition: all of selection_*
  selection_root:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ImagePath|contains: PDQDeployService.exe
  - ServiceName:
    - PDQDeploy
    - PDQ Deploy
falsepositives:
- Legitimate use of the tool
id: ee9ca27c-9bd7-4cee-9b01-6e906be7cae3
level: medium
logsource:
  product: windows
  service: system
references:
- https://documentation.pdq.com/PDQDeploy/13.0.3.0/index.html?windows-services.htm
status: test
tags:
- attack.privilege_escalation
- attack.t1543.003
title: New PDQDeploy Service - Server Side
