author: Florian Roth (Nextron Systems)
date: 2021/05/27
description: Detects a ProcessHacker tool that elevated privileges to a very high
  level
detection:
  condition: selection
  selection:
    AccountName: LocalSystem
    EventID: 7045
    Provider_Name: Service Control Manager
    ServiceName|startswith: ProcessHacker
falsepositives:
- Unlikely
id: c4ff1eac-84ad-44dd-a6fb-d56a92fc43a9
level: high
logsource:
  product: windows
  service: system
modified: 2022/12/25
references:
- https://twitter.com/1kwpeter/status/1397816101455765504
status: test
tags:
- attack.execution
- attack.privilege_escalation
- attack.t1543.003
- attack.t1569.002
title: ProcessHacker Privilege Elevation
