author: Daniil Yugoslavskiy, Ian Davis, oscd.community
date: 2019/10/24
description: Well-known TAP software installation. Possible preparation for data exfiltration
  using tunnelling techniques
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains: tap0901
    Provider_Name: Service Control Manager
falsepositives:
- Legitimate OpenVPN TAP installation
id: 8e4cf0e5-aa5d-4dc3-beff-dc26917744a9
level: medium
logsource:
  product: windows
  service: system
modified: 2022/12/25
references:
- https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
status: test
tags:
- attack.exfiltration
- attack.t1048
title: Tap Driver Installation
