author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/08/07
description: Detects CSExec service installation and execution events
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ServiceName: csexecsvc
  - ImagePath|endswith: \csexecsvc.exe
falsepositives:
- Unknown
id: a27e5fa9-c35e-4e3d-b7e0-1ce2af66ad12
level: medium
logsource:
  product: windows
  service: system
references:
- https://github.com/malcomvetter/CSExec
status: experimental
tags:
- attack.execution
- attack.t1569.002
title: CSExec Service Installation
