author: Teymur Kheirkhabarov, Ecco, Florian Roth (Nextron Systems)
date: 2019/10/26
description: Detects the use of getsystem Meterpreter/Cobalt Strike command by detecting
  a specific service installation
detection:
  condition: selection_id and 1 of selection_cli_*
  selection_cli_cmd:
    ImagePath|contains:
    - cmd
    - '%COMSPEC%'
    ImagePath|contains|all:
    - /c
    - echo
    - \pipe\
  selection_cli_rundll:
    ImagePath|contains|all:
    - rundll32
    - .dll,a
    - '/p:'
  selection_cli_share:
    ImagePath|startswith: \\\\127.0.0.1\\ADMIN$\
  selection_id:
    EventID: 7045
    Provider_Name: Service Control Manager
falsepositives:
- Unlikely
id: 843544a7-56e0-4dcc-a44f-5cc266dd97d6
level: high
logsource:
  product: windows
  service: system
modified: 2023/11/15
references:
- https://speakerdeck.com/heirhabarov/hunting-for-privilege-escalation-in-windows-environment
- https://blog.cobaltstrike.com/2014/04/02/what-happens-when-i-type-getsystem/
status: test
tags:
- attack.privilege_escalation
- attack.t1134.001
- attack.t1134.002
title: Meterpreter or Cobalt Strike Getsystem Service Installation - System
