author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/31
description: Detects NetSupport Manager service installation on the target system.
detection:
  condition: all of selection_*
  selection_root:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ImagePath|contains: \NetSupport Manager\client32.exe
  - ServiceName: Client32
falsepositives:
- Legitimate use of the tool
id: 2d510d8d-912b-45c5-b1df-36faa3d8c3f4
level: medium
logsource:
  product: windows
  service: system
references:
- http://resources.netsupportsoftware.com/resources/manualpdfs/nsm_manual_uk.pdf
status: test
tags:
- attack.persistence
title: NetSupport Manager Service Install
