author: pH-T (Nextron Systems)
date: 2022/03/18
description: Detects service installation with suspicious folder patterns
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_img_paths:
  - ImagePath|re: ^[Cc]:\\[Pp]rogram[Dd]ata\\.{1,9}\.exe
  - ImagePath|re: ^[Cc]:\\.{1,9}\.exe
falsepositives:
- Unknown
id: 1b2ae822-6fe1-43ba-aa7c-d1a3b3d1d5f2
level: high
logsource:
  product: windows
  service: system
modified: 2022/03/24
references:
- Internal Research
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Service Installation with Suspicious Folder Pattern
