author: pH-T (Nextron Systems)
date: 2022/03/18
description: Detects service installation in suspicious folder appdata
detection:
  condition: selection and not 1 of filter_optional_*
  filter_optional_zoom:
    ImagePath|contains: :\Program Files\Common Files\Zoom\Support\CptService.exe
    ServiceName: Zoom Sharing Service
  selection:
    EventID: 7045
    ImagePath|contains:
    - \AppData\
    - \\\\127.0.0.1
    - \\\\localhost
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 5e993621-67d4-488a-b9ae-b420d08b96cb
level: medium
logsource:
  product: windows
  service: system
modified: 2024/01/18
references:
- Internal Research
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Service Installation in Suspicious Folder
