author: Jonathan Cheong, oscd.community
date: 2020/10/15
description: Detects Obfuscated use of stdin to execute PowerShell
detection:
  condition: all of selection_*
  selection_main:
    EventID: 7045
    ImagePath|contains:
    - /c
    - /r
    ImagePath|contains|all:
    - cmd
    - powershell
    Provider_Name: Service Control Manager
  selection_other:
  - ImagePath|contains: noexit
  - ImagePath|contains|all:
    - input
    - $
falsepositives:
- Unknown
id: 72862bf2-0eb1-11eb-adc1-0242ac120002
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation STDIN+ Launcher - System
