author: Bhabesh Raj
date: 2021/05/06
description: Detects the use of Moriya rootkit as described in the securelist's Operation
  TunnelSnake report
detection:
  condition: selection
  selection:
    EventID: 7045
    Provider_Name: Service Control Manager
    ServiceName: ZzNetSvc
falsepositives:
- Unknown
id: 25b9c01c-350d-4b95-bed1-836d04a4f324
level: critical
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://securelist.com/operation-tunnelsnake-and-moriya-rootkit/101831
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- attack.t1543.003
title: Moriya Rootkit - System
