author: Nikita Nazarov, oscd.community
date: 2020/10/12
description: Detects Obfuscated Powershell via Stdin in Scripts
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - environment
    - invoke
    - input
    ImagePath|contains|all:
    - set
    - '&&'
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 487c7524-f892-4054-b263-8a0ace63fc25
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Stdin - System
