author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Clip.exe in Scripts
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains: (Clipboard|i
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 63e3365d-4824-42d8-8b82-e56810fefa0c
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Clip - System
