author: Jonathan Cheong, oscd.community
date: 2020/10/15
description: Detects Obfuscated use of Environment Variables to execute PowerShell
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - /c
    - /r
    ImagePath|contains|all:
    - cmd
    - '"set'
    - -f
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 8ca7004b-e620-4ecb-870e-86129b5b8e75
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation VAR+ Launcher - System
