author: Timur Zinniatullin, oscd.community
date: 2020/10/13
description: Detects Obfuscated Powershell via VAR++ LAUNCHER
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - '{0}'
    - '{1}'
    - '{2}'
    - '{3}'
    - '{4}'
    - '{5}'
    ImagePath|contains|all:
    - '&&set'
    - cmd
    - /c
    - -f
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 14bcba49-a428-42d9-b943-e2ce0f0f7ae6
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation VAR++ LAUNCHER OBFUSCATION - System
