author: Connor Martin, Nasreddine Bencherchali
date: 2022/12/23
description: Detects service installation of different remote access tools software.
  These software are often abused by threat actors to perform
detection:
  condition: selection
  selection:
    EventID:
    - 7045
    - 7036
    Provider_Name: Service Control Manager
    ServiceName|contains:
    - AmmyyAdmin
    - Atera
    - BASupportExpressSrvcUpdater
    - BASupportExpressStandaloneService
    - chromoting
    - GoToAssist
    - GoToMyPC
    - jumpcloud
    - LMIGuardianSvc
    - LogMeIn
    - monblanking
    - Parsec
    - RManService
    - RPCPerformanceService
    - RPCService
    - SplashtopRemoteService
    - SSUService
    - TeamViewer
    - TightVNC
    - vncserver
    - Zoho
falsepositives:
- Unknown
id: 1a31b18a-f00c-4061-9900-f735b96c99fc
level: medium
logsource:
  product: windows
  service: system
modified: 2023/06/22
references:
- https://redcanary.com/blog/misbehaving-rats/
related:
- id: c8b00925-926c-47e3-beea-298fd563728e
  type: similar
status: test
tags:
- attack.persistence
- attack.t1543.003
- attack.t1569.002
title: Remote Access Tool Services Have Been Installed - System
