author: pH-T (Nextron Systems)
date: 2022/03/18
description: Detects suspicious service installation scripts
detection:
  condition: all of selection_*
  selection_binaries:
    ImagePath|contains:
    - cscript
    - mshta
    - powershell
    - pwsh
    - regsvr32
    - rundll32
    - wscript
  selection_cmd_flags:
    ImagePath|contains|windash:
    - ' -c '
    - ' -r '
    - ' -k '
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 70f00d10-60b2-4f34-b9a0-dc3df3fe762a
level: high
logsource:
  product: windows
  service: system
modified: 2024/03/05
references:
- Internal Research
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Suspicious Service Installation Script
