author: Jonathan Cheong, oscd.community
date: 2020/10/13
description: Detects Obfuscated use of Clip.exe to execute PowerShell
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains|all:
    - cmd
    - '&&'
    - 'clipboard]::'
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: f7385ee2-0e0c-11eb-adc1-0242ac120002
level: high
logsource:
  product: windows
  service: system
modified: 2023/02/20
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation CLIP+ Launcher - System
