author: oscd.community, Natalia Shornikova
date: 2020/10/06
description: Detects powershell script installed as a Service
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - powershell
    - pwsh
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: a2e5019d-a658-4c6a-92bf-7197b54e2cae
level: high
logsource:
  product: windows
  service: system
modified: 2022/12/25
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
status: test
tags:
- attack.execution
- attack.t1569.002
title: PowerShell Scripts Installed as Services
