author: Timur Zinniatullin, oscd.community
date: 2020/10/18
description: Detects Obfuscated Powershell via COMPRESS OBFUSCATION
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - :system.io.compression.deflatestream
    - system.io.streamreader
    ImagePath|contains|all:
    - new-object
    - text.encoding]::ascii
    - readtoend
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 175997c5-803c-4b08-8bb0-70b099f47595
level: medium
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation COMPRESS OBFUSCATION - System
