author: Nasreddine Bencherchali (Nextron Systems)
date: 2022/10/26
description: Detects PAExec service installation
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_image:
  - ServiceName|startswith: PAExec-
  - ImagePath|startswith: C:\WINDOWS\PAExec-
falsepositives:
- Unknown
id: de7ce410-b3fb-4e8a-b38c-3b999e2c3420
level: medium
logsource:
  product: windows
  service: system
references:
- https://www.poweradmin.com/paexec/
status: test
tags:
- attack.execution
- attack.t1569.002
title: PAExec Service Installation
