author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/04/14
description: Detects Windows services that got terminated for whatever reason
detection:
  condition: selection
  selection:
    EventID: 7023
    Provider_Name: Service Control Manager
falsepositives:
- False positives could occur since service termination could happen due to multiple
  reasons
id: acfa2210-0d71-4eeb-b477-afab494d596c
level: low
logsource:
  product: windows
  service: system
references:
- https://www.microsoft.com/en-us/security/blog/2023/04/11/guidance-for-investigating-attacks-using-cve-2022-21894-the-blacklotus-campaign/
related:
- id: d6b5520d-3934-48b4-928c-2aa3f92d6963
  type: similar
status: test
tags:
- attack.defense_evasion
title: Windows Service Terminated With Error
