author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use MSHTA in Scripts
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains|all:
    - mshta
    - vbscript:createobject
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 7e9c7999-0f9b-4d4a-a6ed-af6d553d4af4
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use MSHTA - System
