author: Thomas Patzke
date: 2017/06/12
description: Detects PsExec service installation and execution events
detection:
  condition: all of selection_*
  selection_eid:
    EventID: 7045
    Provider_Name: Service Control Manager
  selection_service:
  - ServiceName: PSEXESVC
  - ImagePath|endswith: \PSEXESVC.exe
falsepositives:
- Unknown
id: 42c575ea-e41e-41f1-b248-8093c3e82a28
level: medium
logsource:
  product: windows
  service: system
modified: 2023/08/04
references:
- https://www.jpcert.or.jp/english/pub/sr/ir_research.html
- https://jpcertcc.github.io/ToolAnalysisResultSheet
status: test
tags:
- attack.execution
- attack.t1569.002
- attack.s0029
title: PsExec Service Installation
