author: pH-T (Nextron Systems), Florian Roth (Nextron Systems)
date: 2022/03/18
description: Detects suspicious service installation commands
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - ' -nop '
    - ' -sta '
    - ' -w hidden '
    - :\Temp\
    - .downloadfile(
    - .downloadstring(
    - \ADMIN$\
    - \Perflogs\
    - '&&'
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
level: high
logsource:
  product: windows
  service: system
modified: 2023/12/04
references:
- Internal Research
related:
- id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
  type: obsoletes
- id: 26481afe-db26-4228-b264-25a29fe6efc7
  type: similar
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Suspicious Service Installation
