author: Florian Roth (Nextron Systems)
date: 2022/03/18
description: 'Detects uncommon service installation commands by looking at suspicious
  or uncommon image path values containing references to encoded powershell commands,
  temporary paths, etc.

  '
detection:
  condition: selection and ( suspicious_paths or all of suspicious_encoded_* ) and
    not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_defender_def_updates:
    ImagePath|startswith: C:\ProgramData\Microsoft\Windows Defender\Definition Updates\
  filter_optional_thor_remote:
    ImagePath|startswith: C:\WINDOWS\TEMP\thor10-remote\thor64.exe
  selection:
    EventID: 7045
    Provider_Name: Service Control Manager
  suspicious_encoded_flag:
    ImagePath|contains: ' -e'
  suspicious_encoded_keywords:
    ImagePath|contains:
    - ' aQBlAHgA'
    - ' aWV4I'
    - ' IAB'
    - ' JAB'
    - ' PAA'
    - ' SQBFAFgA'
    - ' SUVYI'
  suspicious_paths:
    ImagePath|contains:
    - \\\\.\\pipe
    - \Users\Public\
    - \Windows\Temp\
falsepositives:
- Unknown
id: 26481afe-db26-4228-b264-25a29fe6efc7
level: medium
logsource:
  product: windows
  service: system
modified: 2024/02/09
references:
- Internal Research
related:
- id: ca83e9f3-657a-45d0-88d6-c1ac280caf53
  type: obsoletes
- id: 1d61f71d-59d2-479e-9562-4ff5f4ead16b
  type: derived
status: test
tags:
- attack.persistence
- attack.privilege_escalation
- car.2013-09-005
- attack.t1543.003
title: Uncommon Service Installation Image Path
