author: Nikita Nazarov, oscd.community
date: 2020/10/09
description: Detects Obfuscated Powershell via use Rundll32 in Scripts
detection:
  condition: selection
  selection:
    EventID: 7045
    ImagePath|contains:
    - value
    - invoke
    - comspec
    - iex
    ImagePath|contains|all:
    - '&&'
    - rundll32
    - shell32.dll
    - shellexec_rundll
    Provider_Name: Service Control Manager
falsepositives:
- Unknown
id: 641a4bfb-c017-44f7-800c-2aee0184ce9b
level: high
logsource:
  product: windows
  service: system
modified: 2022/11/29
references:
- https://github.com/SigmaHQ/sigma/issues/1009
status: test
tags:
- attack.defense_evasion
- attack.t1027
- attack.execution
- attack.t1059.001
title: Invoke-Obfuscation Via Use Rundll32 - System
