author: daniel.bohannon@permiso.io (@danielhbohannon)
date: 2023/05/17
description: Detects S3 browser utility creating Inline IAM policy containing default
  S3 bucket name placeholder value of "<YOUR-BUCKET-NAME>".
detection:
  condition: selection
  selection:
    eventName: PutUserPolicy
    eventSource: iam.amazonaws.com
    requestParameters|contains|all:
    - '"arn:aws:s3:::<YOUR-BUCKET-NAME>/*"'
    - '"s3:GetObject"'
    - '"Allow"'
    userAgent|contains: S3 Browser
falsepositives:
- Valid usage of S3 browser with accidental creation of default Inline IAM policy
  without changing default S3 bucket name placeholder value
id: db014773-7375-4f4e-b83b-133337c0ffee
level: high
logsource:
  product: aws
  service: cloudtrail
modified: 2023/05/17
references:
- https://permiso.io/blog/s/unmasking-guivil-new-cloud-threat-actor
status: test
tags:
- attack.execution
- attack.t1059.009
- attack.persistence
- attack.t1078.004
title: AWS IAM S3Browser Templated S3 Bucket Policy Creation
