author: toffeebr33k
date: 2021/08/09
description: 'Detects activity when someone is changing passwords on behalf of other
  users.

  An attacker with the "iam:UpdateLoginProfile" permission on other users can change
  the password used to login to the AWS console on any user that already has a login
  profile setup.

  '
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_user_identity:
    userIdentity.arn|fieldref: requestParameters.userName
  selection:
    eventName: UpdateLoginProfile
    eventSource: iam.amazonaws.com
falsepositives:
- Legitimate user account administration
id: 055fb148-60f8-462d-ad16-26926ce050f1
level: high
logsource:
  product: aws
  service: cloudtrail
modified: 2024/04/26
references:
- https://github.com/RhinoSecurityLabs/AWS-IAM-Privilege-Escalation
status: test
tags:
- attack.persistence
- attack.t1098
title: AWS User Login Profile Was Modified
