author: Sean Johnstone | Unit 42
date: 2023/10/28
description: Detects when S3 bucket versioning is disabled. Threat actors use this
  technique during AWS ransomware incidents prior to deleting S3 objects.
detection:
  condition: selection
  selection:
    eventName: PutBucketVersioning
    eventSource: s3.amazonaws.com
    requestParameters|contains: Suspended
falsepositives:
- AWS administrator legitimately disabling bucket versioning
id: a136ac98-b2bc-4189-a14d-f0d0388e57a7
level: medium
logsource:
  product: aws
  service: cloudtrail
references:
- https://invictus-ir.medium.com/ransomware-in-the-cloud-7f14805bbe82
status: experimental
tags:
- attack.impact
- attack.t1490
title: AWS S3 Bucket Versioning Disable
