author: Diogo Braz
date: 2020/04/16
description: An attempt to export an AWS EC2 instance has been detected. A VM Export
  might indicate an attempt to extract information from an instance.
detection:
  condition: selection and not 1 of filter*
  filter1:
    errorMessage|contains: '*'
  filter2:
    errorCode|contains: '*'
  filter3:
    responseElements|contains: Failure
  selection:
    eventName: CreateInstanceExportTask
    eventSource: ec2.amazonaws.com
id: 54b9a76a-3c71-4673-b4b3-2edb4566ea7b
level: low
logsource:
  product: aws
  service: cloudtrail
modified: 2022/10/05
references:
- https://docs.aws.amazon.com/vm-import/latest/userguide/vmexport.html#export-instance
status: test
tags:
- attack.collection
- attack.t1005
- attack.exfiltration
- attack.t1537
title: AWS EC2 VM Export Failure
