author: Saw Win Naung, Nasreddine Bencherchali
date: 2021/08/15
description: Detects XSS attempts injected via GET requests in access logs
detection:
  condition: select_method and keywords and not filter
  filter:
    sc-status: 404
  keywords:
  - =<script>
  - =%3Cscript%3E
  - =%253Cscript%253E
  - '<iframe '
  - '%3Ciframe '
  - '<svg '
  - '%3Csvg '
  - document.cookie
  - document.domain
  - ' onerror='
  - ' onresize='
  - ' onload="'
  - onmouseover=
  - ${alert
  - javascript:alert
  - javascript%3Aalert
  select_method:
    cs-method: GET
falsepositives:
- JavaScripts,CSS Files and PNG files
- User searches in search boxes of the respective website
- Internal vulnerability scanners can cause some serious FPs when used, if you experience
  a lot of FPs due to this think of adding more filters such as "User Agent" strings
  and more response codes
fields:
- client_ip
- vhost
- url
- response
id: 65354b83-a2ea-4ea6-8414-3ab38be0d409
level: high
logsource:
  category: webserver
modified: 2022/06/14
references:
- https://github.com/payloadbox/xss-payload-list
- https://portswigger.net/web-security/cross-site-scripting/contexts
status: test
tags:
- attack.initial_access
- attack.t1189
title: Cross Site Scripting Strings
