author: Cian Heasley
date: 2020/08/04
description: Certain strings in the uri_query field when combined with null referer
  and null user agent can indicate activity associated with the webshell ReGeorg.
detection:
  condition: selection and filter
  filter:
    cs-method: POST
    cs-referer: null
    cs-user-agent: null
  selection:
    cs-uri-query|contains:
    - cmd=read
    - connect&target
    - cmd=connect
    - cmd=disconnect
    - cmd=forward
falsepositives:
- Web applications that use the same URL parameters as ReGeorg
fields:
- cs-uri-query
- cs-referer
- cs-method
- cs-User-Agent
id: 2ea44a60-cfda-11ea-87d0-0242ac130003
level: high
logsource:
  category: webserver
modified: 2023/01/02
references:
- https://community.rsa.com/community/products/netwitness/blog/2019/02/19/web-shells-and-netwitness-part-3
- https://github.com/sensepost/reGeorg
status: test
tags:
- attack.persistence
- attack.t1505.003
title: Webshell ReGeorg Detection Via Web Logs
