author: frack113
date: 2021/10/06
description: When IIS uses an old .Net Framework it's possible to enumerate folders
  with the symbol "~"
detection:
  condition: selection
  selection:
    cs-method:
    - GET
    - OPTIONS
    cs-uri-query|contains: ~1
    cs-uri-query|endswith: a.aspx
    sc-status:
    - 200
    - 301
falsepositives:
- Unknown
id: 7cb02516-6d95-4ffc-8eee-162075e111ac
level: medium
logsource:
  category: webserver
modified: 2023/01/02
references:
- https://github.com/projectdiscovery/nuclei-templates/blob/9d2889356eebba661c8407038e430759dfd4ec31/fuzzing/iis-shortname.yaml
- https://www.exploit-db.com/exploits/19525
- https://github.com/lijiejie/IIS_shortname_Scanner
status: test
tags:
- attack.initial_access
- attack.t1190
title: Successful IIS Shortname Fuzzing Scan
