author: Roberto Rodriguez (Cyb3rWard0g), OTR (Open Threat Research)
date: 2020/05/02
description: 'Detects any deletion of entries in ".*\shell\open\command" registry
  keys.

  These registry keys might have been used for COM hijacking activities by a threat
  actor or an attacker and the deletion could indicate steps to remove its tracks.

  '
detection:
  condition: selection and not 1 of filter_*
  filter_dropbox:
    Image|endswith: \Dropbox.exe
    TargetObject|contains: \Dropbox.
  filter_everything:
    Image|endswith: \Everything.exe
    TargetObject|contains: \Everything.
  filter_integrator:
    Image: C:\Program Files (x86)\Microsoft Office\root\integration\integrator.exe
  filter_java:
    Image|endswith: \installer.exe
    Image|startswith: C:\Program Files (x86)\Java\
    TargetObject|contains: \Classes\WOW6432Node\CLSID\{4299124F-F2C3-41b4-9C73-9236B2AD0E8F}
  filter_office:
    Image|endswith: \OfficeClickToRun.exe
    Image|startswith:
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\
    - C:\Program Files\Common Files\Microsoft Shared\ClickToRun\Updates\
  filter_opera:
    Image|endswith: \installer.exe
    Image|startswith:
    - C:\Program Files\Opera\
    - C:\Program Files (x86)\Opera\
  filter_peazip:
    Image|contains: peazip
    TargetObject|contains: \PeaZip.
  filter_svchost:
    Image: C:\Windows\system32\svchost.exe
  filter_uninstallers:
    Image|startswith: C:\Windows\Installer\MSI
  filter_wireshark:
    Image|endswith: \AppData\Local\Temp\Wireshark_uninstaller.exe
    TargetObject|contains: \wireshark-capture-file\
  selection:
    EventType: DeleteKey
    TargetObject|endswith: \shell\open\command
falsepositives:
- Legitimate software (un)installations are known to cause some false positives. Please
  add them as a filter when encountered
id: 96f697b0-b499-4e5d-9908-a67bec11cdb6
level: medium
logsource:
  category: registry_delete
  product: windows
modified: 2023/01/19
references:
- https://github.com/OTRF/detection-hackathon-apt29/issues/7
- https://github.com/OTRF/ThreatHunter-Playbook/blob/2d4257f630f4c9770f78d0c1df059f891ffc3fec/docs/evals/apt29/detections/3.C.1_22A46621-7A92-48C1-81BF-B3937EB4FDC3.md
- https://docs.microsoft.com/en-us/windows/win32/shell/launch
- https://docs.microsoft.com/en-us/windows/win32/api/shobjidl_core/nn-shobjidl_core-iexecutecommand
- https://docs.microsoft.com/en-us/windows/win32/shell/shell-and-managed-code
status: test
tags:
- attack.defense_evasion
- attack.t1112
title: Removal of Potential COM Hijacking Registry Keys
