author: Samir Bousseaden, @neu5ron, Tim Shelton
date: 2020/04/02
description: detects execution of psexec or paexec with renamed service name, this
  rule helps to filter out the noise if psexec is used for legit purposes or if attacker
  uses a different psexec client other than sysinternal one
detection:
  condition: selection and not filter
  filter:
    name|startswith: PSEXESVC
  selection:
    name|endswith:
    - -stdin
    - -stdout
    - -stderr
    path|contains|all:
    - \\
    - \IPC$
falsepositives:
- Unknown
id: f1b3a22a-45e6-4004-afb5-4291f9c21166
level: high
logsource:
  product: zeek
  service: smb_files
modified: 2022/12/27
references:
- https://blog.menasec.net/2019/02/threat-hunting-3-detecting-psexec.html
related:
- id: c462f537-a1e3-41a6-b5fc-b2c2cef9bf82
  type: derived
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: Suspicious PsExec Execution - Zeek
