author: Samir Bousseaden, @neu5rn
date: 2020/04/03
description: Detects remote task creation via at.exe or API interacting with ATSVC
  namedpipe
detection:
  condition: selection
  selection:
    name: atsvc
    path: \\\*\IPC$
falsepositives:
- Unknown
id: dde85b37-40cd-4a94-b00c-0b8794f956b5
level: medium
logsource:
  product: zeek
  service: smb_files
modified: 2022/12/27
references:
- https://blog.menasec.net/2019/03/threat-hunting-25-scheduled-tasks-for.html
related:
- id: f6de6525-4509-495a-8a82-1f8b0ed73a00
  type: derived
status: test
tags:
- attack.lateral_movement
- attack.persistence
- car.2013-05-004
- car.2015-04-001
- attack.t1053.002
title: Remote Task Creation via ATSVC Named Pipe - Zeek
