author: Samir Bousseaden, @neu5ron, Tim Shelton
date: 2020/04/02
description: This detection excludes known namped pipes accessible remotely and notify
  on newly observed ones, may help to detect lateral movement and remote exec using
  named pipes
detection:
  condition: selection and not 1 of filter_*
  filter_keywords:
  - samr
  - lsarpc
  - winreg
  - netlogon
  - srvsvc
  - protected_storage
  - wkssvc
  - browser
  - netdfs
  - svcctl
  - spoolss
  - ntsvcs
  - LSM_API_service
  - HydraLsPipe
  - TermSrv_API_service
  - MsFteWds
  selection:
    path: \\\\\*\\IPC$
falsepositives:
- Update the excluded named pipe to filter out any newly observed legit named pipe
id: 021310d9-30a6-480a-84b7-eaa69aeb92bb
level: high
logsource:
  product: zeek
  service: smb_files
modified: 2022/12/27
references:
- https://twitter.com/menasec1/status/1104489274387451904
related:
- id: 52d8b0c6-53d6-439a-9e41-52ad442ad9ad
  type: derived
status: test
tags:
- attack.lateral_movement
- attack.t1021.002
title: First Time Seen Remote Named Pipe - Zeek
