author: '@neu5ron, Teymur Kheirkhabarov, oscd.community'
date: 2020/04/02
description: Transferring files with well-known filenames (sensitive files with credential
  data) using network shares
detection:
  condition: selection
  selection:
    name:
    - \mimidrv
    - \lsass
    - \windows\minidump\
    - \hiberfil
    - \sqldmpr
    - \sam
    - \ntds.dit
    - \security
falsepositives:
- Transferring sensitive files for legitimate administration work by legitimate administrator
id: 2e69f167-47b5-4ae7-a390-47764529eff5
level: medium
logsource:
  product: zeek
  service: smb_files
modified: 2021/11/27
references:
- https://www.slideshare.net/heirhabarov/hunting-for-credentials-dumping-in-windows-environment
related:
- id: 910ab938-668b-401b-b08c-b596e80fdca5
  type: similar
status: test
tags:
- attack.credential_access
- attack.t1003.002
- attack.t1003.001
- attack.t1003.003
title: Transferring Files with Credential Data via Network Shares - Zeek
