author: Josh Brower @DefensiveDepth
date: 2020/08/22
description: 'Detects connections from routable IPs to an RDP listener. Which is indicative
  of a publicly-accessible RDP service.

  '
detection:
  condition: not selection
  selection:
    id.orig_h|cidr:
    - ::1/128
    - 10.0.0.0/8
    - 127.0.0.0/8
    - 172.16.0.0/12
    - 192.168.0.0/16
    - 169.254.0.0/16
    - 2620:83:8000::/48
    - fc00::/7
    - fe80::/10
falsepositives:
- Although it is recommended to NOT have RDP exposed to the internet, verify that
  this is a) allowed b) the server has not already been compromised via some brute
  force or remote exploit since it has been exposed to the internet. Work to secure
  the server if you are unable to remove it from being exposed to the internet.
id: 1fc0809e-06bf-4de3-ad52-25e5263b7623
level: high
logsource:
  product: zeek
  service: rdp
modified: 2024/03/13
references:
- https://attack.mitre.org/techniques/T1021/001/
status: test
tags:
- attack.lateral_movement
- attack.t1021.001
title: Publicly Accessible RDP Service
