author: Jerry Shockley '@jsh0x'
date: 2022/02/02
description: Detects common NTLM brute force device names
detection:
  condition: selection and devicename
  devicename:
    WorkstationName:
    - Rdesktop
    - Remmina
    - Freerdp
    - Windows7
    - Windows8
    - Windows2012
    - Windows2016
    - Windows2019
  selection:
    EventID: 8004
falsepositives:
- Systems with names equal to the spoofed ones used by the brute force tools
id: 9c8acf1a-cbf9-4db6-b63c-74baabe03e59
level: medium
logsource:
  definition: Requires events from Microsoft-Windows-NTLM/Operational
  product: windows
  service: ntlm
references:
- https://www.varonis.com/blog/investigate-ntlm-brute-force
status: test
tags:
- attack.credential_access
- attack.t1110
title: NTLM Brute Force
