author: Austin Clark
date: 2019/08/12
description: Clear command history in network OS which is used for defense evasion
detection:
  condition: keywords
  keywords:
  - clear logging
  - clear archive
falsepositives:
- Legitimate administrators may run these commands
id: ceb407f6-8277-439b-951f-e4210e3ed956
level: high
logsource:
  product: cisco
  service: aaa
modified: 2023/05/26
references:
- https://www.cisco.com/c/en/us/td/docs/switches/datacenter/nexus5000/sw/command/reference/sysmgmt/n5k-sysmgmt-cr/n5k-sm_cmds_c.html
- https://www.cisco.com/c/en/us/td/docs/ios/12_2sr/12_2sra/feature/guide/srmgtint.html#wp1127609
status: test
tags:
- attack.defense_evasion
- attack.t1070.003
title: Cisco Clear Logs
