author: Austin Clark
date: 2019/08/12
description: Show when private keys are being exported from the device, or when new
  certificates are installed
detection:
  condition: keywords
  keywords:
  - crypto pki export
  - crypto pki import
  - crypto pki trustpoint
falsepositives:
- Not commonly run by administrators. Also whitelist your known good certificates
id: 1f978c6a-4415-47fb-aca5-736a44d7ca3d
level: high
logsource:
  product: cisco
  service: aaa
modified: 2023/01/04
references:
- https://www.cisco.com/c/en/us/td/docs/ios-xml/ios/security/a1/sec-a1-cr-book/sec-a1-cr-book_chapter_0111.html
status: test
tags:
- attack.credential_access
- attack.defense_evasion
- attack.t1553.004
- attack.t1552.004
title: Cisco Crypto Commands
