author: Austin Clark
date: 2019/08/12
description: Find information about network devices that is not stored in config files
detection:
  condition: keywords
  keywords:
  - dir
  - show arp
  - show cdp
  - show clock
  - show ip interface
  - show ip route
  - show ip sockets
  - show processes
  - show ssh
  - show users
  - show version
falsepositives:
- Commonly used by administrators for troubleshooting
id: 9705a6a1-6db6-4a16-a987-15b7151e299b
level: low
logsource:
  product: cisco
  service: aaa
modified: 2023/01/04
references:
- https://www.cisco.com/c/en/us/td/docs/server_nw_virtual/2-5_release/command_reference/show.html
status: test
tags:
- attack.discovery
- attack.t1083
- attack.t1201
- attack.t1057
- attack.t1018
- attack.t1082
- attack.t1016
- attack.t1049
- attack.t1033
- attack.t1124
title: Cisco Discovery
