author: Austin Clark
date: 2019/08/11
description: Turn off logging locally or remote
detection:
  condition: keywords
  keywords:
  - no logging
  - no aaa new-model
falsepositives:
- Unknown
fields:
- src
- CmdSet
- User
- Privilege_Level
- Remote_Address
id: 9e8f6035-88bf-4a63-96b6-b17c0508257e
level: high
logsource:
  product: cisco
  service: aaa
modified: 2023/01/04
references:
- https://www.cisco.com/en/US/docs/ios/security/command/reference/sec_a2.pdf
status: test
tags:
- attack.defense_evasion
- attack.t1562.001
title: Cisco Disabling Logging
