author: Austin Clark
date: 2019/08/11
description: Show when a monitor or a span/rspan is setup or modified
detection:
  condition: keywords
  keywords:
  - monitor capture point
  - set span
  - set rspan
falsepositives:
- Admins may setup new or modify old spans, or use a monitor for troubleshooting
fields:
- CmdSet
id: b9e1f193-d236-4451-aaae-2f3d2102120d
level: medium
logsource:
  product: cisco
  service: aaa
modified: 2023/01/04
status: test
tags:
- attack.credential_access
- attack.discovery
- attack.t1040
title: Cisco Sniffing
