author: frack113
date: 2022/02/19
description: Detects when a rule has been added to the Windows Firewall exception
  list
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_block:
    Action: 2
  filter_main_covered_paths:
    ApplicationPath|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Tmp\
    - :\Users\Public\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
  filter_main_generic:
    ApplicationPath|contains:
    - :\Program Files (x86)\
    - :\Program Files\
    - :\Windows\System32\
    - :\Windows\SysWOW64\
    - :\Windows\WinSxS\
  filter_optional_msmpeng:
    ModifyingApplication|contains|all:
    - :\ProgramData\Microsoft\Windows Defender\Platform\
    - \MsMpEng.exe
  selection:
    EventID:
    - 2004
    - 2071
    - 2097
id: cde0a575-7d3d-4a49-9817-b8004a7bf105
level: medium
logsource:
  product: windows
  service: firewall-as
modified: 2024/05/10
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: Uncommon New Firewall Rule Added In Windows Firewall Exception List
