author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/17
description: Detects when a all the rules have been deleted from the Windows Defender
  Firewall configuration
detection:
  condition: selection and not 1 of filter_main_* and not 1 of filter_optional_*
  filter_main_svchost:
    ModifyingApplication|endswith: :\Windows\System32\svchost.exe
  filter_optional_msmpeng:
    ModifyingApplication|contains|all:
    - :\ProgramData\Microsoft\Windows Defender\Platform\
    - \MsMpEng.exe
  selection:
    EventID:
    - 2033
    - 2059
id: 79609c82-a488-426e-abcf-9f341a39365d
level: high
logsource:
  product: windows
  service: firewall-as
modified: 2024/01/22
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: All Rules Have Been Deleted From The Windows Firewall Configuration
