author: frack113
date: 2023/02/26
description: Detects the addition of a new rule to the Windows Firewall exception
  list for an application located in a potentially suspicious location.
detection:
  condition: selection and not 1 of filter_main_*
  filter_main_block:
    Action: 2
  selection:
    ApplicationPath|contains:
    - :\PerfLogs\
    - :\Temp\
    - :\Tmp\
    - :\Users\Public\
    - :\Windows\Tasks\
    - :\Windows\Temp\
    - \AppData\Local\Temp\
    EventID:
    - 2004
    - 2071
    - 2097
falsepositives:
- Unknown
id: 9e2575e7-2cb9-4da1-adc8-ed94221dca5e
level: high
logsource:
  product: windows
  service: firewall-as
modified: 2024/05/10
references:
- https://docs.microsoft.com/en-us/previous-versions/windows/it-pro/windows-server-2008-r2-and-2008/dd364427(v=ws.10)
- https://app.any.run/tasks/7123e948-c91e-49e0-a813-00e8d72ab393/#
related:
- id: cde0a575-7d3d-4a49-9817-b8004a7bf105
  type: derived
status: experimental
tags:
- attack.defense_evasion
- attack.t1562.004
title: New Firewall Rule Added In Windows Firewall Exception List For Potential Suspicious
  Application
