author: Nasreddine Bencherchali (Nextron Systems)
date: 2023/01/09
description: Detects specific techniques often seen used inside of PowerShell scripts
  to obfscuate Alias creation
detection:
  condition: selection
  selection:
    ScriptBlockText|contains|all:
    - -Alias
    - ' -Value (-join('
falsepositives:
- Unknown
id: e8314f79-564d-4f79-bc13-fbc0bf2660d8
level: low
logsource:
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
  product: windows
references:
- Internal Research
related:
- id: 96cd126d-f970-49c4-848a-da3a09f55c55
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.execution
- attack.t1027
- attack.t1059.001
title: Potential PowerShell Obfuscation Using Character Join
