author: Nasreddine Bencherchali (Nextron Systems), Nikita Nazarov, oscd.community
date: 2020/10/06
description: Detects use of WinAPI functions in PowerShell scripts
detection:
  condition: 1 of selection_*
  selection_duplicate_token:
    ScriptBlockText|contains|all:
    - OpenProcessToken
    - DuplicateTokenEx
    - CloseHandle
  selection_injection:
    ScriptBlockText|contains|all:
    - VirtualAlloc
    - OpenProcess
    - WriteProcessMemory
    - CreateRemoteThread
  selection_process_write_read:
    ScriptBlockText|contains|all:
    - WriteProcessMemory
    - VirtualAlloc
    - ReadProcessMemory
    - VirtualFree
  selection_token_steal:
    ScriptBlockText|contains|all:
    - OpenProcessToken
    - LookupPrivilegeValue
    - AdjustTokenPrivileges
falsepositives:
- Unknown
id: 03d83090-8cba-44a0-b02f-0b756a050306
level: high
logsource:
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
  product: windows
modified: 2023/06/20
references:
- https://speakerdeck.com/heirhabarov/hunting-for-powershell-abuse
related:
- id: ba3f5c1b-6272-4119-9dbd-0bc8d21c2702
  type: similar
status: test
tags:
- attack.execution
- attack.t1059.001
- attack.t1106
title: Potential WinAPI Calls Via PowerShell Scripts
