author: frack113, Nasreddine Bencherchali (Nextron Systems)
date: 2023/07/18
description: Detects PowerShell scripts set ACL to of a file or a folder
detection:
  condition: selection
  selection:
    ScriptBlockText|contains|all:
    - 'Set-Acl '
    - '-AclObject '
    - '-Path '
falsepositives:
- Unknown
id: cae80281-ef23-44c5-873b-fd48d2666f49
level: low
logsource:
  category: ps_script
  definition: bade5735-5ab0-4aa7-a642-a11be0e40872
  product: windows
references:
- https://github.com/redcanaryco/atomic-red-team/blob/74438b0237d141ee9c99747976447dc884cb1a39/atomics/T1505.005/T1505.005.md
related:
- id: 0944e002-e3f6-4eb5-bf69-3a3067b53d73
  type: derived
- id: bdeb2cff-af74-4094-8426-724dc937f20a
  type: derived
- id: 3bf1d859-3a7e-44cb-8809-a99e066d3478
  type: derived
status: test
tags:
- attack.defense_evasion
- attack.t1222
title: PowerShell Script Change Permission Via Set-Acl - PsScript
