author: Florian Roth (Nextron Systems)
date: 2017/03/12
description: Detects suspicious PowerShell invocation command parameters
detection:
  condition: all of selection*
  selection_encoded:
    ScriptBlockText|contains:
    - ' -enc '
    - ' -EncodedCommand '
    - ' -ec '
  selection_hidden:
    ScriptBlockText|contains:
    - ' -w hidden '
    - ' -window hidden '
    - ' -windowstyle hidden '
    - ' -w 1 '
  selection_noninteractive:
    ScriptBlockText|contains:
    - ' -noni '
    - ' -noninteractive '
falsepositives:
- Very special / sneaky PowerShell scripts
id: ed965133-513f-41d9-a441-e38076a0798f
level: high
logsource:
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
  product: windows
modified: 2023/01/03
references:
- Internal Research
related:
- id: 3d304fda-78aa-43ed-975c-d740798a49c1
  type: derived
- id: bbb80e91-5746-4fbe-8898-122e2cafdbf4
  type: similar
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Invocations - Generic
