author: Florian Roth (Nextron Systems)
date: 2017/03/05
description: Detects suspicious PowerShell download command
detection:
  condition: webclient and download
  download:
    ScriptBlockText|contains:
    - .DownloadFile(
    - .DownloadFileAsync(
    - .DownloadString(
    - .DownloadStringAsync(
  webclient:
    ScriptBlockText|contains: System.Net.WebClient
falsepositives:
- PowerShell scripts that download content from the Internet
id: 403c2cc0-7f6b-4925-9423-bfa573bed7eb
level: medium
logsource:
  category: ps_script
  definition: 'Requirements: Script Block Logging must be enabled'
  product: windows
modified: 2022/12/02
references:
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadstring?view=net-8.0
- https://learn.microsoft.com/en-us/dotnet/api/system.net.webclient.downloadfile?view=net-8.0
related:
- id: 65531a81-a694-4e31-ae04-f8ba5bc33759
  type: derived
status: test
tags:
- attack.execution
- attack.t1059.001
title: Suspicious PowerShell Download - Powershell Script
